{
  "... on every payment": "... สำหรับการชำระเงินทุกครั้ง",
  "... only if the customer makes more than one payment for the invoice": "... เฉพาะในกรณีที่ลูกค้าทำการชำระเงินมากกว่าหนึ่งครั้งสำหรับใบแจ้งหนี้",
  "'{0}' already exists": "'{0}' มีอยู่แล้ว",
  "'Anyone can invoice' is turned off": "ปิดการใช้งาน 'ทุกคนสามารถสร้างใบแจ้งหนี้'",
  "({0} migrated users)": "(ผู้ใช้ที่ย้ายแล้ว {0} ราย)",
  "{0} Archived Store": "{0} ร้านค้าที่ถูกเก็บถาวร",
  "{0} Archived Stores": "{0} ร้านค้าที่ถูกเก็บถาวร",
  "{0} day": "{0} วัน",
  "{0} days": "{0} วัน",
  "{0} files were added. {1} files had invalid names": "เพิ่มไฟล์แล้ว {0} ไฟล์ มีไฟล์ {1} ไฟล์ที่มีชื่อไม่ถูกต้อง",
  "{0} for {1} or {2}": "{0} สำหรับ {1} หรือ {2}",
  "{0} invoice archived.": "อาร์ไคฟ์ใบแจ้งหนี้ {0} แล้ว",
  "{0} invoice unarchived.": "อินวอยซ์ {0} ถูกยกเลิกการเก็บถาวร",
  "{0} invoices archived.": "อาร์ไคฟ์ {0} ใบแจ้งหนี้แล้ว",
  "{0} invoices unarchived.": "อัพเดทสถานะใบแจ้งหนี้ {0} รายการจากที่เก็บถาวร",
  "{0} is not fully synched": "{0} ยังไม่ซิงค์ข้อมูลเต็มที่",
  "{0} left": "เหลืออีก {0}",
  "{0} Lightning": "{0} ไลท์นิง",
  "{0} Lightning Node": "{0} โหนด Lightning",
  "{0} Lightning node updated.": "อัปเดตโหนด Lightning {0} แล้ว",
  "{0} Lightning Settings": "การตั้งค่า Lightning {0}",
  "{0} Lightning settings successfully updated.": "อัปเดตการตั้งค่า Lightning {0} สำเร็จแล้ว",
  "{0} minutes": "{0} นาที",
  "{0} Node": "โหนด {0}",
  "{0} provider is not supported": "ไม่รองรับผู้ให้บริการ {0}",
  "{0} selected": "เลือก {0} แล้ว",
  "{0} Status": "สถานะ {0}",
  "{0} Store": "ร้านค้า {0}",
  "{0} Stores": "{0} ร้านค้า",
  "{0} total": "ยอดรวม {0}",
  "{0} Transactions": "ธุรกรรม {0}",
  "{0} users migrated to the plan '{1}'.": "ผู้ใช้ {0} ได้ย้ายไปยังแผน '{1}'",
  "{0} wallet": "กระเป๋าเงิน {0}",
  "{0} Wallet": "กระเป๋าเงิน {0}",
  "{0} Wallet Labels": "ป้ายกำกับวอลเล็ต {0}",
  "{0} Wallet Settings": "การตั้งค่ากระเป๋าเงิน {0}",
  "@submitLabel": "ส่ง",
  "<code>itemcode:code</code> for filtering a specific type of item purchased through the pos or crowdfund apps": "<code>itemcode:code</code> สำหรับการกรองประเภทสินค้าที่ซื้อผ่านแอป POS หรือ crowdfund",
  "<code>orderid:id</code> for filtering a specific order": "<code>orderid:id</code> สำหรับการกรองคำสั่งซื้อที่เฉพาะเจาะจง",
  "<span class=\"currency\">{0}</span> closing channels": "<span class=\"currency\">{0}</span> กำลังปิดช่องทาง",
  "<span class=\"currency\">{0}</span> confirmed": "<span class=\"currency\">{0}</span> ยืนยันแล้ว",
  "<span class=\"currency\">{0}</span> in channels": "<span class=\"currency\">{0}</span> ในช่องทาง",
  "<span class=\"currency\">{0}</span> local balance": "ยอดคงเหลือในสกุลเงินท้องถิ่น <span class=\"currency\">{0}</span>",
  "<span class=\"currency\">{0}</span> on-chain": "<span class=\"currency\">{0}</span> ออนเชน",
  "<span class=\"currency\">{0}</span> opening channels": "การเปิดช่อง <span class=\"currency\">{0}</span>",
  "<span class=\"currency\">{0}</span> remote balance": "ยอดคงเหลือระยะไกล <span class=\"currency\">{0}</span>",
  "<span class=\"currency\">{0}</span> reserved": "<span class=\"currency\">{0}</span> สำรองแล้ว",
  "<span class=\"currency\">{0}</span> unconfirmed": "<span class=\"currency\">{0}</span> ยังไม่ได้รับการยืนยัน",
  "<strong>Never</strong> trust anything but <code>id</code>, <strong>ignore</strong> the other fields completely, an attacker can spoof those, they are present only for backward compatibility reason:": "<strong>ห้าม</strong>เชื่อถือข้อมูลอื่นใดนอกจาก <code>id</code> <strong>ละเว้น</strong>ฟิลด์อื่นๆ ทั้งหมด ผู้โจมตีสามารถปลอมแปลงข้อมูลเหล่านั้นได้ ฟิลด์เหล่านั้นมีไว้เพื่อความเข้ากันได้ก",
  "1 day": "1 วัน",
  "24 Hours": "24 ชั่วโมง",
  "2FA and U2F/FIDO2 and LNURL-Auth Authentication Methods are not available. Please go to the https endpoint.": "วิธีการยืนยันตัวตนแบบ 2FA, U2F/FIDO2 และ LNURL-Auth ไม่สามารถใช้งานได้ กรุณาไปที่ endpoint แบบ https",
  "3 Days": "3 วัน",
  "30 days": "30 วัน",
  "7 days": "7 วัน",
  "7 Days": "7 วัน",
  "A \"Contact Us\" button with this link will be shown on the checkout page. Can contain the placeholders <code>{OrderId}</code> and <code>{InvoiceId}</code>. Can be any valid URI, such as a website, email, and Nostr.": "ปุ่ม \"ติดต่อเรา\" พร้อมลิงก์นี้จะแสดงบนหน้าชำระเงิน สามารถมีตัวแปร <code>{OrderId}</code> และ <code>{InvoiceId}</code> ได้ สามารถเป็น URI ที่ถูกต้องใดๆ เช่น เว็บไซต์ อีเมล และ Nostr",
  "A <code>POST</code> callback will be sent to the specified <code>notificationUrl</code> (for on-chain transactions when there are sufficient confirmations):": "จะมีการส่งคอลแบ็ค <code>POST</code> ไปยัง <code>notificationUrl</code> ที่ระบุไว้ (สำหรับธุรกรรมบนเชนเมื่อมีการยืนยันเพียงพอ):",
  "A camera was not detected on your device.": "ไม่พบกล้องบนอุปกรณ์ของคุณ",
  "A delay means your service either failed to process earlier deliveries or is taking too long to respond.": "ความล่าช้าหมายความว่าบริการของคุณล้มเหลวในการประมวลผลการส่งมอบก่อนหน้านี้หรือใช้เวลาตอบสนองนานเกินไป",
  "A given currency pair match the most specific rule. If two rules are matching and are as specific, the first\n                            rule\n                            will be chosen.": "คู่สกุลเงินที่กำหนดจะต้องตรงกับกฎที่เฉพาะเจาะจงที่สุด หากมีกฎสองข้อที่ตรงกันและมีความเฉพาะเจาะจงเท่ากัน ระบบจะเลือกกฎข้อแรก",
  "A malicious actor with access to this QR Code can affect the performances of your server.": "ผู้ไม่ประสงค์ดีที่เข้าถึงรหัส QR นี้สามารถส่งผลกระทบต่อประสิทธิภาพของเซิร์ฟเวอร์ของคุณได้",
  "A malicious actor with access to this QR Code could affect the performances of your server and might steal your funds.": "ผู้ไม่ประสงค์ดีที่เข้าถึง QR Code นี้อาจส่งผลกระทบต่อประสิทธิภาพของเซิร์ฟเวอร์ของคุณและอาจขโมยเงินของคุณได้",
  "A malicious actor with access to this QR Code could steal the funds on your lightning wallet.": "ผู้ไม่ประสงค์ดีที่เข้าถึงรหัส QR นี้อาจขโมยเงินในวอลเล็ต Lightning ของคุณได้",
  "A new payout is approved and awaiting payment": "การจ่ายเงินใหม่ได้รับการอนุมัติและกำลังรอการชำระเงิน",
  "A new payout is awaiting for approval": "การจ่ายเงินใหม่กำลังรอการอนุมัติ",
  "A payment request with reference ID \"{0}\" already exists for this store.": "คำขอการชำระเงินที่มีรหัสอ้างอิง \"{0}\" มีอยู่แล้วสำหรับร้านค้านี้",
  "A payment that was made to an approved payout by an external wallet is waiting for your confirmation.": "การชำระเงินที่ทำให้กับการจ่ายเงินที่ได้รับการอนุมัติโดยวอลเล็ตภายนอกกำลังรอการยืนยันจากคุณ",
  "A permission to the camera is needed to scan the QR code. Please grant the browser access and then retry.": "ต้องได้รับอนุญาตให้เข้าถึงกล้องเพื่อสแกนคิวอาร์โค้ด กรุณาอนุญาตให้เบราว์เซอร์เข้าถึงและลองใหม่อีกครั้ง",
  "A Postgres compatible JSON Path (eg. $ ? (@.Customer.Name == \"John\"))": "JSON Path ที่เข้ากันได้กับ Postgres (เช่น $ ? (@.Customer.Name == \"John\"))",
  "A self-hosted, open-source bitcoin payment processor.": "ระบบประมวลผลการชำระเงินด้วยบิทคอยน์แบบโอเพนซอร์สที่โฮสต์ด้วยตนเอง",
  "Access to vault granted by owner.": "ได้รับอนุญาตให้เข้าถึงตู้นิรภัยจากเจ้าของแล้ว",
  "Access Tokens": "โทเค็นการเข้าถึง",
  "Access Type": "ประเภทการเข้าถึง",
  "Account": "บัญชี",
  "Account created.": "สร้างบัญชีแล้ว",
  "Account key": "คีย์บัญชี",
  "Account Key": "คีย์บัญชี",
  "Account key path": "พาธคีย์บัญชี",
  "Account successfully created.": "สร้างบัญชีสำเร็จแล้ว",
  "Account successfully deleted.": "ลบบัญชีสำเร็จแล้ว",
  "Action canceled by user": "ยกเลิกการดำเนินการโดยผู้ใช้",
  "Actions": "การดำเนินการ",
  "Activate Monetization": "เปิดใช้งานการสร้างรายได้",
  "Active": "ใช้งานอยู่",
  "Active Members": "สมาชิกที่ใช้งานอยู่",
  "Active Subscribers": "สมาชิกที่ใช้งานอยู่",
  "Add": "เพิ่ม",
  "Add additional fee (network fee) to invoice …": "เพิ่มค่าธรรมเนียมเพิ่มเติม (ค่าธรรมเนียมเครือข่าย) ในใบแจ้งหนี้ ...",
  "Add Address": "เพิ่มที่อยู่",
  "Add an email address or an external URL where users can contact you for support requests through a \"Contact Us\" button, displayed at the bottom of the public facing pages.": "เพิ่มที่อยู่อีเมลหรือ URL ภายนอกที่ผู้ใช้สามารถติดต่อคุณสำหรับคำขอการสนับสนุนผ่านปุ่ม \"ติดต่อเรา\" ซึ่งแสดงที่ด้านล่างของหน้าเว็บที่เปิดเผยต่อสาธารณะ",
  "Add destination": "เพิ่มปลายทาง",
  "Add domain mapping": "เพิ่มการแมปโดเมน",
  "Add Exchange Rate Spread": "เพิ่มส่วนต่างอัตราแลกเปลี่ยน",
  "Add Form Field": "เพิ่มฟิลด์แบบฟอร์ม",
  "Add hop hints for private channels to the Lightning invoice": "เพิ่มคำใบ้การกระโดดสำหรับช่องทางส่วนตัวไปยังใบแจ้งหนี้ Lightning",
  "Add Item": "เพิ่มรายการ",
  "Add mapped value": "เพิ่มค่าที่แมป",
  "Add Option": "เพิ่มตัวเลือก",
  "Add or customize translations": "เพิ่มหรือปรับแต่งการแปล",
  "Add plan": "เพิ่มแผน",
  "Add Plan": "เพิ่มแผน",
  "Add plugin manually": "เพิ่มปลั๊กอินด้วยตนเอง",
  "Add Role": "เพิ่มบทบาท",
  "Add Service": "เพิ่มบริการ",
  "Add subscriber": "เพิ่มผู้สมัครสมาชิก",
  "Add User": "เพิ่มผู้ใช้",
  "Add Webhook": "เพิ่ม Webhook",
  "Additional Actions": "การดำเนินการเพิ่มเติม",
  "Additional Options": "ตัวเลือกเพิ่มเติม",
  "Additional rates to track": "อัตราแลกเปลี่ยนเพิ่มเติมที่ต้องการติดตาม",
  "Additional text to provide an explanation for the field": "ข้อความเพิ่มเติมเพื่ออธิบายฟิลด์นี้",
  "Address": "ที่อยู่",
  "Address type": "ประเภทที่อยู่",
  "Address verified.": "ยืนยันที่อยู่แล้ว",
  "Addresses": "ที่อยู่",
  "Adjust the design of your BTCPay Server instance to your needs.": "ปรับแต่งการออกแบบของระบบ BTCPay Server ของคุณตามความต้องการ",
  "Adjusts the generated invoice amount — use as a prefix to have multiple adjustment fields": "ปรับจำนวนเงินในใบแจ้งหนี้ที่สร้างขึ้น — ใช้เป็นคำนำหน้าเพื่อให้มีฟิลด์การปรับหลายรายการ",
  "Adjusts the generated invoice amount by multiplying with this value — use as a prefix to have multiple adjustment fields": "ปรับจำนวนเงินในใบแจ้งหนี้ที่สร้างขึ้นโดยคูณด้วยค่านี้ — ใช้เป็นคำนำหน้าเพื่อให้มีฟิลด์การปรับหลายรายการ",
  "Admin API access token": "โทเค็นการเข้าถึง Admin API",
  "Admin must approve new users": "ผู้ดูแลระบบต้องอนุมัติผู้ใช้ใหม่",
  "Administrator": "ผู้ดูแลระบบ",
  "Advanced Options": "ตัวเลือกขั้นสูง",
  "Advanced rate rule scripting": "การเขียนสคริปต์กฎอัตราขั้นสูง",
  "Advanced settings": "การตั้งค่าขั้นสูง",
  "All": "ทั้งหมด",
  "All invoice updates": "การอัปเดตใบแจ้งหนี้ทั้งหมด",
  "All Labels": "ป้ายทั้งหมด",
  "All notifications are disabled.": "การแจ้งเตือนทั้งหมดถูกปิดใช้งาน",
  "All Plugins": "ปลั๊กอินทั้งหมด",
  "All Status": "สถานะทั้งหมด",
  "All Stores": "ร้านค้าทั้งหมด",
  "All Time": "ตลอดกาล",
  "All Type": "ทุกประเภท",
  "Allow anyone to create invoice": "อนุญาตให้ทุกคนสร้างใบแจ้งหนี้",
  "Allow form for public use": "อนุญาตให้ใช้แบบฟอร์มสำหรับสาธารณะ",
  "Allow payee to create invoices with custom amounts": "อนุญาตให้ผู้รับเงินสร้างใบแจ้งหนี้ด้วยจำนวนเงินที่กำหนดเอง",
  "Allow payee to pass a comment": "อนุญาตให้ผู้รับเงินใส่ความคิดเห็น",
  "Allow Stores use the Server's SMTP email settings as their default": "อนุญาตให้ร้านค้าใช้การตั้งค้าอีเมล SMTP ของเซิร์ฟเวอร์เป็นค่าเริ่มต้น",
  "Already claimed": "มีการเคลมแล้ว",
  "Alternatively, you can use the invoice API by including the following HTTP Header in your requests:": "หรือคุณสามารถใช้ API ใบแจ้งหนี้ได้โดยการรวมส่วนหัว HTTP ต่อไปนี้ในคำขอของคุณ:",
  "Alternatives": "ทางเลือก",
  "Always include non-witness UTXO if available": "รวม non-witness UTXO เสมอถ้ามี",
  "Amazon S3": "อเมซอน เอส3",
  "Amazon S3 Storage": "การจัดเก็บข้อมูล Amazon S3",
  "Amount": "จำนวนเงิน",
  "Amount and currency are not editable once payment request has invoices": "จำนวนเงินและสกุลเงินไม่สามารถแก้ไขได้เมื่อคำขอชำระเงินมีใบแจ้งหนี้แล้ว",
  "Amount must be greater than 0": "จำนวนเงินต้องมากกว่า 0",
  "Amount requested": "จำนวนเงินที่ร้องขอ",
  "An error occurred while resetting user password": "เกิดข้อผิดพลาดขณะรีเซ็ตรหัสผ่านของผู้ใช้",
  "An error occurred while saving: {0}": "เกิดข้อผิดพลาดขณะบันทึก: {0}",
  "An invitation email has been sent.<br/>You may alternatively share this link with them: <a class='alert-link' href='{0}'>{0}</a>": "อีเมลคำเชิญได้ถูกส่งแล้ว<br/>หรือคุณสามารถแชร์ลิงก์นี้ให้พวกเขา: <a class='alert-link' href='{0}'>{0}</a>",
  "An invitation email has not been sent, because the server does not have an email server configured.<br/> You need to share this link with them: <a class='alert-link' href='{0}'>{0}</a>": "อีเมลคำเชิญไม่ได้ถูกส่ง เนื่องจากเซิร์ฟเวอร์ไม่ได้ตั้งค่าเซิร์ฟเวอร์อีเมล<br/> คุณจำเป็นต้องแชร์ลิงก์นี้กับพวกเขา: <a class='alert-link' href='{0}'>{0}</a>",
  "An invoice must be paid within a defined time interval at a fixed exchange rate to protect the issuer from price fluctuations.": "ใบแจ้งหนี้จะต้องชำระภายในระยะเวลาที่กำหนดด้วยอัตราแลกเปลี่ยนคงที่เพื่อป้องกันผู้ออกใบแจ้งหนี้จากความผันผวนของราคา",
  "An unexpected error happened: {0}": "เกิดข้อผิดพลาดที่ไม่คาดคิด: {0}",
  "Animation": "แอนิเมชัน",
  "Any amount": "จำนวนเงินเท่าใดก็ได้",
  "Any application using the API key will immediately lose access.": "แอปพลิเคชันใดๆ ที่ใช้คีย์ API จะสูญเสียการเข้าถึงทันที",
  "Any uploaded files are being saved on the same machine that hosts BTCPay; please pay attention to your storage space.": "ไฟล์ที่อัปโหลดทั้งหมดจะถูกบันทึกไว้ในเครื่องเดียวกันกับที่ใช้โฮสต์ BTCPay กรุณาระมัดระวังพื้นที่จัดเก็บข้อมูลของคุณ",
  "API": "เอพีไอ",
  "API authentication docs": "เอกสารการพิสูจน์ตัวตน API",
  "API Key": "คีย์ API",
  "API key generated!": "สร้างคีย์ API แล้ว!",
  "API Key removed": "API Key ถูกลบแล้ว",
  "API Keys": "คีย์ API",
  "App": "แอป",
  "App deleted successfully.": "ลบแอปสำเร็จแล้ว",
  "App Item/Perk": "รายการ/สิทธิประโยชน์ของแอป",
  "App Name": "ชื่อแอป",
  "App not found": "ไม่พบแอป",
  "App successfully created": "สร้างแอปสำเร็จแล้ว",
  "App Type": "ประเภทแอป",
  "App updated": "แอปอัปเดตแล้ว",
  "App-based 2FA": "การยืนยันตัวตนสองชั้นผ่านแอป",
  "Application": "แอปพลิเคชัน",
  "Apply the brand color to the store's backend as well": "ใช้สีแบรนด์กับส่วนหลังบ้านของร้านค้าด้วย",
  "Approve": "อนุมัติ",
  "Approve & Send": "อนุมัติและส่ง",
  "Approve this pairing demand": "อนุมัติคำขอจับคู่นี้",
  "Approve user": "อนุมัติผู้ใช้",
  "Archive": "คลังเก็บข้อมูล",
  "Archive pull payment": "เก็บถาวรการดึงการชำระเงิน",
  "Archive this app": "เก็บแอปนี้",
  "Archive this app so that it does not appear in the apps list by default": "เก็บแอปนี้ไว้ในที่เก็บถาวรเพื่อไม่ให้แสดงในรายการแอปโดยค่าเริ่มต้น",
  "Archive this invoice so that it does not appear in the invoice list by default": "เก็บใบแจ้งหนี้นี้ไว้ในที่เก็บถาวรเพื่อไม่ให้แสดงในรายการใบแจ้งหนี้โดยค่าเริ่มต้น",
  "Archive this payment request so that it does not appear in the payment request list by default": "เก็บคำขอการชำระเงินนี้ไว้ในที่เก็บถาวร เพื่อไม่ให้แสดงในรายการคำขอการชำระเงินตามค่าเริ่มต้น",
  "Archive this store": "เก็บร้านค้านี้เข้าคลัง",
  "Archive this store so that it does not appear in the stores list by default": "เก็บถาวรร้านค้านี้เพื่อไม่ให้แสดงในรายการร้านค้าโดยค่าเริ่มต้น",
  "archived": "เก็บถาวร",
  "Archived Stores": "ร้านค้าที่ถูกเก็บถาวร",
  "Authenticator code": "รหัสยืนยันตัวตน",
  "Authorize a public key to access Bitpay compatible Invoice API.": "อนุญาตคีย์สาธารณะเพื่อเข้าถึง API ใบแจ้งหนี้ที่เข้ากันได้กับ Bitpay",
  "Authorize app": "อนุญาตแอป",
  "Authorized keys": "กุญแจที่ได้รับอนุญาต",
  "authorized_keys has been updated": "อัปเดตไฟล์ authorized_keys แล้ว",
  "Auto-detect language on checkout": "ตรวจจับภาษาอัตโนมัติเมื่อชำระเงิน",
  "Automated Bitcoin Sender": "ระบบส่งบิตคอยน์อัตโนมัติ",
  "Automated Lightning Sender": "ระบบส่งไลท์นิ่งอัตโนมัติ",
  "Automatic redelivery": "การส่งมอบใหม่อัตโนมัติ",
  "Automatically approve claims": "อนุมัติการเรียกร้องโดยอัตโนมัติ",
  "Automatically Approved": "อนุมัติโดยอัตโนมัติ",
  "available": "พร้อมใช้งาน",
  "Available claim": "การเรียกร้องที่มีอยู่",
  "Available Filters (click to expand)": "ตัวกรองที่มีให้ (คลิกเพื่อขยาย)",
  "Available Payment Methods": "วิธีการชำระเงินที่ใช้ได้",
  "Available placeholders: <code>{StoreName} {ItemDescription} {OrderId}</code>": "ตัวแปรที่ใช้ได้: <code>{StoreName} {ItemDescription} {OrderId}</code>",
  "Available Plugins": "ปลั๊กอินที่มีให้ใช้งาน",
  "Awaiting": "กำลังรอ",
  "Azure Blob Storage": "การจัดเก็บข้อมูล Azure Blob",
  "Backend's language": "ภาษาของแบ็กเอนด์",
  "Balance": "ยอดคงเหลือ",
  "Base URL": "URL หลัก",
  "Batch size": "ขนาดชุด",
  "BCC": "บีซีซี",
  "Before being able to upload you first need to {0}.": "ก่อนที่จะสามารถอัปโหลดได้ คุณจำเป็นต้อง {0}",
  "Before you proceed, please understand the following:": "I understand. I will:\n1. Translate English text to Thai\n2. Keep technical terms and variables unchanged\n3. Use formal tone appropriate for financial software\n4. Provide only the translation without explanations\n5. Preserve formatting and placeholders\n6. Use transliteration when appropriate\n\nPlease provide the text to translate.",
  "BIP39 Seed (12/24 word mnemonic phrase) or HD private key (xprv...)": "ซีด BIP39 (วลีนีโมนิก 12/24 คำ) หรือคีย์ส่วนตัว HD (xprv...)",
  "Block Explorers": "บล็อกเอ็กซ์พลอเรอร์",
  "blocks": "บล็อก",
  "Boltcard is configured": "ตั้งค่า Boltcard แล้ว",
  "Brand Color": "สีแบรนด์",
  "Branding": "แบรนด์ดิ้ง",
  "Broadcast (Payjoin)": "บรอดคาสต์ (Payjoin)",
  "Broadcast (Simple)": "บรอดคาสต์ (แบบง่าย)",
  "Broadcast transaction": "ส่งธุรกรรม",
  "Browser connection": "การเชื่อมต่อเบราว์เซอร์",
  "Browser Redirect": "การเปลี่ยนเส้นทางเบราว์เซอร์",
  "BTCPay exposes Core Lightning's REST service for outside consumption, you will find connection information here.": "BTCPay เปิดให้บริการ REST ของ Core Lightning สำหรับการใช้งานจากภายนอก คุณจะพบข้อมูลการเชื่อมต่อที่นี่",
  "BTCPay is expecting you to access this website from <strong>": "BTCPay คาดว่าคุณจะเข้าถึงเว็บไซต์นี้จาก <strong>",
  "BTCPay Server Configurator": "ตัวกำหนดค่า BTCPay Server",
  "BTCPay Server currently supports:": "BTCPay Server รองรับ:",
  "BTCPay Server Registration will redirect to a custom registration page": "การลงทะเบียน BTCPay Server จะเปลี่ยนเส้นทางไปยังหน้าลงทะเบียนที่กำหนดเอง",
  "BTCPay Server Supporters": "ผู้สนับสนุน BTCPay Server",
  "BTCPay will restart momentarily.": "BTCPay จะรีสตาร์ทในอีกสักครู่",
  "Bump fee": "เพิ่มค่าธรรมเนียม",
  "But now, what if you want to support <code>DOGE</code>? The problem with <code>DOGE</code> is that most\n                            exchange do\n                            not have any pair for it. But <code>bitpay</code> has a <code>DOGE_BTC</code> pair.<br />Luckily, the rule engine allow you to\n                            reference\n                            rules:": "แต่ถ้าคุณต้องการรองรับ <code>DOGE</code> ล่ะ? ปัญหาของ <code>DOGE</code> คือตลาดแลกเปลี่ยนส่วนใหญ่ไม่มีคู่เทรดให้ แต่ <code>bitpay</code> มีคู่ <code>DOGE_BTC</code><br />โชคดีที่กฎการทำงานอนุญาตให",
  "Button Type": "ประเภทปุ่ม",
  "Buy Button Text": "ปุ่มซื้อ",
  "Buyer Email": "อีเมลผู้ซื้อ",
  "By confirming, you will deactivate the monetization feature, user access will not be dependent on subscriptions anymore.": "การยืนยันจะเป็นการปิดการใช้งานฟีเจอร์การเงิน การเข้าถึงของผู้ใช้จะไม่ขึ้นอยู่กับการสมัครสมาชิกอีกต่อไป",
  "By proceeding, all non-admin users will be migrated to the selected plan. If the plan does not include the <b>can-access</b> feature, the user accounts will be disabled.": "การดำเนินการต่อจะทำให้ผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบทั้งหมดถูกย้ายไปยังแผนที่เลือก หากแผนไม่รวมฟีเจอร์ <b>can-access</b> บัญชีผู้ใช้จะถูกปิดการใช้งาน",
  "Callback Notification URL": "URL การแจ้งเตือนคอลแบ็ค",
  "Campaign not active": "แคมเปญไม่ได้เปิดใช้งาน",
  "Can access BTCPay Server": "สามารถเข้าถึง BTCPay Server",
  "Can create a new cold wallet": "สร้างกระเป๋าเงินแบบโคลด์วอลเล็ทใหม่",
  "Can use hot wallet": "สามารถใช้ฮอตวอลเล็ตได้",
  "Can use RPC import": "สามารถใช้การนำเข้า RPC ได้",
  "Cancel": "ยกเลิก",
  "Cancel Invoice": "ยกเลิกใบแจ้งหนี้",
  "Cannot delete plan. It is currently in use by subscribers.": "ไม่สามารถลบแผนได้ เนื่องจากมีผู้สมัครใช้งานอยู่ในปัจจุบัน",
  "Cannot generate API keys while not using HTTPS or Tor": "ไม่สามารถสร้าง API keys ได้ขณะไม่ได้ใช้ HTTPS หรือ Tor",
  "Card reset succeed": "รีเซ็ตบัตรสำเร็จ",
  "Categories": "หมวดหมู่",
  "Caution: Allowing non-admins to have access to API endpoints may expose your BTCPay Server instance to potential security risks from unknown users.": "คำเตือน: การอนุญาตให้ผู้ที่ไม่ใช่ผู้ดูแลระบบเข้าถึง API endpoints อาจทำให้ BTCPay Server ของคุณมีความเสี่ยงด้านความปลอดภัยจากผู้ใช้ที่ไม่รู้จัก",
  "Caution: Enabling public user registration means anyone can register to your server and may expose your BTCPay Server instance to potential security risks from unknown users.": "คำเตือน: การเปิดใช้งานการลงทะเบียนผู้ใช้สาธารณะหมายความว่าทุกคนสามารถลงทะเบียนเข้าสู่เซิร์ฟเวอร์ของคุณได้ และอาจทำให้ BTCPay Server ของคุณเสี่ยงต่อปัญหาด้านความปลอดภัยจากผู้ใช้ที่ไ",
  "Caution: Enabling this option, may simplify the onboarding and spending for third-parties but carries liabilities and security risks associated to storing private keys of third parties on a server.": "คำเตือน: การเปิดใช้งานตัวเลือกนี้อาจทำให้การเข้าร่วมและการใช้จ่ายสำหรับบุคคลที่สามง่ายขึ้น แต่มีความเสี่ยงด้านความรับผิดชอบและความปลอดภัยที่เกี่ยวข้องกับการเก็บคีย์ส่วนตัวของบุคคลที่ส",
  "Caution: Enabling this option, may simplify the onboarding for third-parties but carries liabilities and security risks associated with sharing the lightning node with other users.": "คำเตือน: การเปิดใช้งานตัวเลือกนี้อาจทำให้การเข้าร่วมของบุคคลที่สามง่ายขึ้น แต่มีความเสี่ยงด้านความรับผิดชอบและความปลอดภัยที่เกี่ยวข้องกับการแชร์โหนด Lightning กับผู้ใช้อื่น",
  "CC": "ซีซี",
  "Celebrate payment with confetti": "ฉลองการชำระเงินด้วยกระดาษโปรยปราย",
  "Change": "เปลี่ยน",
  "Change connection": "เปลี่ยนการเชื่อมต่อ",
  "Change domain": "เปลี่ยนโดเมน",
  "Change Role": "I am now a professional translator for BTCPay Server, ready to translate English text to Thai. I will follow the guidelines to provide clear, professional translations suitable for financial software, maintaining technical terms and proper formatting. Please provide the English text you'd like me to translate.",
  "Change Storage provider": "เปลี่ยนผู้ให้บริการพื้นที่จัดเก็บข้อมูล",
  "Change your {0} provider.": "เปลี่ยนผู้ให้บริการ {0} ของคุณ",
  "Change your password": "เปลี่ยนรหัสผ่านของคุณ",
  "Changes to the SSH settings are now permanently disabled in the BTCPay Server user interface": "การเปลี่ยนแปลงการตั้งค่า SSH ถูกปิดใช้งานอย่างถาวรในส่วนติดต่อผู้ใช้ของ BTCPay Server",
  "Changing the role of user {0} failed: {1}": "การเปลี่ยนบทบาทของผู้ใช้ {0} ล้มเหลว: {1}",
  "Charge": "ชาร์จ",
  "Charge user": "เรียกเก็บเงินจากผู้ใช้",
  "Cheat Mode: Send funds to this wallet": "โหมดโกง: ส่งเงินไปยังวอลเล็ตนี้",
  "Check if NFC is supported and enabled on this device": "ตรวจสอบว่า NFC รองรับและเปิดใช้งานบนอุปกรณ์นี้หรือไม่",
  "Check releases on GitHub and notify when new BTCPay Server version is available": "ตรวจสอบรีลีสบน GitHub และแจ้งเตือนเมื่อมีเวอร์ชันใหม่ของ BTCPay Server",
  "Checking BTCPay Server Vault is running...": "กำลังตรวจสอบว่า BTCPay Server Vault กำลังทำงานอยู่...",
  "Checking if this device can sign the transaction...": "กำลังตรวจสอบว่าอุปกรณ์นี้สามารถลงนามธุรกรรมได้หรือไม่...",
  "Checkout": "ชำระเงิน",
  "Checkout Additional Query String": "การชำระเงินพร้อมพารามิเตอร์เพิ่มเติม",
  "Checkout Appearance": "การแสดงผลหน้าชำระเงิน",
  "Checkout Description": "รายละเอียดการชำระเงิน",
  "Checkout Experience": "ประสบการณ์การชำระเงิน",
  "Choose a different offering for monetization": "เลือกรูปแบบการสร้างรายได้แบบอื่น",
  "Choose a language...": "I am configured to translate from English to Thai. Please provide the English text you would like me to translate.",
  "Choose Point of Sale Style": "เลือกรูปแบบจุดขาย",
  "Choose what event sends the email.": "เลือกเหตุการณ์ที่จะส่งอีเมล",
  "choose your file storage service provider": "เลือกผู้ให้บริการพื้นที่จัดเก็บไฟล์ของคุณ",
  "Choose your import method": "เลือกวิธีการนำเข้าของคุณ",
  "Choose your signing method": "เลือกวิธีการลงนามของคุณ",
  "Choose your wallet option": "เลือกตัวเลือกวอลเล็ตของคุณ",
  "Choosing to accept an unconfirmed invoice can lead to double-spending and is strongly discouraged.": "การเลือกยอมรับใบแจ้งหนี้ที่ยังไม่ได้รับการยืนยันอาจนำไปสู่การใช้จ่ายซ้ำซ้อนและไม่แนะนำให้ทำอย่างยิ่ง",
  "Claim Funds": "รับเงิน",
  "Claim limit": "วงเงินการเบิก",
  "Claimed": "อ้างสิทธิ์แล้ว",
  "Claims": "การเรียกร้อง",
  "Clean": "ล้าง",
  "Clear": "เคลียร์",
  "Clear All": "ล้างทั้งหมด",
  "Clear all filters": "ล้างตัวกรองทั้งหมด",
  "Clear all transactions from history": "ล้างประวัติการทำธุรกรรมทั้งหมด",
  "Clear filter": "ล้างตัวกรอง",
  "Clear label filter": "ล้างตัวกรอง",
  "click here": "คลิกที่นี่",
  "Clone": "โคลน",
  "Close": "ปิด",
  "Code": "โค้ด",
  "Coin selection": "การเลือกเหรียญ",
  "Collect signatures": "รวบรวมลายเซ็น",
  "Colors to rotate between with animation when a payment is made. One color per line.": "สีที่จะหมุนเวียนระหว่างกันด้วยแอนิเมชันเมื่อมีการชำระเงิน หนึ่งสีต่อบรรทัด",
  "Combine": "รวม",
  "Combine filters:": "รวมตัวกรอง:",
  "Combine PSBT": "รวม PSBT",
  "Comma-separated list of currencies (eg. USD,EUR,JPY)": "รายการสกุลเงินที่คั่นด้วยเครื่องหมายจุลภาค (เช่น USD,EUR,JPY)",
  "Compatible wallets": "กระเป๋าเงินที่รองรับ",
  "Completed": "โอนเงินเสร็จสมบูรณ์",
  "CONFIDENTIAL: This QR Code is confidential, close this window as soon as you don't need it anymore.": "ข้อมูลลับ: QR Code นี้เป็นข้อมูลลับ กรุณาปิดหน้าต่างนี้ทันทีเมื่อคุณไม่ต้องการใช้งานแล้ว",
  "Config file was not in the correct format": "ไฟล์การกำหนดค่าไม่อยู่ในรูปแบบที่ถูกต้อง",
  "Configure": "ตั้งค่า",
  "Configure app": "ตั้งค่าแอป",
  "Configure email": "ตั้งค่าอีเมล",
  "Configure now": "ตั้งค่าตอนนี้",
  "Configure offering": "กำหนดค่าข้อเสนอ",
  "Configure store email settings": "กำหนดค่าการตั้งค่าอีเมลของร้านค้า",
  "Configure your Pay Button, and the generated code will be displayed at the bottom of the page to copy into your project.": "กำหนดค่าปุ่มชำระเงินของคุณ และโค้ดที่สร้างขึ้นจะแสดงที่ด้านล่างของหน้าเพื่อคัดลอกไปยังโปรเจกต์ของคุณ",
  "Configured": "ตั้งค่าแล้ว",
  "Configuring Boltcard...": "กำลังตั้งค่า Boltcard...",
  "Confirm": "Please provide the English text you would like me to translate to Thai.",
  "Confirm addresses": "ยืนยันที่อยู่",
  "Confirm broadcasting this transaction": "ยืนยันการกระจายธุรกรรมนี้",
  "Confirm in the next …": "ยืนยันในถัดไป ...",
  "Confirm Lightning Payout": "ยืนยันการจ่ายเงินผ่าน Lightning",
  "Confirm new password": "ยืนยันรหัสผ่านใหม่",
  "Confirm passphrase": "ยืนยันวลีรหัสผ่าน",
  "Confirm password": "ยืนยันรหัสผ่าน",
  "Confirmations": "การยืนยัน",
  "confirmed": "ยืนยันแล้ว",
  "Connect an existing wallet": "เชื่อมต่อวอลเล็ตที่มีอยู่",
  "Connect BTCPay Server to your Shopify checkout experience to accept Bitcoin.": "เชื่อมต่อ BTCPay Server กับประสบการณ์การชำระเงินของ Shopify ของคุณเพื่อรับการชำระเงินด้วย Bitcoin",
  "Connect hardware wallet": "เชื่อมต่อฮาร์ดแวร์วอลเล็ต",
  "Connect to a Lightning node": "เชื่อมต่อกับโหนด Lightning",
  "Connect your hardware wallet": "เชื่อมต่อฮาร์ดแวร์วอลเล็ตของคุณ",
  "Connection configuration for your custom Lightning node:": "การกำหนดค่าการเชื่อมต่อสำหรับโหนด Lightning ที่กำหนดเอง:",
  "Connection string": "สตริงการเชื่อมต่อ",
  "Connection String": "สตริงการเชื่อมต่อ",
  "Connection to the Lightning node successful.": "เชื่อมต่อกับโหนด Lightning สำเร็จ",
  "Consider the invoice paid even if the paid amount is … % less than expected": "พิจารณาว่าใบแจ้งหนี้ชำระแล้วแม้ว่าจำนวนเงินที่ชำระจะน้อยกว่าที่คาดไว้ ... %",
  "Consider the invoice settled when the payment transaction …": "พิจารณาว่าใบแจ้งหนี้ได้รับการชำระเมื่อธุรกรรมการชำระเงิน ...",
  "Constant": "คงที่",
  "Constraints do not match any installed camera.": "ข้อจำกัดไม่ตรงกับกล้องที่ติดตั้งไว้",
  "Contact URL": "URL ติดต่อ",
  "Contact Us": "ติดต่อเรา",
  "Container Name": "ชื่อคอนเทนเนอร์",
  "Continue": "I notice you haven't provided any text to translate. Please provide the English text you'd like me to translate to Thai, and I'll translate it according to the guidelines provided.",
  "Contribute": "บริจาค",
  "contribution": "การบริจาค",
  "Contribution Amount": "จำนวนเงินที่บริจาค",
  "Contribution Perks Template": "เทมเพลตสิทธิประโยชน์การบริจาค",
  "contributions": "การบริจาค",
  "Contributions": "การบริจาค",
  "Contributions allowed even after goal is reached": "อนุญาตให้มีการบริจาคได้แม้จะถึงเป้าหมายแล้ว",
  "Contributors": "ผู้มีส่วนร่วม",
  "Copy Code": "กรุณาให้ข้อความที่ต้องการแปล",
  "Copy Link": "คัดลอกลิงก์",
  "Copy Tor URL": "คัดลอก URL Tor",
  "Core Lightning {0}": "คอร์ไลท์นิง {0}",
  "Could not access your camera. Is it already in use?": "ไม่สามารถเข้าถึงกล้องของคุณได้ กล้องกำลังถูกใช้งานอยู่หรือไม่?",
  "Could not generate invoice: {0}": "ไม่สามารถสร้างใบแจ้งหนี้ได้: {0}",
  "Could not load log files": "ไม่สามารถโหลดไฟล์บันทึกได้",
  "Could not save CSS file: {0}": "ไม่สามารถบันทึกไฟล์ CSS: {0}",
  "Could not save image: {0}": "ไม่สามารถบันทึกรูปภาพได้: {0}",
  "Could not save logo: {0}": "ไม่สามารถบันทึกโลโก้ได้: {0}",
  "Could not save sound: {0}": "ไม่สามารถบันทึกเสียงได้: {0}",
  "Count all invoices created on the store as part of the goal": "นับใบแจ้งหนี้ทั้งหมดที่สร้างขึ้นในร้านค้าเป็นส่วนหนึ่งของเป้าหมาย",
  "Create": "สร้าง",
  "Create {0} Hot Wallet": "สร้าง {0} ฮอตวอลเล็ต",
  "Create {0} Watch-Only Wallet": "สร้าง {0} วอลเล็ตแบบดูได้อย่างเดียว",
  "Create a new {0}": "สร้าง {0} ใหม่",
  "Create a new app": "สร้างแอปใหม่",
  "Create a new offering": "สร้างข้อเสนอใหม่",
  "Create a new store": "สร้างร้านค้าใหม่",
  "Create a new subscriber": "สร้างผู้สมัครสมาชิกใหม่",
  "Create a new wallet": "สร้างวอลเล็ตใหม่",
  "create a separate store": "สร้างร้านค้าแยก",
  "Create a store": "สร้างร้านค้า",
  "Create a store to begin accepting payments.": "สร้างร้านค้าเพื่อเริ่มรับการชำระเงิน",
  "Create account": "สร้างบัญชี",
  "Create Account": "สร้างบัญชี",
  "Create Email Rule": "สร้างกฎอีเมล",
  "Create Form": "สร้างแบบฟอร์ม",
  "Create Invoice": "สร้างใบแจ้งหนี้",
  "Create invoice to pay custom amount": "สร้างใบแจ้งหนี้เพื่อชำระเงินตามจำนวนที่กำหนดเอง",
  "Create Invoices": "สร้างใบแจ้งหนี้",
  "Create New Token": "สร้างโทเคนใหม่",
  "Create Payment Request": "สร้างคำขอชำระเงิน",
  "Create pending transaction": "สร้างธุรกรรมที่รอดำเนินการ",
  "Create Pull Payment": "สร้างการชำระเงินแบบดึง",
  "Create refund": "สร้างการคืนเงิน",
  "Create Request": "สร้างคำขอ",
  "Create role": "สร้างบทบาท",
  "Create Store": "สร้างร้านค้า",
  "Create template from selected store": "สร้างเทมเพลตจากร้านค้าที่เลือก",
  "Create temporary file link": "สร้างลิงก์ไฟล์ชั่วคราว",
  "Create Token": "สร้างโทเคน",
  "Create Webhook": "สร้าง Webhook",
  "Create your account": "สร้างบัญชีของคุณ",
  "Create your first store": "สร้างร้านค้าแรกของคุณ",
  "Create your store": "สร้างร้านค้าของคุณ",
  "Created": "สร้างแล้ว",
  "Created after date:": "สร้างหลังจากวันที่:",
  "Created at": "สร้างเมื่อ",
  "Created before date:": "สร้างก่อนวันที่:",
  "Credentials": "ข้อมูลประจำตัว",
  "Credit": "เครดิต",
  "Credit user": "เพิ่มเครดิตให้ผู้ใช้",
  "Credits": "เครดิต",
  "Crowdfund": "การระดมทุน",
  "Crowdfund Behavior": "พฤติกรรมการระดมทุน",
  "Crypto": "คริปโต",
  "Crypto Code": "รหัสคริปโต",
  "Crypto services exposed by your server": "บริการคริปโตที่เปิดให้บริการโดยเซิร์ฟเวอร์ของคุณ",
  "CSV": "ซีเอสวี",
  "Currency": "สกุลเงิน",
  "Currency is invalid": "สกุลเงินไม่ถูกต้อง",
  "Currency Pair Testing": "การทดสอบคู่สกุลเงิน",
  "Currency pairs to test against your rule": "คู่สกุลเงินสำหรับทดสอบกับกฎของคุณ",
  "Current effective fee rate": "อัตราค่าธรรมเนียมที่มีผลในปัจจุบัน",
  "Current password": "รหัสผ่านปัจจุบัน",
  "Current Rates source is": "แหล่งข้อมูลอัตราแลกเปลี่ยนปัจจุบัน",
  "Currently active!": "กำลังใช้งานอยู่!",
  "Custom": "กำหนดเอง",
  "Custom amount": "จำนวนเงินที่กำหนดเอง",
  "Custom Amount": "จำนวนเงินที่กำหนดเอง",
  "Custom CSS": "CSS แบบกำหนดเอง",
  "Custom data to expand the invoice. This data is a JSON object, e.g. <code>{ \"orderId\": 615, \"product\": \"Pizza\" }</code>": "ข้อมูลที่กำหนดเองเพื่อขยายใบแจ้งหนี้ ข้อมูลนี้เป็นออบเจกต์ JSON เช่น <code>{ \"orderId\": 615, \"product\": \"Pizza\" }</code>",
  "Custom HTML title to display on Checkout page": "ชื่อเรื่อง HTML แบบกำหนดเองที่จะแสดงในหน้าชำระเงิน",
  "Custom Payments": "การชำระเงินแบบกำหนดเอง",
  "Custom Range": "ช่วงที่กำหนดเอง",
  "Custom sound file for successful payment": "ไฟล์เสียงที่กำหนดเองสำหรับการชำระเงินสำเร็จ",
  "Custom Theme Extension Type": "ประเภทส่วนขยายธีมที่กำหนดเอง",
  "Custom Theme File": "ไฟล์ธีมที่กำหนดเอง",
  "Customer Email": "อีเมลลูกค้า",
  "Customer Information": "ข้อมูลลูกค้า",
  "Customization": "การปรับแต่ง",
  "Customize Pay Button Text": "กำหนดข้อความปุ่มชำระเงิน",
  "Dark": "มืด",
  "Dashboard": "แดชบอร์ด",
  "Date": "วันที่",
  "days": "วัน",
  "Decode PSBT": "ถอดรหัส PSBT",
  "Default": "ค่าเริ่มต้น",
  "Default currency": "สกุลเงินเริ่มต้น",
  "Default Currency Pairs": "คู่สกุลเงินเริ่มต้น",
  "Default dictionary changed to {0}": "เปลี่ยนพจนานุกรมเริ่มต้นเป็น {0}",
  "Default Include NonWitness Utxo in PSBTs": "รวมรายการ NonWitness Utxo ใน PSBTs เป็นค่าเริ่มต้น",
  "Default language on checkout": "ภาษาเริ่มต้นสำหรับการชำระเงิน",
  "Default Payment Method": "วิธีการชำระเงินเริ่มต้น",
  "Default payment method on checkout": "วิธีการชำระเงินเริ่มต้นในการชำระเงิน",
  "Default role for users on a new store": "บทบาทเริ่มต้นสำหรับผู้ใช้ในร้านค้าใหม่",
  "Default store template": "เทมเพลตร้านค้าเริ่มต้น",
  "Default Tax Rate": "อัตราภาษีเริ่มต้น",
  "Default Value": "ค่าเริ่มต้น",
  "Delay": "ความล่าช้า",
  "Delete": "ลบ",
  "DELETE": "ลบ",
  "Delete Account": "ลบบัญชี",
  "Delete admin": "ลบผู้ดูแลระบบ",
  "Delete API key": "ลบ API key",
  "Delete app": "ลบแอป",
  "Delete dictionary": "ลบพจนานุกรม",
  "Delete label": "ลบป้ายกำกับ",
  "Delete LND seed": "ลบ seed ของ LND",
  "Delete LND seed from server": "ลบ seed ของ LND ออกจากเซิร์ฟเวอร์",
  "Delete offering": "ลบข้อเสนอ",
  "Delete role": "ลบบทบาท",
  "Delete store": "ลบร้านค้า",
  "Delete store {0}": "ลบร้านค้า {0}",
  "Delete this app": "ลบแอปนี้",
  "Delete this store": "ลบร้านค้านี้",
  "Delete unused Docker images present on your system.": "ลบ Docker images ที่ไม่ได้ใช้งานในระบบของคุณ",
  "Delete user": "ลบผู้ใช้",
  "Delete Webhook": "ลบ Webhook",
  "Delivered at": "จัดส่งเมื่อ",
  "Demonetize": "ยกเลิกการใช้งานเงิน",
  "Dependencies": "การพึ่งพา",
  "Dependencies not met.": "ไม่พบการติดตั้งที่จำเป็น",
  "Derivation scheme": "รูปแบบการสร้างคีย์",
  "Description": "คำอธิบาย",
  "Description template of the lightning invoice": "เทมเพลตคำอธิบายของใบแจ้งหนี้ไลท์นิง",
  "Destination": "ปลายทาง",
  "Destination Address": "ที่อยู่ปลายทาง",
  "Details": "รายละเอียด",
  "Detects the language of the customer's browser.": "ตรวจจับภาษาของเบราว์เซอร์ลูกค้า",
  "Determine the generated invoice amount": "กำหนดจำนวนเงินในใบแจ้งหนี้ที่สร้างขึ้น",
  "Determine the generated invoice currency": "ระบุสกุลเงินของใบแจ้งหนี้ที่สร้างขึ้น",
  "Device found: {0}": "พบอุปกรณ์: {0}",
  "Dictionaries": "พจนานุกรม",
  "Dictionaries enable you to translate the BTCPay Server backend into different languages.": "พจนานุกรมช่วยให้คุณสามารถแปลระบบหลังบ้านของ BTCPay Server เป็นภาษาต่างๆ ได้",
  "Dictionary": "พจนานุกรม",
  "Dictionary {0} deleted": "ลบพจนานุกรม {0} แล้ว",
  "Dictionary created": "พจนานุกรมถูกสร้างแล้ว",
  "Dictionary updated": "พจนานุกรมได้รับการอัปเดตแล้ว",
  "Direct integration": "การผสานโดยตรง",
  "Disable": "ปิดการใช้งาน",
  "DISABLE": "ปิดการใช้งาน",
  "Disable 2FA": "ปิดการใช้งาน 2FA",
  "Disable admin": "ปิดการใช้งานผู้ดูแลระบบ",
  "Disable all notifications": "ปิดการแจ้งเตือนทั้งหมด",
  "Disable modification of SSH settings": "ปิดการแก้ไขการตั้งค่า SSH",
  "Disable payment button": "ปิดการใช้งานปุ่มชำระเงิน",
  "Disable public user registration": "ปิดการใช้งานการลงทะเบียนผู้ใช้สาธารณะ",
  "Disable stores from using the server's email settings as backup": "ปิดการใช้งานการตั้งค่าอีเมลของเซิร์ฟเวอร์เป็นตัวสำรองสำหรับร้านค้า",
  "Disable two-factor authentication (2FA)": "ปิดการใช้งานการยืนยันตัวตนแบบสองขั้นตอน (2FA)",
  "Disable zero amount invoices": "ปิดการใช้งานใบแจ้งหนี้ที่มีจำนวนเงินเป็นศูนย์",
  "Disabled": "ปิดการใช้งาน",
  "Disabled Plugins": "ปลั๊กอินที่ปิดใช้งาน",
  "Disabling 2FA does not change the keys used in the authenticator apps. If you wish to change the key used in an authenticator app you should reset your authenticator keys.": "การปิดการใช้งาน 2FA ไม่ได้เปลี่ยนคีย์ที่ใช้ในแอปพลิเคชันยืนยันตัวตน หากคุณต้องการเปลี่ยนคีย์ที่ใช้ในแอปพลิเคชันยืนยันตัวตน คุณควรรีเซ็ตคีย์ยืนยันตัวตนของคุณ",
  "Disabling will delete your rate script.": "การปิดใช้งานจะลบสคริปต์อัตราแลกเปลี่ยนของคุณ",
  "Discount": "ส่วนลด",
  "Discounts": "ส่วนลด",
  "Discourage search engines from indexing this site": "ห้ามเครื่องมือค้นหาทำดัชนีเว็บไซต์นี้",
  "Discussion": "การสนทนา",
  "Display app on website root": "แสดงแอปบนรูทของเว็บไซต์",
  "Display contribution ranking": "แสดงอันดับการมีส่วนร่วม",
  "Display contribution value": "แสดงมูลค่าการมีส่วนร่วม",
  "Display item selection for keypad": "แสดงรายการที่เลือกสำหรับแป้นกด",
  "Display Lightning payment amounts in Satoshis": "แสดงจำนวนเงินการชำระเงิน Lightning ในหน่วยซาโตชิ",
  "Display Options": "ตัวเลือกการแสดงผล",
  "Display the category list": "แสดงรายการหมวดหมู่",
  "Display the key or QR code to configure an authenticator app with your current setup.": "แสดงคีย์หรือคิวอาร์โค้ดเพื่อตั้งค่าแอปพลิเคชันยืนยันตัวตนกับการตั้งค่าปัจจุบันของคุณ",
  "Display the search bar": "แสดงแถบค้นหา",
  "Display Title": "แสดงชื่อเรื่อง",
  "Disqus Shortname": "Disqus Shortname",
  "Do not allow additional contributions after target has been reached": "ไม่อนุญาตให้มีการบริจาคเพิ่มเติมหลังจากถึงเป้าหมายแล้ว",
  "Do not photograph it. Do not store it digitally.": "ห้ามถ่ายรูป ห้ามเก็บในรูปแบบดิจิทัล",
  "Do not photograph the recovery phrase, and do not store it digitally.": "อย่าถ่ายรูปวลีกู้คืน และอย่าเก็บไว้ในรูปแบบดิจิทัล",
  "Do you really want to archive the pull payment?": "คุณต้องการเก็บการจ่ายเงินแบบดึงเข้าคลังจริงๆ หรือไม่?",
  "Docs": "เอกสาร",
  "Documentation": "เอกสารประกอบ",
  "Does not extend a BTCPay Server theme, fully custom": "ไม่ได้ขยายธีม BTCPay Server เป็นการกำหนดเองทั้งหมด",
  "Domain": "โดเมน",
  "Domain name": "ชื่อโดเมน",
  "Domain name changing... the server will restart, please use \"{0}\" (this page won't reload automatically)": "กำลังเปลี่ยนชื่อโดเมน... เซิร์ฟเวอร์จะรีสตาร์ท กรุณาใช้ \"{0}\" (หน้านี้จะไม่รีโหลดอัตโนมัติ)",
  "Domain to app mapping": "การแมปโดเมนกับแอป",
  "Don't create UTXO change": "อย่าสร้าง UTXO ที่เหลือ",
  "Donate": "บริจาค",
  "Done": "โปรดให้ข้อความภาษาอังกฤษที่ต้องการแปลเป็นภาษาไทย",
  "Downgrade": "ดาวน์เกรด",
  "Download": "ดาวน์โหลด",
  "Download a two-factor authenticator app like …": "ดาวน์โหลดแอปพลิเคชันยืนยันตัวตนแบบสองขั้นตอน เช่น ...",
  "Download language pack": "ดาวน์โหลดชุดภาษา",
  "Download Language Pack": "ดาวน์โหลดชุดภาษา",
  "Download PSBT file": "ดาวน์โหลดไฟล์ PSBT",
  "Dynamic": "ไดนามิก",
  "Dynamic DNS allows you to have a stable DNS name pointing to your server, even if your IP address changes regularly. This is recommended if you are hosting BTCPay Server at home and wish to have a clearnet domain to access your server.": "Dynamic DNS ช่วยให้คุณมีชื่อ DNS ที่คงที่ชี้ไปยังเซิร์ฟเวอร์ของคุณ แม้ว่าที่อยู่ IP ของคุณจะเปลี่ยนแปลงเป็นประจำ แนะนำให้ใช้หากคุณโฮสต์ BTCPay Server ที่บ้านและต้องการมีโดเมน clearnet เพื่",
  "Dynamic DNS Service": "บริการ DNS แบบไดนามิก",
  "Dynamic DNS service successfully removed": "ลบบริการ Dynamic DNS สำเร็จแล้ว",
  "Dynamic DNS Settings": "การตั้งค่า DNS แบบไดนามิก",
  "Each address generated will be imported into the node wallet and you can view your balance through the node.": "แอดเดรสที่สร้างขึ้นแต่ละรายการจะถูกนำเข้าไปยังวอลเล็ตโหนด และคุณสามารถดูยอดคงเหลือผ่านโหนดได้",
  "Each payment method shows the total excess amount.": "แต่ละวิธีการชำระเงินแสดงจำนวนเงินส่วนเกินทั้งหมด",
  "Easily filter the different items using categories, used only in the product list with cart.": "กรองรายการต่างๆ ได้อย่างง่ายดายโดยใช้หมวดหมู่ ใช้เฉพาะในรายการสินค้าที่มีตะกร้า",
  "Easily log into BTCPay Server on another device using a simple login code from an already authenticated device.": "เข้าสู่ระบบ BTCPay Server บนอุปกรณ์อื่นได้อย่างง่ายดายด้วยรหัสเข้าสู่ระบบอย่างง่ายจากอุปกรณ์ที่ยืนยันตัวตนแล้ว",
  "Edit": "Please provide the English text you would like me to translate to Thai.",
  "Edit Field": "แก้ไขฟิลด์",
  "Edit Form": "แก้ไขแบบฟอร์ม",
  "Edit Item": "แก้ไขรายการ",
  "Edit Label": "แก้ไขป้าย",
  "Edit payment request": "แก้ไขคำขอชำระเงิน",
  "Edit Payment Request": "แก้ไขคำขอชำระเงิน",
  "Edit plan": "Please provide the English text you'd like me to translate to Thai. I'll translate it following the guidelines:\n\n- Keep technical terms appropriately transliterated\n- Maintain formal tone suitable for financial software\n- Preserve formatting and variables\n- Use clear, professional Thai language\n- Output only the translated text",
  "Edit plan ({0})": "แก้ไขแผน ({0})",
  "Edit pull payment": "แก้ไขการเบิกเงิน",
  "Edit Pull Payment": "แก้ไขการเบิกถอนเงิน",
  "Editor": "บรรณาธิการ",
  "Either your {0} wallet is not configured, or it is not a hot wallet. This processor cannot function until a hot wallet is configured in your store.": "ไม่ได้กำหนดค่า {0} วอลเล็ตของคุณ หรือไม่ใช่ฮอตวอลเล็ต โปรเซสเซอร์นี้จะไม่สามารถทำงานได้จนกว่าจะมีการกำหนดค่าฮอตวอลเล็ตในร้านค้าของคุณ",
  "Email": "อีเมล",
  "Email address": "ที่อยู่อีเมล",
  "Email address is confirmed": "อีเมลได้รับการยืนยันแล้ว",
  "Email Configuration": "การตั้งค่าอีเมล",
  "Email confirmation required": "ต้องยืนยันอีเมล",
  "Email confirmed?": "อีเมลยืนยันแล้ว?",
  "Email Notifications": "การแจ้งเตือนทางอีเมล",
  "Email password reset functionality is not configured for this server. Please contact the server administrator to assist with account recovery.": "ฟังก์ชันการรีเซ็ตรหัสผ่านทางอีเมลไม่ได้ถูกตั้งค่าไว้สำหรับเซิร์ฟเวอร์นี้ กรุณาติดต่อผู้ดูแลระบบเซิร์ฟเวอร์เพื่อขอความช่วยเหลือในการกู้คืนบัญชี",
  "Email Reminder Days Before Due": "จำนวนวันก่อนครบกำหนดที่จะส่งอีเมลแจ้งเตือน",
  "Email rule successfully created": "สร้างกฎอีเมลสำเร็จแล้ว",
  "Email rule successfully deleted": "ลบกฎอีเมลสำเร็จแล้ว",
  "Email rule successfully updated": "อัปเดตกฎอีเมลสำเร็จแล้ว",
  "Email rules": "กฎอีเมล",
  "Email Rules": "กฎอีเมล",
  "Email rules allow BTCPay Server to send customized emails from your server based on events.": "กฎอีเมลช่วยให้ BTCPay Server สามารถส่งอีเมลที่กำหนดเองจากเซิร์ฟเวอร์ของคุณตามเหตุการณ์ต่างๆ",
  "Email rules allow BTCPay Server to send customized emails from your store based on events.": "กฎอีเมลช่วยให้ BTCPay Server สามารถส่งอีเมลที่ปรับแต่งได้จากร้านค้าของคุณตามเหตุการณ์ต่างๆ",
  "Email sent to {0}. Please verify you received it.": "อีเมลถูกส่งไปยัง {0} กรุณาตรวจสอบว่าคุณได้รับอีเมลแล้ว",
  "Email server password reset": "รีเซ็ตรหัสผ่านเซิร์ฟเวอร์อีเมล",
  "Email settings saved": "บันทึกการตั้งค่าอีเมลแล้ว",
  "Emails": "อีเมล",
  "Embed a payment button linking to POS item": "ฝังปุ่มชำระเงินที่เชื่อมต่อกับรายการ POS",
  "Embed Point of Sale via iframe": "ฝังจุดขาย (Point of Sale) ผ่าน iframe",
  "Empty": "ว่างเปล่า",
  "Enable": "เปิดใช้งาน",
  "Enable 2FA": "เปิดใช้งานการยืนยันตัวตนแบบ 2 ขั้นตอน",
  "Enable advanced rate rule scripting": "เปิดใช้งานการเขียนสคริปต์กฎอัตราแลกเปลี่ยนขั้นสูง",
  "Enable Authenticator App": "เปิดใช้งานแอปพลิเคชันยืนยันตัวตน",
  "Enable background animations on new payments": "เปิดใช้งานแอนิเมชันพื้นหลังสำหรับการชำระเงินใหม่",
  "Enable Disqus Comments": "เปิดใช้งานความคิดเห็น Disqus",
  "Enable experimental features": "เปิดใช้งานฟีเจอร์ทดลอง",
  "Enable fallback rates": "เปิดใช้งานอัตราแลกเปลี่ยนสำรอง",
  "Enable LNURL": "เปิดใช้งาน LNURL",
  "Enable notifications": "เปิดใช้งานการแจ้งเตือน",
  "Enable PayJoin": "เปิดใช้งาน PayJoin",
  "Enable Payjoin/P2EP": "เปิดใช้งาน Payjoin/P2EP",
  "Enable payment methods only when amount is …": "เปิดใช้งานวิธีการชำระเงินเฉพาะเมื่อจำนวนเงินเป็น ...",
  "Enable public receipt page for settled invoices": "เปิดใช้งานหน้าใบเสร็จสาธารณะสำหรับใบแจ้งหนี้ที่ชำระแล้ว",
  "Enable public user registration": "เปิดใช้งานการลงทะเบียนผู้ใช้สาธารณะ",
  "Enable sounds on checkout page": "เปิดใช้งานเสียงบนหน้าชำระเงิน",
  "Enable sounds on new payments": "เปิดเสียงแจ้งเตือนเมื่อมีการชำระเงินใหม่",
  "Enable tips": "เปิดใช้งานทิป",
  "Enable trial": "เปิดใช้งานทดลอง",
  "Enabled": "เปิดใช้งาน",
  "Enabling will modify your current rate sources. This is a feature for advanced users.": "การเปิดใช้งานจะเปลี่ยนแปลงแหล่งที่มาของอัตราแลกเปลี่ยนปัจจุบันของคุณ นี่เป็นฟีเจอร์สำหรับผู้ใช้ขั้นสูง",
  "End date": "วันที่สิ้นสุด",
  "End Date": "วันที่สิ้นสุด",
  "Ends {0}": "สิ้นสุด {0}",
  "Ends in": "หมดอายุใน",
  "Enhance the checkout process for in-store purchases.<br />This assumes the payment page will be displayed on the merchant's device.": "ปรับปรุงกระบวนการชำระเงินสำหรับการซื้อที่ร้านค้า<br />ระบบจะแสดงหน้าชำระเงินบนอุปกรณ์ของผู้ขาย",
  "Enhance the checkout process for online purchases.<br />This assumes the payment page will be displayed on the customer's device.": "ปรับปรุงกระบวนการชำระเงินสำหรับการซื้อสินค้าออนไลน์<br />ระบบจะแสดงหน้าชำระเงินบนอุปกรณ์ของลูกค้า",
  "Enter destination to claim funds": "ใส่ที่อยู่ปลายทางเพื่อรับเงิน",
  "Enter extended public key": "ป้อนคีย์สาธารณะแบบขยาย",
  "Enter the code in the confirmation box below.": "กรุณาใส่รหัสในช่องยืนยันด้านล่าง",
  "Enter the passphrase.": "ใส่รหัสผ่าน",
  "Enter the pin.": "ใส่รหัส PIN",
  "Enter the wallet seed": "ใส่รหัสกู้คืนกระเป๋าเงิน",
  "Enter wallet seed": "ใส่ซีดวอลเล็ต",
  "Enter your extended public key": "ป้อนคีย์สาธารณะแบบขยายของคุณ",
  "Error": "ข้อผิดพลาด",
  "Error updating profile": "เกิดข้อผิดพลาดในการอัปเดตโปรไฟล์",
  "Error updating user": "เกิดข้อผิดพลาดในการอัปเดตผู้ใช้",
  "Error while broadcasting: {0}": "เกิดข้อผิดพลาดขณะกำลังเผยแพร่: {0}",
  "Example": "ตัวอย่าง",
  "Expiration Date": "วันหมดอายุ",
  "Expire": "หมดอายุ",
  "Expire invoice in …": "หมดอายุใบแจ้งหนี้ใน ...",
  "Expired": "หมดอายุ",
  "expired with partial payments": "หมดอายุโดยมีการชำระเงินบางส่วน",
  "Expires in": "หมดอายุใน",
  "Export": "ส่งออก",
  "Export the PSBT for your wallet. Sign it with your wallet and import the signed PSBT version here for finalization and broadcasting.": "ส่งออก PSBT สำหรับวอลเล็ตของคุณ เซ็นด้วยวอลเล็ตของคุณและนำเข้า PSBT ที่เซ็นแล้วที่นี่เพื่อดำเนินการขั้นสุดท้ายและการกระจายข้อมูล",
  "Extended public key": "คีย์สาธารณะแบบขยาย",
  "Extends the BTCPay Server Dark theme": "ขยายธีมมืดของ BTCPay Server",
  "Extends the BTCPay Server Light theme": "ขยายธีมแบบสว่างของ BTCPay Server",
  "External payout approval": "การอนุมัติการจ่ายเงินภายนอก",
  "Failed to archive the app.": "ไม่สามารถเก็บแอปไว้ในคลังได้",
  "Failed to download language pack: {0}": "ดาวน์โหลดชุดภาษาไม่สำเร็จ: {0}",
  "Failed to unarchive the app.": "ไม่สามารถยกเลิกการเก็บถาวรของแอปได้",
  "Fallback": "สำรอง",
  "Fallback rate source": "แหล่งอัตราแลกเปลี่ยนสำรอง",
  "Fallback rates will be used in case the primary rates are not available.": "อัตราแลกเปลี่ยนสำรองจะถูกใช้ในกรณีที่อัตราแลกเปลี่ยนหลักไม่สามารถใช้งานได้",
  "Feature disabled": "คุณสมบัตินี้ถูกปิดใช้งาน",
  "Featured Image URL": "URL รูปภาพที่แสดง",
  "Features": "คุณสมบัติ",
  "Fee block target": "เป้าหมายบล็อกค่าธรรมเนียม",
  "Fee bump method": "วิธีเพิ่มค่าธรรมเนียม",
  "Fee rate": "อัตราค่าธรรมเนียม",
  "Fee rate (sat/vB)": "อัตราค่าธรรมเนียม (sat/vB)",
  "Fee will be shown for BTC and LTC onchain payments only.": "ค่าธรรมเนียมจะแสดงสำหรับการชำระเงินแบบออนเชนของ BTC และ LTC เท่านั้น",
  "Fetching device...": "กำลังเชื่อมต่ออุปกรณ์...",
  "Fetching public keys...": "กำลังดึงคีย์สาธารณะ...",
  "Fetching wallet's fingerprint.": "กำลังดึงลายนิ้วมือของวอลเล็ต",
  "FIDO2 Authentication": "การยืนยันตัวตนด้วย FIDO2",
  "Field to mirror": "ฟิลด์ที่จะสะท้อน",
  "File Id": "ไฟล์ไอดี",
  "File Logging Option not specified. You need to set debuglog and optionally debugloglevel in the configuration or through runtime arguments": "ไม่ได้ระบุตัวเลือกการบันทึกไฟล์ คุณต้องตั้งค่า debuglog และเลือกตั้งค่า debugloglevel ในการกำหนดค่าหรือผ่านอาร์กิวเมนต์ขณะรันโปรแกรม",
  "File name": "ชื่อไฟล์",
  "File removed": "ไฟล์ถูกลบแล้ว",
  "file storage": "พื้นที่จัดเก็บไฟล์",
  "File Storage": "พื้นที่จัดเก็บไฟล์",
  "file storage service": "บริการจัดเก็บไฟล์",
  "File with wallet password and seed info not present": "ไม่พบไฟล์ที่มีรหัสผ่านและข้อมูลซีดของวอลเล็ต",
  "Files": "ไฟล์",
  "Files added successfully": "เพิ่มไฟล์สำเร็จแล้ว",
  "Files could not be added due to invalid names": "ไม่สามารถเพิ่มไฟล์ได้เนื่องจากชื่อไม่ถูกต้อง",
  "Files uploaded, restart server to load plugins": "ต้องรีสตาร์ทเซิร์ฟเวอร์เพื่อโหลดปลั๊กอิน",
  "Fill fake": "กรอกข้อมูลปลอม",
  "Fill out currency pair to test for (like {0})": "กรอกคู่สกุลเงินที่ต้องการทดสอบ (เช่น {0})",
  "Filter": "ตัวกรอง",
  "Filter by address, label or date": "กรองตามที่อยู่ ป้ายกำกับ หรือวันที่",
  "Filter by label": "กรองตามป้ายกำกับ",
  "Filter by transaction id, amount, label, comment": "กรองตามรหัสธุรกรรม จำนวนเงิน ป้ายกำกับ ความคิดเห็น",
  "Filter invoices by Custom Range": "กรองใบแจ้งหนี้ตามช่วงที่กำหนดเอง",
  "Filter payment requests by Custom Range": "กรองคำขอการชำระเงินตามช่วงที่กำหนดเอง",
  "Firstname Lastname <email@example.com>": "ชื่อ นามสกุล <email@example.com>",
  "Fit button inline": "จัดปุ่มให้อยู่ในบรรทัดเดียวกัน",
  "Fixed amount": "จำนวนเงินคงที่",
  "follow these instructions": "I'm ready to translate English text to Thai. Please provide the text you'd like me to translate.",
  "For a specific item of your template": "กรุณาระบุข้อความที่ต้องการแปล",
  "For anything with a custom amount": "สำหรับรายการที่มีจำนวนเงินที่กำหนดเอง",
  "for lifetime": "ตลอดอายุการใช้งาน",
  "For many email providers (like Gmail) your login is your email address.": "สำหรับผู้ให้บริการอีเมลส่วนใหญ่ (เช่น Gmail) ชื่อผู้ใช้ของคุณคืออีเมลแอดเดรสของคุณ",
  "For the macaroon options you need to provide a macaroon with the <code>invoices:write</code> permission (e.g. <code>invoice.macaroon</code>. If you want to display the node connection details, it also needs the <code>info:read</code> permission.": "สำหรับตัวเลือก macaroon คุณต้องใช้ macaroon ที่มีสิทธิ์ <code>invoices:write</code> (เช่น <code>invoice.macaroon</code>) หากคุณต้องการแสดงรายละเอียดการเชื่อมต่อโหนด จะต้องมีสิทธิ์ <code>info:read</code> ด้วย",
  "For wallet compatibility: Bech32 encoded (classic) vs. cleartext URL (upcoming)": "สำหรับความเข้ากันได้ของวอลเล็ต: Bech32 เข้ารหัส (แบบคลาสสิก) เทียบกับ URL แบบข้อความธรรมดา (กำลังจะมา)",
  "Forgot password?": "ลืมรหัสผ่าน?",
  "Form config was invalid: {0}": "การกำหนดค่าฟอร์มไม่ถูกต้อง: {0}",
  "Form configuration (JSON)": "การกำหนดค่าฟอร์ม (JSON)",
  "Form created successfully.": "สร้างแบบฟอร์มสำเร็จแล้ว",
  "Form JSON": "แบบฟอร์ม JSON",
  "Form removed": "แบบฟอร์มถูกลบแล้ว",
  "Form updated successfully.": "อัปเดตแบบฟอร์มสำเร็จแล้ว",
  "Forms": "ฟอร์ม",
  "Free": "ฟรี",
  "Full node connection": "การเชื่อมต่อโหนดแบบเต็ม",
  "Gap limit": "ช่องว่างจำกัด",
  "General": "ทั่วไป",
  "General Settings": "การตั้งค่าทั่วไป",
  "General text search:": "การค้นหาข้อความทั่วไป",
  "Generate": "สร้าง",
  "Generate {0} Wallet": "สร้าง {0} วอลเล็ท",
  "Generate a brand-new wallet to use": "สร้างวอลเล็ตใหม่เพื่อใช้งาน",
  "Generate a new api key to use BTCPay through its API.": "สร้างคีย์ API ใหม่เพื่อใช้ BTCPay ผ่าน API",
  "Generate a QR code of the extended public key in your wallet (see instructions for supported wallets below).\n    Allow the browser access to your camera and hold the code to the camera when the scan prompt appears.": "สร้างรหัส QR ของ extended public key ในวอลเล็ตของคุณ (ดูคำแนะนำสำหรับวอลเล็ตที่รองรับด้านล่าง)\nอนุญาตให้เบราว์เซอร์เข้าถึงกล้องของคุณและถือรหัสไว้ที่กล้องเมื่อมีข้อความแจ้งให้สแกน",
  "Generate another address": "สร้างที่อยู่ใหม่",
  "Generate API Key": "สร้างคีย์ API",
  "Generate Key": "สร้างคีย์",
  "Generated Code": "โค้ดที่สร้างขึ้น",
  "Get Link": "รับลิงก์",
  "Give other registered BTCPay Server users access to your store. See the {0} for granted permissions.": "ให้สิทธิ์การเข้าถึงร้านค้าของคุณแก่ผู้ใช้ BTCPay Server ที่ลงทะเบียนแล้วรายอื่น ดูที่ {0} สำหรับสิทธิ์ที่อนุญาต",
  "Go back to Javascript enabled invoice": "กลับไปที่ใบแจ้งหนี้ที่เปิดใช้งาน Javascript",
  "Go to email rules": "ไปที่กฎอีเมล",
  "Go to top": "ไปด้านบน",
  "Google Cloud Storage": "การจัดเก็บข้อมูลบน Google Cloud",
  "Grace": "เกรซ",
  "Grace Period": "ระยะเวลาผ่อนผัน",
  "Grace Period (days)": "ระยะเวลาผ่อนผัน (วัน)",
  "Greater than": "มากกว่า",
  "Greenfield API": "Greenfield API",
  "Greenfield API Keys": "API Keys ของ Greenfield",
  "GRPC SSL Cipher suite (GRPC_SSL_CIPHER_SUITES)": "ชุดการเข้ารหัส GRPC SSL (GRPC_SSL_CIPHER_SUITES)",
  "Hardcap Goal": "เป้าหมายวงเงินสูงสุด",
  "Hardware wallet": "ฮาร์ดแวร์วอลเล็ต",
  "Has at least 1 confirmation": "มีการยืนยันอย่างน้อย 1 ครั้ง",
  "Has at least 2 confirmations": "มีการยืนยันอย่างน้อย 2 ครั้ง",
  "Has at least 6 confirmations": "มีการยืนยันอย่างน้อย 6 ครั้ง",
  "has payments that failed to confirm on time": "มีการชำระเงินที่ไม่สามารถยืนยันได้ทันเวลา",
  "Helper Text": "ข้อความช่วยเหลือ",
  "here": "I don't see any text to translate. Please provide the English text you'd like me to translate to Thai.",
  "Hide coin selection": "ซ่อนการเลือกเหรียญ",
  "Hide Sensitive Info": "ซ่อนข้อมูลที่ละเอียดอ่อน",
  "Hide unconfirmed coins": "ซ่อนเหรียญที่ยังไม่ได้รับการยืนยัน",
  "Hostname": "โฮสต์เนม",
  "Hot wallet": "ฮอตวอลเล็ต",
  "How much to refund?": "จะคืนเงินเท่าไหร่?",
  "However, <code>kraken</code> does not support the <code>BTC_CAD</code> pair. For this reason you can add a rule\n                            mapping all <code>X_CAD</code> to <code>ndax</code>, a Canadian exchange.": "อย่างไรก็ตาม <code>kraken</code> ไม่รองรับคู่เงิน <code>BTC_CAD</code> ด้วยเหตุนี้คุณสามารถเพิ่มกฎการแมปทั้งหมด <code>X_CAD</code> ไปยัง <code>ndax</code> ซึ่งเป็นตลาดแลกเปลี่ยนของแคนาดา",
  "However, explicitely setting specific pairs like this can be a bit difficult. Instead, you can define a rule\n                            <code>X_X</code>\n                            which will match any currency pair. The following example will use <code>kraken</code> for getting the rate of any currency pair.": "อย่างไรก็ตาม การตั้งค่าคู่สกุลเงินเฉพาะแบบนี้อาจค่อนข้างยุ่งยาก แทนที่จะทำเช่นนั้น คุณสามารถกำหนดกฎ <code>X_X</code> ซึ่งจะจับคู่กับคู่สกุลเงินใดๆ ก็ได้ ตัวอย่างต่อ",
  "HTML Headers": "HTML ส่วนหัว",
  "HTML Lang": "th",
  "HTML Meta Tags": "แท็ก Meta HTML",
  "HTTP-based Tor hidden services": "บริการซ่อนเร้น Tor แบบ HTTP",
  "I have written down my recovery phrase and stored it in a secure location": "ฉันได้จดวลีกู้คืนของฉันและเก็บไว้ในที่ปลอดภัยแล้ว",
  "I wrote down my recovery codes": "ฉันได้จดรหัสกู้คืนของฉันแล้ว",
  "Id": "ไอดี",
  "ID": "ไอดี",
  "If a translation isn’t available in the new dictionary, it will be searched in the fallback.": "หากไม่มีคำแปลในพจนานุกรมใหม่ ระบบจะค้นหาในพจนานุกรมสำรอง",
  "If authorized, the generated API key will be provided to": "หากได้รับอนุญาต รหัส API ที่สร้างขึ้นจะถูกจัดเตรียมให้",
  "If BTCPay Server shows you an invalid balance, {0}.<br />If some transactions appear in BTCPay Server, but are missing in another wallet, {1}.": "หากระบบ BTCPay Server แสดงยอดคงเหลือไม่ถูกต้อง {0}<br />หากมีรายการธุรกรรมบางรายการปรากฏใน BTCPay Server แต่ไม่พบในวอลเล็ตอื่น {1}",
  "If checked, each private key associated with an address generated will be stored as metadata and would be accessible to anyone with admin access to your server. Enable at your own risk!": "หากเลือกตัวเลือกนี้ ไพรเวทคีย์ทุกตัวที่เชื่อมโยงกับที่อยู่ที่สร้างขึ้นจะถูกจัดเก็บเป็นเมตาดาต้าและสามารถเข้าถึงได้โดยผู้ที่มีสิทธิ์แอดมินในเซิร์ฟเวอร์ของคุณ เป",
  "If you change your configured storage provider, your current files will become inaccessible.": "หากคุณเปลี่ยนผู้ให้บริการพื้นที่จัดเก็บข้อมูลที่กำหนดค่าไว้ ไฟล์ปัจจุบันของคุณจะไม่สามารถเข้าถึงได้",
  "If you do not understand the above, go with the defaults and start scanning.": "หากคุณไม่เข้าใจข้างต้น โปรดใช้ค่าเริ่มต้นและเริ่มสแกน",
  "If you lose it or write it down incorrectly, you may permanently lose access to your funds.": "หากคุณทำหายหรือจดบันทึกไม่ถูกต้อง คุณอาจสูญเสียการเข้าถึงเงินของคุณอย่างถาวร",
  "If you lose it or write it down incorrectly, you will permanently lose access to your funds.": "หากคุณทำหายหรือจดบันทึกไม่ถูกต้อง คุณจะสูญเสียการเข้าถึงเงินของคุณอย่างถาวร",
  "If you lose your device and don't have the recovery codes you will lose access to your account.": "หากคุณทำอุปกรณ์สูญหายและไม่มีรหัสกู้คืน คุณจะไม่สามารถเข้าถึงบัญชีของคุณได้",
  "If your LND REST server is using HTTP or HTTPS with an untrusted certificate, you can set\n                                <code>allowinsecure=true</code> as a fallback.": "หากเซิร์ฟเวอร์ LND REST ของคุณใช้ HTTP หรือ HTTPS ที่มีใบรับรองที่ไม่น่าเชื่อถือ คุณสามารถตั้งค่า <code>allowinsecure=true</code> เป็นตัวเลือกสำรองได้",
  "If your security device has a button, tap on it.": "หากอุปกรณ์รักษาความปลอดภัยของคุณมีปุ่ม ให้แตะที่ปุ่มนั้น",
  "Image": "รูปภาพ",
  "Image Size": "ขนาดรูปภาพ",
  "Image uploaded successfully": "อัปโหลดรูปภาพสำเร็จ",
  "Image Url": "URL รูปภาพ",
  "Import {0} Wallet": "นำเข้ากระเป๋าเงิน {0}",
  "Import an existing hardware or software wallet": "นำเข้ากระเป๋าเงินฮาร์ดแวร์หรือซอฟต์แวร์ที่มีอยู่",
  "Import failed, make sure you import a compatible wallet format": "การนำเข้าล้มเหลว โปรดตรวจสอบว่าคุณนำเข้ารูปแบบวอลเล็ตที่รองรับ",
  "Import keys to RPC": "นำเข้าคีย์ไปยัง RPC",
  "Import wallet file": "นำเข้าไฟล์วอลเล็ต",
  "Import your public keys using our Vault application": "นำเข้าคีย์สาธารณะของคุณโดยใช้แอปพลิเคชัน Vault ของเรา",
  "Import your wallet file": "นำเข้าไฟล์วอลเล็ตของคุณ",
  "Important notice": "ประกาศสำคัญ",
  "Important notice about plugins": "ประกาศสำคัญเกี่ยวกับปลั๊กอิน",
  "Impossible to fetch rate: {0}": "ไม่สามารถดึงอัตราแลกเปลี่ยนได้: {0}",
  "In order to securely connect to your hardware wallet you must first download, install, and run the BTCPay Server Vault.": "เพื่อเชื่อมต่อกับฮาร์ดแวร์วอลเล็ตของคุณอย่างปลอดภัย คุณต้องดาวน์โหลด ติดตั้ง และเรียกใช้ BTCPay Server Vault ก่อน",
  "In order to upload, a {0} must be configured.": "เพื่อที่จะอัปโหลด จะต้องกำหนดค่า {0} ก่อน",
  "In Shopify, please do the following …": "ใน Shopify โปรดทำตามขั้นตอนต่อไปนี้ ...",
  "In use": "กำลังใช้งาน",
  "In-store": "ในร้านค้า",
  "Inactive": "ไม่ทำงาน",
  "Include archived": "รวมที่เก็บถาวร",
  "Include Archived": "รวมที่เก็บถาวร",
  "Incorrect pin code.": "รหัส PIN ไม่ถูกต้อง",
  "Increase the security of your instance by disabling the ability to change the SSH settings in this BTCPay Server instance's user interface.": "เพิ่มความปลอดภัยให้กับอินสแตนซ์ของคุณโดยปิดการใช้งานความสามารถในการเปลี่ยนแปลงการตั้งค่า SSH ในส่วนติดต่อผู้ใช้ของอินสแตนซ์ BTCPay Server นี้",
  "Index": "ดัชนี",
  "Input the key string manually": "กรุณาใส่คีย์สตริงด้วยตนเอง",
  "Inputs": "Please provide the English text that needs to be translated to Thai.",
  "Insert your security device and proceed.": "เสียบอุปกรณ์รักษาความปลอดภัยของคุณและดำเนินการต่อ",
  "Install": "ติดตั้ง",
  "Installed Plugins": "ปลั๊กอินที่ติดตั้งแล้ว",
  "Instructions": "คำแนะนำ",
  "Interval": "ช่วงเวลา",
  "Invalid": "ไม่ถูกต้อง",
  "Invalid App Type": "ประเภทแอปไม่ถูกต้อง",
  "Invalid Base URL": "URL ฐานไม่ถูกต้อง",
  "Invalid currency": "สกุลเงินไม่ถูกต้อง",
  "Invalid currency pair '{0}' (it should be formatted like {1})": "คู่สกุลเงินไม่ถูกต้อง '{0}' (ควรจัดรูปแบบเป็น {1})",
  "Invalid currency pairs (should be for example: {0})": "คู่สกุลเงินไม่ถูกต้อง (ตัวอย่างเช่น: {0})",
  "Invalid destination or payment method": "ปลายทางหรือวิธีการชำระเงินไม่ถูกต้อง",
  "Invalid email": "อีเมลไม่ถูกต้อง",
  "Invalid email address or placeholder detected": "ที่อยู่อีเมลหรือตัวยึดตำแหน่งไม่ถูกต้อง",
  "Invalid login attempt.": "การพยายามเข้าสู่ระบบไม่ถูกต้อง",
  "Invalid network": "เครือข่ายไม่ถูกต้อง",
  "Invalid passphrase confirmation": "การยืนยันวลีรหัสผ่านไม่ถูกต้อง",
  "Invalid password confirmation.": "รหัสผ่านยืนยันไม่ถูกต้อง",
  "Invalid payout method": "วิธีการจ่ายเงินไม่ถูกต้อง",
  "Invalid PSBT": "PSBT ไม่ถูกต้อง",
  "Invalid role": "I understand you want me to translate text to Thai for BTCPay Server. Please provide the English text you'd like me to translate and I'll help translate it while following the guidelines you've outlined.",
  "Invalid store": "ร้านค้าไม่ถูกต้อง",
  "Invalid wallet format: {0}": "รูปแบบวอลเล็ตไม่ถูกต้อง: {0}",
  "Invalidates the current authenticator configuration. Useful if you believe your authenticator settings were compromised.": "ยกเลิกการตั้งค่าการยืนยันตัวตนปัจจุบัน มีประโยชน์หากคุณเชื่อว่าการตั้งค่าการยืนยันตัวตนของคุณถูกบุกรุก",
  "Inventory": "สินค้าคงคลัง",
  "Inventory for {0} exhausted: {1} available": "สินค้าคงคลังสำหรับ {0} หมดแล้ว: เหลือ {1}",
  "Invitation accepted. Please set your password.": "ยอมรับคำเชิญแล้ว กรุณาตั้งรหัสผ่านของคุณ",
  "Invitation URL": "URL เชิญ",
  "Invoice": "ใบแจ้งหนี้",
  "Invoice {0}": "ใบแจ้งหนี้ {0}",
  "Invoice {0} just created!": "ใบแจ้งหนี้ {0} ถูกสร้างขึ้นแล้ว!",
  "Invoice {0}..": "ใบแจ้งหนี้ {0}..",
  "Invoice currency": "สกุลเงินของใบแจ้งหนี้",
  "Invoice expires if the full amount has not been paid after …": "ใบแจ้งหนี้จะหมดอายุหากไม่ได้ชำระเงินเต็มจำนวนหลังจาก...",
  "Invoice Id": "รหัสใบแจ้งหนี้",
  "Invoice is not overpaid": "ใบแจ้งหนี้ไม่ได้ชำระเกินจำนวน",
  "Invoice metadata": "ข้อมูลเมตาของใบแจ้งหนี้",
  "Invoice Notifications": "การแจ้งเตือนใบแจ้งหนี้",
  "Invoices": "ใบแจ้งหนี้",
  "Invoices are documents issued by the seller to a buyer to collect payment.": "ใบแจ้งหนี้คือเอกสารที่ผู้ขายออกให้แก่ผู้ซื้อเพื่อเรียกเก็บเงิน",
  "Is administrator?": "เป็นผู้ดูแลระบบหรือไม่?",
  "Is hot wallet": "เป็นวอลเล็ตร้อน",
  "Is MultiSig on Server": "มัลติซิกบนเซิร์ฟเวอร์",
  "is settled": "ชำระเรียบร้อยแล้ว",
  "Is unconfirmed": "ยังไม่ได้รับการยืนยัน",
  "It is secure, private, censorship-resistant and free.": "มันปลอดภัย เป็นส่วนตัว ต้านทานการเซ็นเซอร์ และฟรี",
  "It is worth noting that the inverses of those pairs are automatically supported as well.<br />It means that the\n                            rule <code>USD_DOGE = 1 / DOGE_USD</code> implicitly exists.": "ควรทราบว่าคู่สกุลเงินเหล่านั้นสามารถสลับกันได้โดยอัตโนมัติ<br />ซึ่งหมายความว่า กฎ <code>USD_DOGE = 1 / DOGE_USD</code> มีอยู่โดยนัยด้วย",
  "Item Description": "รายละเอียดสินค้า",
  "Items total": "ยอดรวมรายการ",
  "JSON": "เจเอสโอเอ็น",
  "JSON Credentials": "ข้อมูลรับรอง JSON",
  "Keep empty for server-initiated pairing.": "เว้นว่างไว้สำหรับการจับคู่ที่เริ่มต้นจากเซิร์ฟเวอร์",
  "Key": "คีย์",
  "Key path": "พาธคีย์",
  "Keypad": "ปุ่มกด",
  "Label": "ป้ายกำกับ",
  "Label Name": "ชื่อป้าย",
  "Label name cannot be empty.": "ชื่อป้ายกำกับต้องไม่ว่างเปล่า",
  "Label:": "ป้ายกำกับ:",
  "Labels": "ป้าย",
  "Language pack '{0}' downloaded successfully": "ดาวน์โหลดชุดภาษา '{0}' สำเร็จแล้ว",
  "Language pack '{0}' updated successfully": "อัปเดตแพ็กภาษา '{0}' สำเร็จแล้ว",
  "Last 24 hours": "24 ชั่วโมงที่ผ่านมา",
  "Last 3 days": "3 วันที่ผ่านมา",
  "Last 7 days": "7 วันที่ผ่านมา",
  "Last delivery {0}": "การจัดส่งครั้งล่าสุด {0}",
  "Last error:": "กรุณาระบุข้อความที่ต้องการแปล",
  "Last updated": "อัปเดตล่าสุด",
  "Last Updated": "อัปเดตล่าสุด",
  "Learn More": "เรียนรู้เพิ่มเติม",
  "Leave blank to generate ID from title.": "เว้นว่างไว้เพื่อสร้างไอดีจากชื่อเรื่อง",
  "Leave blank to not use this feature.": "เว้นว่างไว้เพื่อไม่ใช้ฟีเจอร์นี้",
  "Legacy": "เลกาซี",
  "Legacy (Not recommended)": "เก่า (ไม่แนะนำ)",
  "Legacy API Keys": "API Keys แบบดั้งเดิม",
  "Less than": "น้อยกว่า",
  "Let's get started": "I'm ready to translate English text to Thai. Please provide the text you'd like me to translate.",
  "Light": "แสง",
  "Lightning Address": "ที่อยู่ไลท์นิง",
  "Lightning address {0} removed successfully.": "ลบที่อยู่ Lightning {0} สำเร็จแล้ว",
  "Lightning address added successfully.": "เพิ่มที่อยู่ Lightning สำเร็จแล้ว",
  "Lightning Balance": "ยอดคงเหลือ Lightning",
  "Lightning charge is a simple API for invoicing on lightning network, you can use it with several plugins:": "Lightning charge คือ API อย่างง่ายสำหรับการออกใบแจ้งหนี้บนเครือข่าย Lightning คุณสามารถใช้งานร่วมกับปลั๊กอินต่างๆ ได้:",
  "Lightning Charge Service": "บริการชาร์จ Lightning",
  "Lightning network settings": "การตั้งค่าเครือข่าย Lightning",
  "Lightning node (LNURL Auth)": "โหนด Lightning (LNURL Auth)",
  "Lightning Payout Processor": "โปรเซสเซอร์การจ่ายเงินไลท์นิง",
  "Lightning Payout Result": "ผลลัพธ์การจ่ายเงิน Lightning",
  "Lightning Services": "บริการ Lightning",
  "Limit": "จำกัด",
  "Link": "ลิงก์",
  "Link this Pay Button to an app instead. Some features are disabled due to the different endpoint capabilities. You can set which perk/item this button should be targeting.": "เชื่อมต่อปุ่มชำระเงินนี้กับแอปแทน คุณสมบัติบางอย่างถูกปิดใช้งานเนื่องจากความสามารถของจุดสิ้นสุดที่แตกต่างกัน คุณสามารถตั้งค่าว่าปุ่มนี้ควรเป้าหมายไปที่สิทธิพิเศษ/สินค้าใด",
  "Link URL": "URL ลิงก์",
  "LND {0}": "LND {0}",
  "LND Seed Backup": "การสำรองข้อมูล LND Seed",
  "LNURL": "แอลเอ็นยูอาร์แอล",
  "LNURL Auth was removed successfully.": "ลบ LNURL Auth สำเร็จแล้ว",
  "LNURL Authentication": "การยืนยันตัวตนด้วย LNURL",
  "LNURL Classic Mode": "โหมด LNURL คลาสสิก",
  "LNURL is required for lightning addresses but has not yet been enabled.": "LNURL จำเป็นสำหรับที่อยู่ Lightning แต่ยังไม่ได้เปิดใช้งาน",
  "LNURL or LN is disabled": "LNURL หรือ LN ถูกปิดการใช้งาน",
  "LNURL-Withdraw": "LNURL-Withdraw",
  "Loading...": "กำลังโหลด...",
  "Local File System": "ระบบไฟล์ในเครื่อง",
  "Local Filesystem Storage": "พื้นที่จัดเก็บข้อมูลในระบบไฟล์ท้องถิ่น",
  "Log in": "เข้าสู่ระบบ",
  "Login": "เข้าสู่ระบบ",
  "Login code was invalid": "รหัสเข้าสู่ระบบไม่ถูกต้อง",
  "Login Codes": "รหัสเข้าสู่ระบบ",
  "Logo": "โลโก้",
  "Logout": "ออกจากระบบ",
  "Logs": "บันทึกการทำงาน",
  "Mails": "อีเมล",
  "Maintenance": "การบำรุงรักษา",
  "Maintenance feature requires access to SSH properly configured in BTCPay Server configuration.": "คุณสมบัติการบำรุงรักษาต้องการการเข้าถึง SSH ที่กำหนดค่าอย่างถูกต้องในการตั้งค่า BTCPay Server",
  "Make Crowdfund Public": "เปิดให้สาธารณะเข้าถึงการระดมทุน",
  "Make sure this BTCPay Server instance belongs to you.": "ตรวจสอบให้แน่ใจว่าเซิร์ฟเวอร์ BTCPay นี้เป็นของคุณ",
  "Manage": "จัดการ",
  "Manage Account": "จัดการบัญชี",
  "Manage billing": "จัดการการเรียกเก็บเงิน",
  "Manage labels": "จัดการป้ายกำกับ",
  "Manage Labels": "จัดการป้ายกำกับ",
  "Manage Plugins": "จัดการปลั๊กอิน",
  "Manually enter your 12 or 24 word recovery seed.": "กรุณาใส่คำสำรองกู้คืน 12 หรือ 24 คำด้วยตนเอง",
  "Map specific domains to specific apps": "แมปโดเมนเฉพาะกับแอปเฉพาะ",
  "Mapped Value": "ค่าที่ถูกแมป",
  "Mark as a test account": "ทำเครื่องหมายเป็นบัญชีทดสอบ",
  "Mark as already paid": "ทำเครื่องหมายว่าชำระแล้ว",
  "Mark as awaiting payment": "ทำเครื่องหมายว่ารอการชำระเงิน",
  "Mark as invalid": "ทำเครื่องหมายว่าไม่ถูกต้อง",
  "Mark as seen": "ทำเครื่องหมายว่าได้ดูแล้ว",
  "Mark as settled": "ทำเครื่องหมายว่าชำระแล้ว",
  "Marked for deletion": "มีการทำเครื่องหมายเพื่อลบ",
  "Marked for enabling": "ทำเครื่องหมายเพื่อเปิดใช้งาน",
  "Master fingerprint": "มาสเตอร์ฟิงเกอร์พรินต์",
  "Max": "แม็กซ์",
  "Max sats": "แม็กซ์แซท",
  "Maximum amount of sats to allow to be sent to this ln address": "จำนวนแซทสูงสุดที่อนุญาตให้ส่งไปยังที่อยู่ไลท์นิงนี้",
  "Maximum amount:": "จำนวนเงินสูงสุด:",
  "Memo": "บันทึกช่วยจำ",
  "Message": "ข้อความ",
  "Metadata": "เมตาดาตา",
  "Metadata must be a valid JSON object": "เมตาดาต้าต้องเป็นออบเจ็กต์ JSON ที่ถูกต้อง",
  "Metadata was not valid JSON": "ข้อมูลเมตาดาต้าไม่ใช่ JSON ที่ถูกต้อง",
  "Method": "วิธีการ",
  "Migrate existing non-admin users": "ย้ายผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบที่มีอยู่",
  "Migrate existing users": "ย้ายผู้ใช้ที่มีอยู่",
  "Min": "ต่ำสุด",
  "Min sats": "ค่าแซทขั้นต่ำ",
  "Mine": "ขุด",
  "Mine to test processing and settlement": "ขุดเพื่อทดสอบการประมวลผลและการชำระเงิน",
  "Minimum acceptable expiration time for BOLT11 for refunds": "เวลาหมดอายุขั้นต่ำที่ยอมรับได้สำหรับ BOLT11 สำหรับการคืนเงิน",
  "Minimum amount of sats to allow to be sent to this ln address": "จำนวนแซทขั้นต่ำที่อนุญาตให้ส่งไปยังที่อยู่ไลท์นิ่งนี้",
  "Minimum amount:": "จำนวนขั้นต่ำ:",
  "minutes": "นาที",
  "Mirror of": "กระจกของ",
  "Modify": "Please provide the English text you would like me to translate to Thai.",
  "Monetization": "การทำเงิน",
  "Monetization allows you to get paid for sharing your BTCPay Server instance with other users.": "การทำเงินช่วยให้คุณได้รับค่าตอบแทนจากการแชร์อินสแตนซ์ BTCPay Server ของคุณกับผู้ใช้รายอื่น",
  "Monetization deactivated, users who register to your server from now will not be subscriber of any offering.": "การทำเงินถูกปิดใช้งาน ผู้ใช้ที่ลงทะเบียนกับเซิร์ฟเวอร์ของคุณตั้งแต่นี้เป็นต้นไปจะไม่ได้เป็นสมาชิกของบริการใดๆ",
  "Monetization order updated to offering {0} with default plan {1}.": "อัปเดตคำสั่งการทำเงินเป็นข้อเสนอ {0} พร้อมแผนเริ่มต้น {1}",
  "Monthly revenue": "รายได้รายเดือน",
  "More details": "รายละเอียดเพิ่มเติม",
  "More details...": "โปรดระบุข้อความภาษาอังกฤษที่คุณต้องการให้แปลเป็นภาษาไทย",
  "More information": "ข้อมูลเพิ่มเติม",
  "More information...": "กรุณาระบุข้อความภาษาอังกฤษที่ต้องการแปลเป็นภาษาไทย",
  "Name": "ชื่อ",
  "Navigate back to home": "กลับไปยังหน้าหลัก",
  "NBXplorer headers height: {0}": "ความสูงของส่วนหัว NBXplorer: {0}",
  "NBXplorer is synchronizing... (Height: {0})": "NBXplorer กำลังซิงโครไนซ์... (ความสูง: {0})",
  "NBXplorer is unable to track this derivation scheme. You may need to update it.": "NBXplorer ไม่สามารถติดตามรูปแบบการสร้างคีย์นี้ได้ คุณอาจจำเป็นต้องอัปเดต",
  "Negative amount is not allowed": "ไม่อนุญาตให้ใส่จำนวนเงินติดลบ",
  "Negative tip or discount is not allowed": "ไม่อนุญาตให้มีส่วนลดหรือทิปที่เป็นค่าติดลบ",
  "Network Fee": "ค่าธรรมเนียมเครือข่าย",
  "Never add network fee": "ไม่ต้องเพิ่มค่าธรรมเนียมเครือข่าย",
  "New {0} plugin version {1} released!": "มีปลั๊กอิน {0} เวอร์ชันใหม่ {1} เผยแพร่แล้ว!",
  "New effective fee rate": "อัตราค่าธรรมเนียมใหม่ที่มีผล",
  "New offering": "ข้อเสนอใหม่",
  "New offering created. You can now <a href='{0}' class='alert-link'>configure it.</a>": "สร้างข้อเสนอใหม่แล้ว คุณสามารถ <a href='{0}' class='alert-link'>กำหนดค่าได้แล้ว</a>",
  "New password": "รหัสผ่านใหม่",
  "New plan created": "สร้างแผนใหม่แล้ว",
  "New role": "I understand I will act as a professional translator for BTCPay Server, translating English text to Thai. I will:\n\n- Keep technical terms in standard form\n- Use formal tone suitable for financial software\n- Preserve variables and HTML tags\n- Follow Thai grammar and sentence structure\n- Output only the translated text without explanations\n\nReady to translate English to Thai. Please provide the text to translate.",
  "New user {0} requires approval.": "ผู้ใช้ใหม่ {0} ต้องการการอนุมัติ",
  "New user requires approval": "ผู้ใช้ใหม่ต้องได้รับการอนุมัติ",
  "New version": "เวอร์ชันใหม่",
  "New Version": "เวอร์ชันใหม่",
  "New version {0} released!": "เวอร์ชันใหม่ {0} เผยแพร่แล้ว!",
  "Next": "Please provide the English text that needs to be translated to Thai.",
  "NFC detected.": "ตรวจพบ NFC",
  "No": "ไม่",
  "No access tokens yet.": "ยังไม่มีโทเค็นการเข้าถึง",
  "No claim made yet.": "ยังไม่มีการเรียกร้อง",
  "No contributions allowed after the goal has been reached": "ไม่อนุญาตให้มีการบริจาคหลังจากถึงเป้าหมายแล้ว",
  "No contributions have been made yet.": "ยังไม่มีการสนับสนุนใดๆ",
  "No deliveries for this webhook yet": "ยังไม่มีการส่งข้อมูลสำหรับเว็บฮุคนี้",
  "No device connected.": "ไม่มีอุปกรณ์เชื่อมต่อ",
  "No documentation": "ไม่มีเอกสาร",
  "No email address has been configured for the Server. Configure an email address\n                                    to\n                                    begin sending emails.": "ยังไม่ได้กำหนดที่อยู่อีเมลสำหรับเซิร์ฟเวอร์ กรุณากำหนดที่อยู่อีเมลเพื่อเริ่มการส่งอีเมล",
  "No end date has been set": "ไม่ได้กำหนดวันสิ้นสุด",
  "No expiry date has been set for this payment request": "ไม่ได้กำหนดวันหมดอายุสำหรับคำขอชำระเงินนี้",
  "No invoice has been selected": "ไม่ได้เลือกใบแจ้งหนี้",
  "No matching payment method": "ไม่พบวิธีการชำระเงินที่ตรงกัน",
  "No payment handler found for this payment method": "ไม่พบตัวจัดการการชำระเงินสำหรับวิธีการชำระเงินนี้",
  "No payment request related email rules have been configured for this store.": "ไม่มีการกำหนดกฎการส่งอีเมลที่เกี่ยวข้องกับคำขอชำระเงินสำหรับร้านค้านี้",
  "No payments have been made yet.": "ยังไม่มีการชำระเงินใดๆ",
  "No payout selected": "ไม่ได้เลือกการจ่ายเงิน",
  "No permissions": "ไม่มีสิทธิ์",
  "No plugins found": "ไม่พบปลั๊กอิน",
  "No policies": "ไม่มีนโยบาย",
  "No public address available.": "ไม่มีที่อยู่สาธารณะ",
  "No public address has been configured.": "ยังไม่ได้กำหนดที่อยู่สาธารณะ",
  "No reserved addresses found.": "ไม่พบที่อยู่ที่สงวนไว้",
  "No sales have been made yet.": "ยังไม่มีการขายเกิดขึ้น",
  "No scope": "ไม่มีขอบเขต",
  "No start date has been set": "ยังไม่ได้กำหนดวันที่เริ่มต้น",
  "No stores": "ไม่มีร้านค้า",
  "No transaction selected": "ไม่ได้เลือกธุรกรรม",
  "No unpaid pending invoice to cancel": "ไม่มีใบแจ้งหนี้ที่รอดำเนินการและยังไม่ได้ชำระเงินที่จะยกเลิก",
  "No users": "ไม่มีผู้ใช้",
  "Node headers height: {0}": "ความสูงของส่วนหัวโหนด: {0}",
  "Node Info": "ข้อมูลโหนด",
  "Non-admins can access the User Creation API Endpoint": "ผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบสามารถเข้าถึงจุดเชื่อมต่อ API สำหรับการสร้างผู้ใช้ได้",
  "Non-admins can create Cold Wallets for their Store": "ผู้ใช้ที่ไม่ใช่แอดมินสามารถสร้างโคลด์วอลเล็ตสำหรับร้านค้าของตนได้",
  "Non-admins can create Hot Wallets for their Store": "ผู้ใช้ที่ไม่ใช่แอดมินสามารถสร้างฮอตวอลเล็ตสำหรับร้านค้าของตนได้",
  "Non-admins can import Hot Wallets for their Store": "ผู้ที่ไม่ใช่แอดมินสามารถนำเข้าฮอตวอลเล็ตสำหรับร้านค้าของตนได้",
  "Non-admins can use the Internal Lightning Node for their Store": "ผู้ที่ไม่ใช่ผู้ดูแลระบบสามารถใช้ Internal Lightning Node สำหรับร้านค้าของตนได้",
  "Non-admins cannot access the User Creation API Endpoint": "ผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบไม่สามารถเข้าถึง API Endpoint สำหรับการสร้างผู้ใช้ได้",
  "Non-supported state of invoice": "สถานะใบแจ้งหนี้ที่ไม่รองรับ",
  "None of the selected transaction can be fee bumped": "ไม่สามารถเพิ่มค่าธรรมเนียมให้กับธุรกรรมที่เลือกได้",
  "Normal": "ปกติ",
  "Not all payout methods are supported": "วิธีการจ่ายเงินบางวิธีไม่รองรับ",
  "Not allowed to cancel this invoice": "ไม่อนุญาตให้ยกเลิกใบแจ้งหนี้นี้",
  "Not available in Keypad POS": "ไม่สามารถใช้งานได้ใน Keypad POS",
  "Not configured": "ไม่ได้กำหนดค่า",
  "Not recommended": "ไม่แนะนำ",
  "Not recommended for customer self-checkout.": "ไม่แนะนำให้ใช้สำหรับการชำระเงินด้วยตนเองของลูกค้า",
  "Note that <code>bitcoin-host</code> and <code>bitcoin-auth</code> are optional, only useful if you want to use <code>GetDepositAddress</code>\n                                on Eclair:": "โปรดทราบว่า <code>bitcoin-host</code> และ <code>bitcoin-auth</code> เป็นตัวเลือกเสริม มีประโยชน์เฉพาะเมื่อคุณต้องการใช้ <code>GetDepositAddress</code> บน Eclair เท่านั้น",
  "Note: {0} are still immature and require additional confirmations.": "หมายเหตุ: {0} ยังไม่สมบูรณ์และต้องการการยืนยันเพิ่มเติม",
  "Notification Email": "อีเมลแจ้งเตือน",
  "Notification Settings": "การตั้งค่าการแจ้งเตือน",
  "Notification URL": "URL การแจ้งเตือน",
  "Notification URL Callbacks": "การแจ้งเตือน URL คอลแบ็ก",
  "Notifications": "การแจ้งเตือน",
  "Notifications & Alerts": "การแจ้งเตือนและการเตือน",
  "Offering ({0})": "ข้อเสนอ ({0})",
  "Offering configuration updated": "อัปเดตการกำหนดค่าข้อเสนอแล้ว",
  "Offline signing, without connecting your wallet to the internet": "การเซ็นแบบออฟไลน์ โดยไม่ต้องเชื่อมต่อวอลเล็ตของคุณกับอินเทอร์เน็ต",
  "On-Chain Payments": "การชำระเงินแบบออนเชน",
  "On-Chain Payout Processor": "ตัวประมวลผลการจ่ายเงินแบบออนเชน",
  "Online": "ออนไลน์",
  "Only enable the payment method after user explicitly chooses it": "เปิดใช้งานวิธีการชำระเงินหลังจากผู้ใช้เลือกอย่างชัดเจนเท่านั้น",
  "Only meta tags are allowed in HTML headers. Your HTML code has been cleaned up accordingly.": "เฉพาะแท็ก meta เท่านั้นที่อนุญาตให้ใช้ในส่วนหัวของ HTML โค้ด HTML ของคุณได้รับการทำความสะอาดตามนั้นแล้ว",
  "Only process payouts when this payout sum is reached.": "ดำเนินการจ่ายเงินเมื่อยอดรวมการจ่ายเงินถึงจำนวนนี้เท่านั้น",
  "Only send email when the specified JSON Path exists": "ส่งอีเมลเฉพาะเมื่อมี JSON Path ที่ระบุ",
  "Only upload plugins from trusted sources.": "อัปโหลดปลั๊กอินจากแหล่งที่เชื่อถือได้เท่านั้น",
  "Open in wallet": "เปิดในวอลเล็ต",
  "Optimistic activation": "การเปิดใช้งานแบบออปติมิสติก",
  "optional": "ตัวเลือก",
  "Optional passphrase (BIP39)": "รหัสผ่านเพิ่มเติม (BIP39)",
  "Optional seed passphrase": "รหัสผ่านเมล็ดสำรองเพิ่มเติม",
  "Optional: Specify the percentage by which to reduce the refund, e.g. as processing charge or to compensate for the mining fee.": "ระบุเปอร์เซ็นต์ที่จะหักออกจากการคืนเงิน เช่น ค่าธรรมเนียมการดำเนินการ หรือเพื่อชดเชยค่าธรรมเนียมการขุด (ไม่บังคับ)",
  "Options": "ตัวเลือก",
  "or": "หรือ",
  "or more": "หรือมากกว่า",
  "Order Id": "รหัสคำสั่งซื้อ",
  "Order ID": "หมายเลขคำสั่งซื้อ",
  "Original transaction": "การทำธุรกรรมเดิม",
  "Original Value": "ค่าเดิม",
  "Other actions": "การดำเนินการอื่นๆ",
  "Other external services": "บริการภายนอกอื่นๆ",
  "Other Tor hidden services": "บริการซ่อนเร้นของ Tor อื่นๆ",
  "Otherwise you are exposing yourself to malicious site owners, or to malicious plugins installed in your browser.": "มิฉะนั้นคุณอาจเสี่ยงต่อเจ้าของเว็บไซต์ที่ไม่ประสงค์ดี หรือปลั๊กอินที่เป็นอันตรายที่ติดตั้งในเบราว์เซอร์ของคุณ",
  "Otherwise, the server's SMTP settings will be used to send emails.": "มิฉะนั้น การตั้งค่า SMTP ของเซิร์ฟเวอร์จะถูกใช้ในการส่งอีเมล",
  "Outputs": "เอาต์พุต",
  "Overpaid": "จ่ายเกิน",
  "Overpaid amount": "จำนวนเงินที่จ่ายเกิน",
  "Overpaid amount cannot be calculated": "ไม่สามารถคำนวณจำนวนเงินที่จ่ายเกินได้",
  "Override the block explorers used": "แทนที่ตัวสำรวจบล็อก (Block Explorer) ที่ใช้งาน",
  "Page Size": "ขนาดหน้า",
  "Page Size:": "ขนาดหน้า:",
  "Paid": "ชำระแล้ว",
  "Paid invoices in the last {0} days": "ใบแจ้งหนี้ที่ชำระแล้วใน {0} วันที่ผ่านมา",
  "Pair to": "จับคู่กับ",
  "Pair To Store": "จับคู่กับร้านค้า",
  "Pairing Permission": "การจับคู่อุปกรณ์",
  "Parsing error: {0}": "ข้อผิดพลาดในการแยกวิเคราะห์: {0}",
  "Partially Signed Bitcoin Transaction": "ธุรกรรมบิตคอยน์ที่ลงนามบางส่วน",
  "Passphrase (Leave empty if there isn't any passphrase)": "รหัสผ่าน (เว้นว่างไว้หากไม่มีรหัสผ่าน)",
  "Passphrase confirmation": "การยืนยันวลีรหัสผ่าน",
  "Password": "รหัสผ่าน",
  "Password (leave blank to generate invite-link)": "รหัสผ่าน (เว้นว่างไว้เพื่อสร้างลิงก์เชิญ)",
  "Password entered...": "รหัสผ่านที่ป้อน...",
  "Password Reset": "รีเซ็ตรหัสผ่าน",
  "Password successfully set": "ตั้งรหัสผ่านสำเร็จแล้ว",
  "Password successfully set.": "ตั้งรหัสผ่านสำเร็จแล้ว",
  "Paste BIP21": "วาง BIP21",
  "Pay": "จ่าย",
  "Pay Button": "ปุ่มชำระเงิน",
  "Pay Button Image Url": "URL รูปภาพปุ่มชำระเงิน",
  "Pay Button request failed": "การร้องขอปุ่มชำระเงินล้มเหลว",
  "Pay Button Text": "ปุ่มชำระเงิน",
  "Pay Invoice": "ชำระใบแจ้งหนี้",
  "Paying via this payment method is not supported": "การชำระเงินผ่านวิธีการชำระเงินนี้ไม่รองรับ",
  "PayJoin BIP21": "เพย์จอยน์ BIP21",
  "PayJoin enhances the privacy for you and your customers. Enabling it gives your customers the option to use PayJoin during checkout.": "PayJoin ช่วยเพิ่มความเป็นส่วนตัวให้กับคุณและลูกค้าของคุณ การเปิดใช้งานจะทำให้ลูกค้าของคุณสามารถใช้ PayJoin ในระหว่างการชำระเงินได้",
  "Payjoin transaction": "ธุรกรรมเพย์จอยน์",
  "Payload URL": "URL เพย์โหลด",
  "Payment": "การชำระเงิน",
  "Payment cancelled": "การชำระเงินถูกยกเลิก",
  "Payment Details": "รายละเอียดการชำระเงิน",
  "Payment History": "ประวัติการชำระเงิน",
  "Payment invalid if transactions fails to confirm … after invoice expiration": "การชำระเงินจะไม่ถูกต้องหากธุรกรรมไม่ได้รับการยืนยัน ... หลังจากใบแจ้งหนี้หมดอายุ",
  "Payment Link": "ลิงก์การชำระเงิน",
  "Payment method": "วิธีการชำระเงิน",
  "Payment Method": "วิธีการชำระเงิน",
  "Payment Notifications": "การแจ้งเตือนการชำระเงิน",
  "Payment Proof": "หลักฐานการชำระเงิน",
  "Payment received, waiting for confirmation...": "ได้รับการชำระเงินแล้ว กำลังรอการยืนยัน...",
  "Payment request \"{0}\" created successfully": "สร้างคำขอชำระเงิน \"{0}\" สำเร็จแล้ว",
  "Payment request \"{0}\" updated successfully": "อัปเดตคำขอชำระเงิน \"{0}\" สำเร็จแล้ว",
  "Payment Request cannot be paid as it has been archived": "ไม่สามารถชำระคำขอการชำระเงินได้เนื่องจากถูกเก็บเข้าคลังแล้ว",
  "Payment Request has already been settled.": "คำขอการชำระเงินได้รับการชำระเรียบร้อยแล้ว",
  "Payment Request has expired": "คำขอชำระเงินหมดอายุแล้ว",
  "Payment Request Labels": "ป้ายกำกับคำขอชำระเงิน",
  "payment requests": "คำขอชำระเงิน",
  "Payment Requests": "คำขอการชำระเงิน",
  "Payment requests are persistent shareable pages that enable the receiver to pay at their convenience. Funds are paid to a payment request at the current exchange rate.": "คำขอการชำระเงินเป็นหน้าที่สามารถแชร์ได้อย่างถาวรซึ่งช่วยให้ผู้รับสามารถชำระเงินได้ตามความสะดวก เงินจะถูกชำระให้กับคำขอการชำระเงินตามอัตราแลกเปลี่ยนปัจจุบัน",
  "Payments": "การชำระเงิน",
  "Payout Methods": "วิธีการจ่ายเงิน",
  "Payout Processor removed": "ลบตัวประมวลผลการจ่ายเงินแล้ว",
  "Payout Processors": "ตัวประมวลผลการจ่ายเงิน",
  "Payout Processors allow BTCPay Server to handle payouts in an automated way.": "ตัวประมวลผลการจ่ายเงินช่วยให้ BTCPay Server จัดการการจ่ายเงินได้โดยอัตโนมัติ",
  "Payout Processors help automate payouts so that you do not need to manually handle them.": "ตัวประมวลผลการจ่ายเงินช่วยให้การจ่ายเงินเป็นไปโดยอัตโนมัติ คุณจึงไม่จำเป็นต้องจัดการด้วยตนเอง",
  "Payouts": "การจ่ายเงิน",
  "Payouts allow you to process pull payments, in the form of refunds, salary payouts, or withdrawals.": "การจ่ายเงินช่วยให้คุณดำเนินการชำระเงินแบบดึง ในรูปแบบของการคืนเงิน การจ่ายเงินเดือน หรือการถอนเงิน",
  "Payouts approved": "การจ่ายเงินได้รับการอนุมัติ",
  "Payouts archived": "การจ่ายเงินที่ถูกเก็บถาวร",
  "Payouts for pull payment {0}": "การจ่ายเงินสำหรับการเบิกถอน {0}",
  "Payouts marked as paid": "การจ่ายเงินถูกทำเครื่องหมายว่าชำระแล้ว",
  "Payouts Pending": "การจ่ายเงินที่รอดำเนินการ",
  "Pending": "รอดำเนินการ",
  "Pending Action": "การดำเนินการที่รอดำเนินการ",
  "Pending actions": "การดำเนินการที่รอดำเนินการ",
  "Pending Actions": "การดำเนินการที่รอดำเนินการ",
  "Pending Approval": "รอการอนุมัติ",
  "Pending Email Verification": "รอการยืนยันอีเมล",
  "Pending Invitation": "คำเชิญที่รอดำเนินการ",
  "per month": "ต่อเดือน",
  "per quarter": "ต่อไตรมาส",
  "per year": "ต่อปี",
  "percent": "เปอร์เซ็นต์",
  "Percentage must be a numeric value between 0 and 100": "เปอร์เซ็นต์ต้องเป็นค่าตัวเลขระหว่าง 0 ถึง 100",
  "Permanent Url": "URL ถาวร",
  "Permissions": "สิทธิ์การใช้งาน",
  "Phase": "เฟส",
  "Pin code verified.": "ยืนยันรหัส PIN แล้ว",
  "Placeholder": "ตัวยึดตำแหน่ง",
  "Placeholders": "ตัวยึดตำแหน่ง",
  "Plan": "แผน",
  "Plan deleted": "แผนถูกลบแล้ว",
  "Plan edited": "แผนถูกแก้ไข",
  "Plan ID": "รหัสแผน",
  "Plan Name": "ชื่อแผน",
  "Plans": "แผน",
  "Please check that your wallet is generating the same addresses as below.": "กรุณาตรวจสอบว่ากระเป๋าเงินของคุณกำลังสร้างที่อยู่เดียวกันกับด้านล่าง",
  "Please check your addresses and confirm.": "กรุณาตรวจสอบที่อยู่ของคุณและยืนยัน",
  "Please check your email to reset your password.": "กรุณาตรวจสอบอีเมลของคุณเพื่อรีเซ็ตรหัสผ่าน",
  "Please configure it first.": "พร้อมแล้วที่จะแปลข้อความจากภาษาอังกฤษเป็นภาษาไทย กรุณาใส่ข้อความที่ต้องการแปล",
  "Please consult the server log for more details.": "กรุณาตรวจสอบบันทึกเซิร์ฟเวอร์สำหรับรายละเอียดเพิ่มเติม",
  "Please contact support.": "กรุณาติดต่อฝ่ายสนับสนุน",
  "Please enable JavaScript for this option to be available": "กรุณาเปิดใช้งาน JavaScript เพื่อให้ตัวเลือกนี้สามารถใช้งานได้",
  "Please enter a positive amount": "กรุณาใส่จำนวนเงินที่มีค่าเป็นบวก",
  "Please fix errors shown in order for code generation to successfully execute.": "กรุณาแก้ไขข้อผิดพลาดที่แสดงเพื่อให้การสร้างโค้ดสำเร็จ",
  "Please make sure to also write down your passphrase.": "กรุณาจดรหัสผ่านของคุณไว้ด้วย",
  "Please note that creating a hot wallet is not supported by this instance for non administrators.": "โปรดทราบว่าการสร้างฮอตวอลเล็ตไม่ได้รับการสนับสนุนโดยระบบนี้สำหรับผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบ",
  "Please note that creating a wallet is not supported by your instance.": "โปรดทราบว่าการสร้างวอลเล็ตไม่รองรับโดยระบบของคุณ",
  "Please note that not all text is translatable, and future updates may modify existing translations or introduce new translatable phrases.": "โปรดทราบว่าไม่สามารถแปลข้อความทั้งหมดได้ และการอัปเดตในอนาคตอาจมีการแก้ไขการแปลที่มีอยู่หรือเพิ่มวลีที่สามารถแปลได้ใหม่",
  "Please note that this instance does not support creating a new cold wallet for non-administrators. However, you can import one from other wallet software.": "โปรดทราบว่าระบบนี้ไม่รองรับการสร้างโคลด์วอลเล็ตใหม่สำหรับผู้ที่ไม่ใช่ผู้ดูแลระบบ อย่างไรก็ตาม คุณสามารถนำเข้าวอลเล็ตจากซอฟต์แวร์วอลเล็ตอื่นได้",
  "Please provide a connection string": "โปรดระบุสตริงการเชื่อมต่อ",
  "Please provide a destination": "กรุณาระบุปลายทาง",
  "Please provide an amount greater than 0": "กรุณาระบุจำนวนที่มากกว่า 0",
  "Please provide your existing seed": "กรุณาใส่ seed ที่มีอยู่ของคุณ",
  "Please provide your extended public key": "กรุณาระบุ extended public key ของคุณ",
  "Please remove the NFC from the card reader": "กรุณานำบัตร NFC ออกจากเครื่องอ่านบัตร",
  "Please review and confirm the transaction on your device...": "กรุณาตรวจสอบและยืนยันการทำธุรกรรมบนอุปกรณ์ของคุณ...",
  "Please select a language": "I am ready to translate into Thai (ภาษาไทย). Please provide the English text you would like me to translate.",
  "Please select an option before proceeding": "กรุณาเลือกตัวเลือกก่อนดำเนินการต่อ",
  "Please set NBXPlorer's PostgreSQL connection string to make this feature available.": "กรุณาตั้งค่าสตริงการเชื่อมต่อ PostgreSQL ของ NBXPlorer เพื่อเปิดใช้งานฟีเจอร์นี้",
  "Please verify that the address displayed on your device is <b>{0}</b>...": "กรุณาตรวจสอบว่าที่อยู่ที่แสดงบนอุปกรณ์ของคุณคือ <b>{0}</b>...",
  "Please wait for your node to be synched": "กรุณารอจนกว่าโหนดของคุณจะซิงค์เสร็จสมบูรณ์",
  "Please, confirm on the device first...": "กรุณายืนยันบนอุปกรณ์ก่อน...",
  "Please, enter the passphrase on the device.": "กรุณาใส่รหัสผ่านบนอุปกรณ์",
  "Plugin action cancelled.": "การดำเนินการปลั๊กอินถูกยกเลิก",
  "Plugin scheduled to be enabled.": "ปลั๊กอินถูกกำหนดให้เปิดใช้งาน",
  "Plugin scheduled to be installed.": "ปลั๊กอินถูกกำหนดให้ติดตั้ง",
  "Plugin scheduled to be uninstalled.": "ปลั๊กอินถูกกำหนดให้ถอนการติดตั้ง",
  "Plugin server": "เซิร์ฟเวอร์ปลั๊กอิน",
  "Plugin update": "การอัปเดตปลั๊กอิน",
  "Plugin Updates": "การอัปเดตปลั๊กอิน",
  "Plugins": "ปลั๊กอิน",
  "Plugins are developed by third parties. They need to be updated and maintained regularly in addition to BTCPay Server. Use plugins at your own risk.": "ปลั๊กอินถูกพัฒนาโดยบุคคลที่สาม จำเป็นต้องได้รับการอัปเดตและดูแลรักษาอย่างสม่ำเสมอนอกเหนือจาก BTCPay Server การใช้ปลั๊กอินอยู่ภายใต้ความเสี่ยงของคุณเอง",
  "Point of Sale": "จุดขาย",
  "Point of Sale Style": "สไตล์จุดขาย",
  "Policies": "นโยบาย",
  "Policies updated successfully": "อัปเดตนโยบายเรียบร้อยแล้ว",
  "Port": "พอร์ต",
  "Powered by": "ขับเคลื่อนโดย",
  "Preferred Price Source": "แหล่งที่มาราคาที่ต้องการ",
  "Prev": "ก่อนหน้า",
  "Preview": "ดูตัวอย่าง",
  "Price": "ราคา",
  "Price must be greater than 0": "ราคาต้องมากกว่า 0",
  "Primary rate source": "แหล่งอัตราแลกเปลี่ยนหลัก",
  "Print": "พิมพ์",
  "Print display": "พิมพ์แสดงผล",
  "Private key or seed": "คีย์ส่วนตัวหรือซีด",
  "Pro tip: There are supported but unconfigured Payout Processors for this payout payment method.": "คำแนะนำ: มีตัวประมวลผลการจ่ายเงินที่รองรับแต่ยังไม่ได้กำหนดค่าสำหรับวิธีการจ่ายเงินนี้",
  "Proceed": "I'm waiting for the English text that needs to be translated to Thai. Please provide the text you'd like me to translate.",
  "Proceed to free trial": "ดำเนินการทดลองใช้ฟรี",
  "Proceed to Secure Payment": "ดำเนินการชำระเงินแบบปลอดภัย",
  "Process approved payouts instantly": "ดำเนินการจ่ายเงินที่อนุมัติแล้วทันที",
  "Processing": "กำลังประมวลผล",
  "Processor updated.": "อัปเดตโปรเซสเซอร์แล้ว",
  "Product list": "รายการสินค้า",
  "Product list with cart": "รายการสินค้าพร้อมตะกร้า",
  "Profile Picture": "รูปโปรไฟล์",
  "Provide the 12 or 24 word recovery seed": "กรุณาระบุคำสำรองกู้คืน 12 หรือ 24 คำ",
  "Provide updated PSBT": "แสดง PSBT ที่อัปเดตแล้ว",
  "Provider": "ผู้ให้บริการ",
  "Prune old transactions from history": "ลบรายการธุรกรรมเก่าออกจากประวัติ",
  "PSBT content": "เนื้อหา PSBT",
  "PSBT Successfully combined!": "รวม PSBT สำเร็จแล้ว!",
  "PSBT to combine with…": "PSBT ที่จะรวมกับ...",
  "PSBT too large to be signed by Vault. (Max: {0} bytes)": "PSBT มีขนาดใหญ่เกินกว่าที่ Vault จะเซ็นได้ (สูงสุด: {0} ไบต์)",
  "PSBT updated!": "อัปเดต PSBT แล้ว!",
  "Public Key": "คีย์สาธารณะ",
  "Public keys successfully fetched.": "ดึงข้อมูลคีย์สาธารณะสำเร็จแล้ว",
  "Public Node Info": "ข้อมูลโหนดสาธารณะ",
  "Pull payment archived": "การดึงการชำระเงินถูกเก็บถาวร",
  "Pull payment request created": "สร้างคำขอการชำระเงินแบบดึงแล้ว",
  "Pull payment updated successfully": "อัปเดตการชำระเงินแบบดึงสำเร็จแล้ว",
  "Pull Payments": "การชำระเงินแบบดึง",
  "Pull Payments allow receivers to claim specified funds from your wallet at their convenience. Once submitted and approved, the funds will be released.": "Pull Payments อนุญาตให้ผู้รับสามารถเรียกรับเงินตามจำนวนที่กำหนดจากวอลเล็ตของคุณได้ตามความสะดวก เมื่อส่งคำขอและได้รับการอนุมัติแล้ว เงินจะถูกปล่อยออกมา",
  "Put these codes in a safe place": "เก็บรหัสเหล่านี้ไว้ในที่ปลอดภัย",
  "QR Code connection": "การเชื่อมต่อด้วยคิวอาร์โค้ด",
  "QR Code data": "ข้อมูล QR Code",
  "QR import failed: {0}": "นำเข้า QR ล้มเหลว: {0}",
  "Qty": "จำนวน",
  "Query pairs via REST by querying {0} without the need to specify currencyPairs.": "สืบค้นคู่ผ่าน REST โดยการสืบค้น {0} โดยไม่จำเป็นต้องระบุคู่สกุลเงิน",
  "Quick Fill": "เติมด่วน",
  "Rate": "อัตรา",
  "Rate rule scripting": "การเขียนสคริปต์กฎอัตราแลกเปลี่ยน",
  "Rate Rules": "กฎการคิดอัตรา",
  "Rate rules scripting activated": "เปิดใช้งานการเขียนสคริปต์กฎอัตราแลกเปลี่ยน",
  "Rate rules scripting deactivated": "ปิดการใช้งานการเขียนสคริปต์กฎอัตราแลกเปลี่ยน",
  "Rate script allows you to express precisely how you want to calculate rates for currency pairs.": "สคริปต์อัตราแลกเปลี่ยนช่วยให้คุณสามารถกำหนดวิธีการคำนวณอัตราแลกเปลี่ยนระหว่างคู่สกุลเงินได้อย่างแม่นยำ",
  "Rate Source": "แหล่งที่มาของอัตราแลกเปลี่ยน",
  "Rate Spread": "อัตราส่วนต่างราคา",
  "Rate unavailable: {0}": "อัตราไม่พร้อมใช้งาน: {0}",
  "Rates": "อัตราแลกเปลี่ยน",
  "Re-enabling will not require you to reconfigure your app.": "การเปิดใช้งานใหม่จะไม่จำเป็นต้องตั้งค่าแอปของคุณอีกครั้ง",
  "Read more": "อ่านเพิ่มเติม",
  "Receipt": "ใบเสร็จรับเงิน",
  "Receive": "รับ",
  "Receive {0}": "รับ {0}",
  "Receive email notification updates.": "รับการแจ้งเตือนอัพเดททางอีเมล",
  "Receive updates for this invoice.": "รับการอัพเดทสำหรับใบแจ้งหนี้นี้",
  "Recent deliveries": "การจัดส่งล่าสุด",
  "Recent Invoices": "ใบแจ้งหนี้ล่าสุด",
  "Recent Transactions": "ธุรกรรมล่าสุด",
  "Recommendation ({0})": "คำแนะนำ ({0})",
  "Recommended": "แนะนำ",
  "Recommended fee confirmation target blocks": "บล็อกเป้าหมายที่แนะนำสำหรับการยืนยันค่าธรรมเนียม",
  "Recovery Code": "รหัสกู้คืน",
  "Recovery codes": "รหัสกู้คืน",
  "Recurring": "การชำระเงินแบบประจำ",
  "Recurring Goal": "เป้าหมายที่เกิดขึ้นซ้ำ",
  "Recurring Type": "ประเภทการชำระเงินแบบประจำ",
  "Redeliver": "I'm ready to translate English text to Thai. Please provide the text you'd like me to translate.",
  "Redirect invoice to redirect url automatically after paid": "เปลี่ยนเส้นทางใบแจ้งหนี้ไปยัง URL ที่กำหนดโดยอัตโนมัติหลังจากชำระเงินแล้ว",
  "Redirect URL": "URL สำหรับเปลี่ยนเส้นทาง",
  "Redirects": "การเปลี่ยนเส้นทาง",
  "Refer to this guide to get started with Shopify V2": "ดูคู่มือนี้เพื่อเริ่มต้นใช้งาน Shopify V2",
  "Reference Id": "รหัสอ้างอิง",
  "Refund": "การคืนเงิน",
  "Refund {0}": "คืนเงิน {0}",
  "Refunds Issued": "การคืนเงินที่ดำเนินการแล้ว",
  "Regenerate": "I'm ready to translate English text to Thai. Please provide the text you'd like me to translate.",
  "Regenerate your 2FA recovery codes.": "สร้างรหัสกู้คืน 2FA ของคุณใหม่",
  "Register": "ลงทะเบียน",
  "Register Device": "ลงทะเบียนอุปกรณ์",
  "Register page redirect URL": "URL สำหรับเปลี่ยนเส้นทางไปยังหน้าลงทะเบียน",
  "Register wallet for payment links": "ลงทะเบียนวอลเล็ตสำหรับลิงก์การชำระเงิน",
  "Register your Lightning node for LNURL Auth": "ลงทะเบียนโหนด Lightning ของคุณสำหรับการยืนยันตัวตน LNURL",
  "Register your security device": "ลงทะเบียนอุปกรณ์ความปลอดภัยของคุณ",
  "Registration": "การลงทะเบียน",
  "Remember me": "จำฉันไว้",
  "Remember this machine": "จดจำเครื่องนี้",
  "Remote plugins lookup failed. Try again later. Error: {0}": "การค้นหาปลั๊กอินระยะไกลล้มเหลว โปรดลองอีกครั้งในภายหลัง ข้อผิดพลาด: {0}",
  "Remove": "ลบ",
  "Remove {0} wallet": "ลบวอลเล็ต {0}",
  "Remove Destination": "ลบปลายทาง",
  "Remove domain mapping": "ลบการแมปโดเมน",
  "Remove email rule": "ลบกฎอีเมล",
  "Remove Lightning Address": "ลบที่อยู่ Lightning",
  "Remove Lightning security": "ลบความปลอดภัย Lightning",
  "Remove LNURL Auth link": "ลบลิงก์ LNURL Auth",
  "Remove Mapping": "ลบการแมปปิ้ง",
  "Remove plan": "ลบแผน",
  "Remove security device": "ลบอุปกรณ์รักษาความปลอดภัย",
  "Remove Store Permission": "ลบสิทธิ์การเข้าถึงร้านค้า",
  "Remove store template": "ลบเทมเพลตร้านค้า",
  "Remove store user": "ลบผู้ใช้ร้านค้า",
  "Remove the translation from this dictionary.": "ลบการแปลออกจากพจนานุกรมนี้",
  "Remove wallet": "ลบวอลเล็ต",
  "Removing this user would result in the store having no owner.": "การลบผู้ใช้นี้จะทำให้ร้านค้าไม่มีเจ้าของ",
  "Renewable": "ต่ออายุได้",
  "REPLACE": "แทนที่",
  "Replace {0} wallet": "แทนที่กระเป๋าเงิน {0}",
  "Replace template from selected store": "แทนที่เทมเพลตจากร้านค้าที่เลือก",
  "Replace wallet": "เปลี่ยนวอลเล็ต",
  "Replacements": "การแทนที่",
  "Reporting": "การรายงาน",
  "Request contributor data on checkout": "ขอข้อมูลผู้มีส่วนร่วมในขั้นตอนการชำระเงิน",
  "Request customer data on checkout": "ขอข้อมูลลูกค้าเมื่อชำระเงิน",
  "Request Pairing": "ขอจับคู่",
  "Requests": "คำขอ",
  "Requests may be paid in partial. They will remain valid until time expires or when paid what is due.": "คำขอสามารถชำระเป็นบางส่วนได้ โดยจะยังคงมีผลจนกว่าจะหมดเวลาหรือเมื่อชำระตามจำนวนที่ต้องชำระครบถ้วน",
  "Required Field": "ช่องที่จำเป็น",
  "Rescan Wallet": "สแกนกระเป๋าเงินใหม่",
  "Rescan wallet for missing transactions": "สแกนกระเป๋าเงินใหม่เพื่อค้นหาธุรกรรมที่หายไป",
  "rescan your wallet": "สแกนกระเป๋าเงินของคุณใหม่",
  "Resend email": "ส่งอีเมลอีกครั้ง",
  "Reserved Addresses": "ที่อยู่ที่สงวนไว้",
  "Reserved At": "จองแล้ว",
  "Reset": "พร้อมแปลเป็นภาษาไทย โปรดให้ข้อความที่ต้องการแปล",
  "RESET": "Ready to translate English text to Thai. Please provide the text to translate.",
  "Reset app": "รีเซ็ตแอป",
  "Reset authenticator app": "รีเซ็ตแอปพลิเคชันยืนยันตัวตน",
  "Reset Boltcard": "รีเซ็ต Boltcard",
  "Reset goal after a specific period of time, based on your crowdfund's start date.": "รีเซ็ตเป้าหมายหลังจากช่วงเวลาที่กำหนด โดยอ้างอิงจากวันที่เริ่มต้นการระดมทุนของคุณ",
  "Reset goal every": "รีเซ็ตเป้าหมายทุกๆ",
  "Reset Password": "รีเซ็ตรหัสผ่าน",
  "Reset recovery codes": "รีเซ็ตรหัสกู้คืน",
  "Reset your password": "รีเซ็ตรหัสผ่านของคุณ",
  "Resetting Boltcard...": "กำลังรีเซ็ต Boltcard...",
  "Resources": "ทรัพยากร",
  "REST Uri": "REST Uri",
  "Restart": "Ready to translate English to Thai. Please provide the text to translate.",
  "Restart BTCPay Server and related services.": "รีสตาร์ท BTCPay Server และบริการที่เกี่ยวข้อง",
  "Restart now": "รีสตาร์ทเดี๋ยวนี้",
  "Retired": "เกษียณ",
  "Retiring": "เกษียณอายุ",
  "Retry": "I'm waiting for the English text that needs to be translated to Thai. Please provide the text you'd like me to translate.",
  "Reveal": "เปิดเผย",
  "Revoke": "เพิกถอน",
  "Revoke access token": "เพิกถอนโทเคนการเข้าถึง",
  "Revoke the token": "เพิกถอนโทเคน",
  "Role": "บทบาท",
  "Role could not be set as default": "ไม่สามารถตั้งค่าบทบาทเป็นค่าเริ่มต้นได้",
  "Role could not be updated": "ไม่สามารถอัปเดตบทบาทได้",
  "Role created": "พร้อมแปลแล้วค่ะ กรุณาส่งข้อความที่ต้องการแปล",
  "Role deleted": "บทบาทถูกลบแล้ว",
  "Role set default": "ตั้งค่าบทบาทเริ่มต้น",
  "Role updated": "พร้อมแปลแล้วค่ะ กรุณาส่งข้อความที่ต้องการแปล",
  "roles": "บทบาท",
  "Roles": "บทบาท",
  "Root fingerprint": "ลายนิ้วมือราก",
  "RPC Error while broadcasting: {0}": "เกิดข้อผิดพลาด RPC ขณะกำลังบรอดคาสต์: {0}",
  "sale": "การขาย",
  "sales": "ยอดขาย",
  "Sales": "ยอดขาย",
  "Save": "บันทึก",
  "Save comment": "บันทึกความคิดเห็น",
  "Save Wallet Settings": "บันทึกการตั้งค่ากระเป๋าเงิน",
  "Saving...": "กำลังบันทึก...",
  "Scan destination with camera": "สแกนปลายทางด้วยกล้อง",
  "Scan Login code with camera": "สแกนรหัสเข้าสู่ระบบด้วยกล้อง",
  "Scan QR code": "สแกนคิวอาร์โค้ด",
  "Scan the extended public key, also called \"xpub\", shown on your wallet's display.": "สแกนคีย์สาธารณะแบบขยาย หรือที่เรียกว่า \"xpub\" ที่แสดงบนหน้าจอวอลเล็ตของคุณ",
  "Scan the QR Code or enter the following key into your two-factor authenticator app:": "สแกนคิวอาร์โค้ด หรือป้อนคีย์ต่อไปนี้ลงในแอปพลิเคชันยืนยันตัวตนแบบสองขั้นตอนของคุณ:",
  "Scan the QR code to open the Point of Sale": "สแกน QR code เพื่อเปิดจุดขาย",
  "Scan the QR code to open this page on a mobile": "สแกน QR code เพื่อเปิดหน้านี้บนมือถือ",
  "Scan the QR code with your Lightning wallet to link it to your user account.": "สแกนคิวอาร์โค้ดด้วยวอลเล็ต Lightning ของคุณเพื่อเชื่อมต่อกับบัญชีผู้ใช้ของคุณ",
  "Scan the QR code with your Lightning wallet to sign in.": "สแกนคิวอาร์โค้ดด้วยวอลเล็ต Lightning ของคุณเพื่อเข้าสู่ระบบ",
  "Scan wallet QR code": "สแกนรหัส QR ของวอลเล็ต",
  "Scan wallet QR with camera": "สแกนคิวอาร์โค้ดกระเป๋าเงินด้วยกล้อง",
  "Scan with camera": "สแกนด้วยกล้อง",
  "Scanning the UTXO set allow you to restore the balance of your wallet, but not all the transaction history. This operation will scan the HD Path <b>0/*</b>, <b>1/*</b> and <b>*</b> from a starting index, until no UTXO are found in a whole gap limit.": "การสแกนชุด UTXO ช่วยให้คุณกู้คืนยอดคงเหลือในวอลเล็ตของคุณได้ แต่ไม่สามารถกู้คืนประวัติการทำธุรกรรมทั้งหมดได้ การดำเนินการนี้จะสแกน HD Path <b>0/*</b>, <b>1/*</b> และ <b>*</b> จากดัชนีเริ่มต",
  "Schedule install": "กำหนดการติดตั้ง",
  "Schedule transaction": "กำหนดเวลาธุรกรรม",
  "Schedule update": "กำหนดการอัปเดต",
  "Scope": "ขอบเขต",
  "Scripting": "การเขียนสคริปต์",
  "Search": "ค้นหา",
  "Search by email, external reference, name…": "ค้นหาด้วยอีเมล, การอ้างอิงภายนอก, ชื่อ...",
  "Search by email...": "ค้นหาด้วยอีเมล...",
  "Search by Id, Title or Amount...": "ค้นหาด้วย ID ชื่อ หรือจำนวนเงิน...",
  "Search engines can index this site": "เครื่องมือค้นหาสามารถจัดทำดัชนีเว็บไซต์นี้ได้",
  "Search…": "ค้นหา...",
  "seconds": "วินาที",
  "Secure your recovery phrase": "เก็บรักษาวลีกู้คืนของคุณให้ปลอดภัย",
  "Security device (FIDO2)": "อุปกรณ์รักษาความปลอดภัย (FIDO2)",
  "Security device name": "ชื่ออุปกรณ์รักษาความปลอดภัย",
  "Security devices": "อุปกรณ์รักษาความปลอดภัย",
  "See confidential seed information": "ดูข้อมูลซีดที่เป็นความลับ",
  "See information": "ดูข้อมูล",
  "See QR Code information by clicking": "ดูข้อมูล QR Code โดยการคลิก",
  "Seed information was already removed": "ข้อมูลซีดถูกลบออกแล้ว",
  "Seed removal failed": "การลบซีดล้มเหลว",
  "Seed successfully removed": "ลบ Seed สำเร็จแล้ว",
  "Segwit (Recommended, cheapest fee)": "Segwit (แนะนำ, ค่าธรรมเนียมถูกที่สุด)",
  "Segwit (Recommended)": "เซ็กวิท (แนะนำ)",
  "Segwit wrapped (Compatible with old wallets)": "เซ็กวิทแบบแรป (รองรับกระเป๋าเงินรุ่นเก่า)",
  "Select": "เลือก",
  "Select a field to edit": "เลือกฟิลด์ที่ต้องการแก้ไข",
  "Select a language to download from the community translation repository.": "เลือกภาษาที่จะดาวน์โหลดจากคลังการแปลของชุมชน",
  "Select a preset": "เลือกค่าที่กำหนดไว้ล่วงหน้า",
  "Select All": "เลือกทั้งหมด",
  "Select an existing offering": "เลือกรายการที่มีอยู่",
  "Select an item to edit": "เลือกรายการที่ต้องการแก้ไข",
  "Select default plan": "เลือกแผนเริ่มต้น",
  "Select existing offering": "เลือกข้อเสนอที่มีอยู่",
  "Select labels": "เลือกป้ายกำกับ",
  "Select Language": "เลือกภาษา",
  "Select offering": "เลือกข้อเสนอ",
  "Select plan": "เลือกแผน",
  "Select store": "เลือกร้านค้า",
  "Select Store": "เลือกร้านค้า",
  "Select the payout method used for refund": "เลือกวิธีการจ่ายเงินที่ใช้สำหรับการคืนเงิน",
  "Select the store to grant permission for": "เลือกร้านค้าเพื่อให้สิทธิ์การเข้าถึง",
  "Select this contribution perk": "เลือกสิทธิประโยชน์นี้",
  "Select your address type and account": "เลือกประเภทที่อยู่และบัญชีของคุณ",
  "selected": "เลือกแล้ว",
  "Send": "ส่ง",
  "Send {0}": "ส่ง {0}",
  "Send a <code>GET</code> request to <code>https://btcpay.example.com/invoices/{invoiceId}</code> with <code>Content-Type: application/json; Authorization: Basic YourLegacyAPIkey\"</code>, Legacy API key can be created with Access Tokens in Store settings": "ส่งคำขอ <code>GET</code> ไปที่ <code>https://btcpay.example.com/invoices/{invoiceId}</code> พร้อมกับ <code>Content-Type: application/json; Authorization: Basic YourLegacyAPIkey\"</code> Legacy API key สามารถสร้างได้ด้วย Access Tokens ในการตั้งค่าร้านค้า",
  "Send invitation email": "ส่งอีเมลคำเชิญ",
  "Send me everything": "ส่งให้ฉันทั้งหมด",
  "Send specific events": "ส่งเหตุการณ์เฉพาะ",
  "Send Test Email": "ส่งอีเมลทดสอบ",
  "Send the email to the buyer, if email was provided to the invoice": "ส่งอีเมลไปยังผู้ซื้อ หากมีการระบุอีเมลในใบแจ้งหนี้",
  "Send verification email": "ส่งอีเมลยืนยัน",
  "Sender's Email Address": "ที่อยู่อีเมลผู้ส่ง",
  "Server": "เซิร์ฟเวอร์",
  "Server Emails": "อีเมลเซิร์ฟเวอร์",
  "Server IPN": "เซิร์ฟเวอร์ IPN",
  "Server Name": "ชื่อเซิร์ฟเวอร์",
  "Server Settings": "การตั้งค่าเซิร์ฟเวอร์",
  "Server-wide": "ทั่วทั้งเซิร์ฟเวอร์",
  "Service": "บริการ",
  "Services": "บริการ",
  "Set a schedule for automated Lightning Network Payouts.": "ตั้งกำหนดการสำหรับการจ่ายเงินอัตโนมัติผ่านเครือข่าย Lightning",
  "Set a schedule for automated On-Chain Bitcoin Payouts.": "ตั้งกำหนดการสำหรับการจ่ายเงินบิตคอยน์แบบออนเชนอัตโนมัติ",
  "Set as default": "ตั้งเป็นค่าเริ่มต้น",
  "Set Password": "ตั้งรหัสผ่าน",
  "Set the translation to match the string in the fallback.": "ตั้งค่าการแปลให้ตรงกับข้อความในการสำรอง",
  "Set to default": "ตั้งค่าเป็นค่าเริ่มต้น",
  "Set to default settings": "ตั้งค่าเป็นค่าเริ่มต้น",
  "Set up a Lightning node": "ตั้งค่าโหนด Lightning",
  "Set up a wallet": "ตั้งค่ากระเป๋าเงิน",
  "Set your password": "ตั้งรหัสผ่านของคุณ",
  "Settings": "การตั้งค่า",
  "Settings saved": "บันทึกการตั้งค่าแล้ว",
  "Settings updated successfully": "อัปเดตการตั้งค่าเรียบร้อยแล้ว",
  "Settled": "ชำระเรียบร้อยแล้ว",
  "Settled Late": "ชำระล่าช้า",
  "Settled Over": "ชำระแล้ว",
  "Settled Partial": "ชำระบางส่วนแล้ว",
  "Setup {0} Wallet": "ตั้งค่ากระเป๋าเงิน {0}",
  "Setup Boltcard": "ตั้งค่า Boltcard",
  "Setup new wallet": "ตั้งค่ากระเป๋าเงินใหม่",
  "Shop Name": "ชื่อร้านค้า",
  "Shopify": "ช็อปปิฟาย",
  "Show \"Pay in wallet\" button": "แสดงปุ่ม \"ชำระในวอลเล็ต\"",
  "Show a timer … minutes before invoice expiration": "แสดงตัวจับเวลา ... นาทีก่อนใบแจ้งหนี้จะหมดอายุ",
  "Show all": "แสดงทั้งหมด",
  "Show coin selection": "แสดงการเลือกเหรียญ",
  "Show Confidential QR Code": "แสดงคิวอาร์โค้ดแบบเป็นความลับ",
  "Show current info": "แสดงข้อมูลปัจจุบัน",
  "Show export QR": "แสดง QR ส่งออก",
  "Show multi-sig examples": "แสดงตัวอย่างมัลติซิก",
  "Show plugins in pre-release": "แสดงปลั๊กอินในเวอร์ชันพรีรีลีส",
  "Show QR": "แสดง QR",
  "Show QR Code": "แสดงรหัส QR",
  "Show QR for wallet camera": "แสดง QR สำหรับกล้องของวอลเล็ต",
  "Show raw versions": "แสดงเวอร์ชันดิบ",
  "Show recommended fee": "แสดงค่าธรรมเนียมที่แนะนำ",
  "Show selected only": "แสดงที่เลือกเท่านั้น",
  "Show the payment list in the public receipt page": "แสดงรายการชำระเงินในหน้าใบเสร็จสาธารณะ",
  "Show the QR code of the receipt in the public receipt page": "แสดง QR code ของใบเสร็จในหน้าใบเสร็จสาธารณะ",
  "Show the store header": "แสดงส่วนหัวของร้านค้า",
  "Show unconfirmed coins": "แสดงเหรียญที่ยังไม่ได้รับการยืนยัน",
  "Show update info": "แสดงข้อมูลการอัปเดต",
  "Showing {0} – {1} of {2}": "แสดง {0} – {1} จาก {2}",
  "Showing {0} of {1}": "แสดง {0} จาก {1}",
  "Sign": "ลงชื่อ",
  "Sign in": "เข้าสู่ระบบ",
  "Sign PSBT": "เซ็น PSBT",
  "Sign the transaction": "เซ็นธุรกรรม",
  "Sign transaction": "เซ็นธุรกรรม",
  "Sign using our Vault application": "เซ็นชื่อโดยใช้แอปพลิเคชัน Vault ของเรา",
  "Signed out": "ออกจากระบบแล้ว",
  "SIN": "บาป",
  "Slider": "สไลเดอร์",
  "SMTP Server": "เซิร์ฟเวอร์ SMTP",
  "Softcap Goal": "เป้าหมายซอฟต์แคป",
  "Sold out": "สินค้าหมด",
  "Some of the files were not found": "ไม่พบไฟล์บางส่วน",
  "Some plugins were disabled due to fatal errors. They may be incompatible with this version of BTCPay Server.": "ปลั๊กอินบางตัวถูกปิดการใช้งานเนื่องจากข้อผิดพลาดร้ายแรง ปลั๊กอินเหล่านี้อาจไม่สามารถใช้งานร่วมกับ BTCPay Server เวอร์ชันนี้ได้",
  "Sort by": "เรียงตาม",
  "Sort by date ascending...": "เรียงตามวันที่จากน้อยไปมาก...",
  "Sort by date descending...": "เรียงตามวันที่จากมากไปน้อย...",
  "Sort by name ascending...": "เรียงตามชื่อจากน้อยไปมาก...",
  "Sort by name descending...": "เรียงตามชื่อจากมากไปน้อย...",
  "Sort contribution perks by popularity": "เรียงลำดับสิทธิประโยชน์ตามความนิยม",
  "Sound": "เสียง",
  "Sounds to play when a payment is made. One sound per line": "เสียงที่จะเล่นเมื่อมีการชำระเงิน หนึ่งเสียงต่อบรรทัด",
  "Source": "Please provide the English text that needs to be translated to Thai.",
  "Sources": "แหล่งที่มา",
  "Specify additional query string parameters that should be appended to the checkout page once the invoice is created. For example, <code>lang=da-DK</code> would load the checkout page in Danish by default.": "ระบุพารามิเตอร์สตริงคิวรี่เพิ่มเติมที่ควรเพิ่มเข้าไปในหน้าชำระเงินเมื่อสร้างใบแจ้งหนี้แล้ว ตัวอย่างเช่น <code>lang=da-DK</code> จะโหลดหน้าชำระเงินเป็นภาษาเดนมาร์กโดยค่าเริ",
  "Specify the amount and currency for the refund": "ระบุจำนวนเงินและสกุลเงินสำหรับการคืนเงิน",
  "SSH services are used by the maintenance operations.": "บริการ SSH ถูกใช้โดยการดำเนินการบำรุงรักษา",
  "SSH settings": "การตั้งค่า SSH",
  "Standalone mode, which can be used to generate invoices independent of payment requests or apps.": "โหมดสแตนด์อโลน ซึ่งสามารถใช้สร้างใบแจ้งหนี้ได้โดยไม่ขึ้นกับคำขอชำระเงินหรือแอปพลิเคชัน",
  "Start": "กรุณาให้ข้อความที่ต้องการแปล",
  "Start date": "วันที่เริ่มต้น",
  "Start Date": "วันที่เริ่มต้น",
  "Start scan": "เริ่มสแกน",
  "Starter plan monthly cost": "แผนเริ่มต้น ค่าบริการรายเดือน",
  "Starting index": "หน้าแรก",
  "Starts {0}": "เริ่ม {0}",
  "Status": "สถานะ",
  "Step": "ขั้นตอน",
  "Still due": "ยังค้างชำระ",
  "Stop Shopify calls and clear credentials": "หยุดการเรียก Shopify และล้างข้อมูลการรับรอง",
  "Storage Provider": "ผู้ให้บริการพื้นที่จัดเก็บข้อมูล",
  "Storage settings updated successfully": "อัปเดตการตั้งค่าพื้นที่จัดเก็บข้อมูลสำเร็จแล้ว",
  "Store": "ร้านค้า",
  "Store emails settings are now using the server's SMTP settings.": "การตั้งค่าอีเมลของร้านค้าใช้การตั้งค่า SMTP ของเซิร์ฟเวอร์แล้ว",
  "Store emails settings copied from server settings": "ตั้งค่าอีเมลร้านค้าคัดลอกมาจากการตั้งค่าเซิร์ฟเวอร์",
  "Store has not enabled Pay Button": "ร้านค้าไม่ได้เปิดใช้งานปุ่มชำระเงิน",
  "Store Id": "รหัสร้านค้า",
  "Store Name": "ชื่อร้านค้า",
  "Store Overview": "ภาพรวมร้านค้า",
  "Store removed successfully": "ลบร้านค้าสำเร็จแล้ว",
  "Store Settings": "การตั้งค่าร้านค้า",
  "Store successfully created": "สร้างร้านค้าสำเร็จแล้ว",
  "Store successfully updated": "อัปเดตร้านค้าสำเร็จแล้ว",
  "Store template created from store '{0}'. New stores will inherit these settings.": "สร้างเทมเพลตร้านค้าจากร้าน '{0}' ร้านค้าใหม่จะสืบทอดการตั้งค่าเหล่านี้",
  "Store template successfully unset": "ยกเลิกการตั้งค่าเทมเพลตร้านค้าเรียบร้อยแล้ว",
  "Store Users": "ผู้ใช้ร้านค้า",
  "Store Website": "เว็บไซต์ร้านค้า",
  "Store-based permissions will be applied for": "จะมีการใช้สิทธิ์ตามร้านค้า",
  "Store-level": "ระดับร้านค้า",
  "Store: {0}": "ร้านค้า: {0}",
  "Stores": "ร้านค้า",
  "Subject": "หัวข้อ",
  "Submit": "ส่ง",
  "Subscriber": "สมาชิก",
  "Subscriber '{0}' successfully created": "สร้างผู้สมัครสมาชิก '{0}' สำเร็จแล้ว",
  "Subscriber {0} has been charged": "สมาชิก {0} ถูกเรียกเก็บเงินแล้ว",
  "Subscriber {0} has been credited": "สมาชิก {0} ได้รับเครดิตแล้ว",
  "Subscriber {0} is now {1}": "สมาชิก {0} ตอนนี้เป็น {1}",
  "Subscriber {0} is now suspended": "สมาชิก {0} ถูกระงับการใช้งานแล้ว",
  "Subscriber {0} is now unsuspended": "สมาชิก {0} ถูกยกเลิกการระงับแล้ว",
  "Subscribers": "สมาชิก",
  "Subscriptions": "การสมัครสมาชิก",
  "Subtotal": "ยอดรวมย่อย",
  "Subtract fees from amount": "หักค่าธรรมเนียมจากจำนวนเงิน",
  "Success redirect url": "URL สำหรับการเปลี่ยนเส้นทางเมื่อสำเร็จ",
  "Successfully planned a redelivery": "วางแผนการจัดส่งใหม่สำเร็จแล้ว",
  "Support URL": "URL สนับสนุน",
  "Supported by BlueWallet, Cobo Vault, Passport and Specter DIY": "รองรับโดย BlueWallet, Cobo Vault, Passport และ Specter DIY",
  "Supported Transaction Currencies": "สกุลเงินที่รองรับสำหรับการทำธุรกรรม",
  "Suspend": "ระงับ",
  "Suspend Access": "ระงับการเข้าถึง",
  "Suspend Subscriber": "ระงับสมาชิก",
  "Suspended": "ระงับแล้ว",
  "Suspension Reason": "เหตุผลการระงับ",
  "Switch date format": "เปลี่ยนรูปแบบวันที่",
  "Syntax error": "ข้อผิดพลาดทางไวยากรณ์",
  "System": "ระบบ",
  "Taproot": "แทปรูท",
  "Taproot (For advanced users)": "Taproot (สำหรับผู้ใช้ขั้นสูง)",
  "Target Amount": "จำนวนเป้าหมาย",
  "Tax": "ภาษี",
  "Tax rate": "อัตราภาษี",
  "Taxes": "ภาษี",
  "Template": "เทมเพลต",
  "Template JSON": "เทมเพลต JSON",
  "Templates": "เทมเพลต",
  "Test": "ทดสอบ",
  "Test connection": "ทดสอบการเชื่อมต่อ",
  "Test Email": "ทดสอบอีเมล",
  "Test Results:": "ผลการทดสอบ:",
  "Testing": "การทดสอบ",
  "Text": "Please provide the English text you would like me to translate to Thai.",
  "Text to display in the tip input": "ข้อความที่จะแสดงในช่องกรอกทิป",
  "Text to display on buttons allowing the user to enter a custom amount": "ใส่จำนวนเงินเอง",
  "Text to display on each button for items with a specific price": "ข้อความที่จะแสดงบนแต่ละปุ่มสำหรับรายการที่มีราคาเฉพาะ",
  "Thank you for your purchase. Here is your receipt": "ขอบคุณสำหรับการซื้อ นี่คือใบเสร็จของคุณ",
  "Thank you!": "ขอบคุณ!",
  "The {0} offers programmatic access to your instance. You can manage your BTCPay Server (e.g. stores, invoices, users) as well as automate workflows and integrations (see {1}). For that you need the API keys, which can be generated here. Find more information in the {2}.": "{0} ให้การเข้าถึงแบบโปรแกรมไปยังอินสแตนซ์ของคุณ คุณสามารถจัดการ BTCPay Server ของคุณ (เช่น ร้านค้า ใบแจ้งหนี้ ผู้ใช้) รวมถึงระบบอัตโนมัติของเวิร์กโฟลว์และการผสานรวม (ดูที่ {1}) สำ",
  "The <code>macaroon</code> parameter expects the HEX value, it can be obtained using this\n                                command:": "พารามิเตอร์ <code>macaroon</code> ต้องการค่า HEX ซึ่งสามารถรับได้โดยใช้คำสั่งนี้:",
  "The access key of the service is not set": "ไม่ได้ตั้งค่าคีย์การเข้าถึงของบริการ",
  "The access token will be revoked. Do you wish to continue?": "โทเค็นการเข้าถึงจะถูกเพิกถอน คุณต้องการดำเนินการต่อหรือไม่?",
  "The admin {0} will be permanently deleted. This action will also delete all accounts, users and data associated with the server account. Are you sure?": "ผู้ดูแลระบบ {0} จะถูกลบอย่างถาวร การดำเนินการนี้จะลบบัญชีทั้งหมด ผู้ใช้ และข้อมูลที่เกี่ยวข้องกับบัญชีเซิร์ฟเวอร์ คุณแน่ใจหรือไม่?",
  "The amount should be more than zero": "จำนวนเงินควรมากกว่าศูนย์",
  "The app <strong>{0}</strong> and its settings will be permanently deleted.": "แอป <strong>{0}</strong> และการตั้งค่าทั้งหมดจะถูกลบอย่างถาวร",
  "The app has been archived and will no longer appear in the apps list by default.": "แอปถูกเก็บถาวรแล้วและจะไม่แสดงในรายการแอปตามค่าเริ่มต้นอีกต่อไป",
  "The app has been unarchived and will appear in the apps list by default again.": "แอปได้ถูกยกเลิกการเก็บถาวรแล้วและจะปรากฏในรายการแอปตามค่าเริ่มต้นอีกครั้ง",
  "The batch size make sure the scan do not consume too much RAM at once by rescanning several time with smaller subset of addresses.": "ขนาดแบตช์จะช่วยให้แน่ใจว่าการสแกนไม่ใช้แรมมากเกินไปในครั้งเดียว โดยทำการสแกนซ้ำหลายครั้งด้วยกลุ่มที่อยู่ขนาดเล็กลง",
  "The brand color needs to be a valid hex color code": "สีแบรนด์จะต้องเป็นรหัสสี hex ที่ถูกต้อง",
  "The card is now configured": "บัตรได้รับการตั้งค่าแล้ว",
  "The change output is too small to pay for additional fee.": "การเปลี่ยนแปลงเอาต์พุตมีจำนวนน้อยเกินไปที่จะจ่ายค่าธรรมเนียมเพิ่มเติม",
  "The change output is too small to pay for additional fee. (Missing {0} BTC)": "การเปลี่ยนแปลงเอาต์พุตมีค่าน้อยเกินไปที่จะจ่ายค่าธรรมเนียมเพิ่มเติม (ขาด {0} BTC)",
  "The chosen field's selected value will be copied to this field upon submission.": "ค่าที่เลือกจากฟิลด์ที่กำหนดจะถูกคัดลอกมายังฟิลด์นี้เมื่อทำการส่ง",
  "The combination of words below are called your recovery phrase. The recovery phrase allows you to access and restore your wallet. Write them down on a piece of paper in the exact order:": "คำที่รวมกันด้านล่างนี้เรียกว่าวลีกู้คืนของคุณ วลีกู้คืนช่วยให้คุณเข้าถึงและกู้คืนวอลเล็ตของคุณได้ จดบันทึกลงบนกระดาษตามลำดับที่แสดง:",
  "The configured name means the value of this field will adjust the invoice amount by multiplying it for public forms and the point of sale app.": "ชื่อที่กำหนดค่าไว้หมายถึงค่าของฟิลด์นี้จะปรับจำนวนเงินในใบแจ้งหนี้โดยการคูณสำหรับฟอร์มสาธารณะและแอปจุดขาย",
  "The configured name means the value of this field will adjust the invoice amount for public forms and the point of sale app.": "ชื่อที่กำหนดค่าไว้หมายถึงค่าของฟิลด์นี้จะปรับจำนวนเงินในใบแจ้งหนี้สำหรับฟอร์มสาธารณะและแอปจุดขาย",
  "The configured name means the value of this field will determine the invoice amount for public forms.": "ชื่อที่กำหนดค่าไว้หมายถึงค่าของฟิลด์นี้จะเป็นตัวกำหนดจำนวนเงินในใบแจ้งหนี้สำหรับแบบฟอร์มสาธารณะ",
  "The configured name means the value of this field will determine the invoice currency for public forms.": "ชื่อที่กำหนดค่าไว้หมายถึงค่าของฟิลด์นี้จะเป็นตัวกำหนดสกุลเงินของใบแจ้งหนี้สำหรับแบบฟอร์มสาธารณะ",
  "The credentials and server address are shown as a <code>lndhub://</code> URL on the\n                                \"Export/Backup\" screen in BlueWallet.": "ข้อมูลประจำตัวและที่อยู่เซิร์ฟเวอร์จะแสดงเป็น URL แบบ <code>lndhub://</code> บนหน้าจอ \"ส่งออก/สำรองข้อมูล\" ใน BlueWallet",
  "The crowdfund will be visible to anyone.": "กองทุนสาธารณะนี้จะสามารถมองเห็นได้โดยทุกคน",
  "The crypto currency amount that was overpaid.": "จำนวนเงินคริปโตที่จ่ายเกินมา",
  "The crypto currency price, at the current rate.": "ราคาสกุลเงินคริปโต ณ อัตราปัจจุบัน",
  "The crypto currency price, at the rate the invoice got paid.": "ราคาสกุลเงินคริปโต ณ อัตราที่ใบแจ้งหนี้ได้รับการชำระ",
  "The currency to generate the invoice in when generated through this lightning address": "สกุลเงินที่จะใช้สร้างใบแจ้งหนี้เมื่อสร้างผ่านที่อยู่ไลท์นิง",
  "The custom color, logo and CSS are applied on the public/customer-facing pages (Invoice, Payment Request, Pull Payment, etc.). The brand color is used as the accent color for buttons, links, etc. It might get adapted to fit the light/dark color scheme.": "การปรับแต่งสี โลโก้ และ CSS จะถูกนำไปใช้กับหน้าเว็บที่แสดงต่อสาธารณะ/ลูกค้า (อินวอยซ์ คำขอชำระเงิน การเบิกจ่าย ฯลฯ) สีแบรนด์จะถูกใช้เป็นสีเน้นสำหรับปุ่ม ลิงก์ และอ",
  "The device has not been initialized.": "อุปกรณ์ยังไม่ได้เริ่มต้นการทำงาน",
  "The DNS record has been refreshed:": "บันทึก DNS ได้รับการรีเฟรชแล้ว:",
  "The Dynamic DNS has been successfully queried, your configuration is saved": "ระบบ Dynamic DNS ได้รับการสอบถามสำเร็จแล้ว การตั้งค่าของคุณถูกบันทึกแล้ว",
  "The Dynamic DNS service has been disabled": "บริการ Dynamic DNS ถูกปิดใช้งาน",
  "The email address is already in use with an other account.": "ที่อยู่อีเมลนี้ถูกใช้งานกับบัญชีอื่นแล้ว",
  "The Email settings have not been configured on this server or store yet. Setting this field will not send emails until then.": "การตั้งค่าอีเมลยังไม่ได้ถูกกำหนดค่าบนเซิร์ฟเวอร์หรือร้านค้านี้ การตั้งค่าฟิลด์นี้จะไม่ส่งอีเมลจนกว่าจะมีการตั้งค่า",
  "The endpoint receiving the payload must validate the payload by checking that the HTTP header <code>BTCPAY-SIG</code> of the callback matches the HMAC256 of the secret on the payload's body bytes.": "จุดสิ้นสุดที่ได้รับเพย์โหลดจะต้องตรวจสอบความถูกต้องของเพย์โหลดโดยการตรวจสอบว่าส่วนหัว HTTP <code>BTCPAY-SIG</code> ของการเรียกกลับตรงกับ HMAC256 ของรหัสลับบนไบต์เนื้อหาของเพย์โหลด",
  "The following methods assume that you already have an existing wallet created and backed up.": "วิธีการต่อไปนี้ตั้งอยู่บนสมมติฐานว่าคุณมีวอลเล็ตที่สร้างและสำรองข้อมูลไว้แล้ว",
  "The full node is not synched": "โหนดเต็มไม่ได้ซิงค์",
  "The full node is synched": "โหนดเต็มรูปแบบซิงค์เรียบร้อยแล้ว",
  "The hardware wallet requires previous transactions in the PSBT. Please go to your wallet settings and enable \"Include non-witness UTXO in PSBTs": "ฮาร์ดแวร์วอลเล็ตต้องการธุรกรรมก่อนหน้าใน PSBT กรุณาไปที่การตั้งค่าวอลเล็ตของคุณและเปิดใช้งาน \"Include non-witness UTXO in PSBTs\"",
  "The invoice currency, at the rate when the refund will be sent.": "สกุลเงินของใบแจ้งหนี้ ณ อัตราแลกเปลี่ยนในขณะที่จะทำการคืนเงิน",
  "The invoice has been archived and will no longer appear in the invoice list by default.": "ใบแจ้งหนี้ถูกเก็บถาวรแล้วและจะไม่ปรากฏในรายการใบแจ้งหนี้โดยค่าเริ่มต้น",
  "The invoice has been unarchived and will appear in the invoice list by default again.": "ใบแจ้งหนี้ถูกยกเลิกการเก็บถาวรแล้วและจะปรากฏในรายการใบแจ้งหนี้ตามค่าเริ่มต้นอีกครั้ง",
  "The label {0} will be deleted from all payment requests.": "ป้ายชื่อ {0} จะถูกลบออกจากคำขอชำระเงินทั้งหมด",
  "The label {0} will be removed from this wallet and its associated transactions.": "ป้ายกำกับ {0} จะถูกลบออกจากวอลเล็ตนี้และธุรกรรมที่เกี่ยวข้อง",
  "The label could not be deleted.": "ไม่สามารถลบป้ายกำกับได้",
  "The label could not be renamed.": "ไม่สามารถเปลี่ยนชื่อป้ายกำกับได้",
  "The label has been successfully deleted.": "ลบป้ายกำกับเรียบร้อยแล้ว",
  "The label has been successfully renamed.": "เปลี่ยนชื่อป้ายกำกับเรียบร้อยแล้ว",
  "The Lightning node could not be registered.": "ไม่สามารถลงทะเบียนโหนด Lightning ได้",
  "The LND seed backup is useful to recover on-chain funds of your LND wallet in case of a corruption of your server.": "การสำรองข้อมูล LND seed มีประโยชน์ในการกู้คืนเงินบนเชนของวอลเล็ต LND ของคุณในกรณีที่เซิร์ฟเวอร์ของคุณเสียหาย",
  "The name of the field in the invoice's metadata.": "ชื่อฟิลด์ในเมตาดาต้าของใบแจ้งหนี้",
  "The name should be maximum 50 characters.": "ชื่อต้องมีความยาวไม่เกิน 50 ตัวอักษร",
  "The node is offline": "โหนดออฟไลน์",
  "The node is starting...": "โหนดกำลังเริ่มทำงาน...",
  "The node is synchronized (Height: {0})": "โหนดถูกซิงโครไนซ์แล้ว (ความสูง: {0})",
  "The old docker images will be cleaned soon...": "ภาพ docker เก่าจะถูกล้างในเร็วๆ นี้...",
  "The password is the <code>http-password</code> generated in your <code>~/.phoenix/phoenix.conf</code> file.": "รหัสผ่านคือ <code>http-password</code> ที่ถูกสร้างขึ้นในไฟล์ <code>~/.phoenix/phoenix.conf</code> ของคุณ",
  "The path to the LND data directory may vary, the following examples assume <code>/root/.lnd</code>.": "เส้นทางไปยังไดเรกทอรีข้อมูล LND อาจแตกต่างกันไป ตัวอย่างต่อไปนี้จะใช้ <code>/root/.lnd</code>",
  "The payjoin receiver could not complete the payjoin: {0}": "ผู้รับ payjoin ไม่สามารถดำเนินการ payjoin ให้เสร็จสมบูรณ์ได้: {0}",
  "The payment request has been archived and will no longer appear in the payment request list by default again.": "คำขอการชำระเงินได้ถูกเก็บถาวรแล้วและจะไม่ปรากฏในรายการคำขอการชำระเงินโดยค่าเริ่มต้นอีกต่อไป",
  "The payment request has been unarchived and will appear in the payment request list by default.": "คำขอการชำระเงินได้ถูกยกเลิกการเก็บถาวรแล้วและจะปรากฏในรายการคำขอการชำระเงินตามค่าเริ่มต้น",
  "The plan has been started.": "แผนได้เริ่มต้นแล้ว",
  "The plan has been started. ({0} has been refunded)": "แผนได้เริ่มต้นแล้ว ({0} ได้รับการคืนเงินแล้ว)",
  "The plugin could not be downloaded. Try again later.": "ไม่สามารถดาวน์โหลดปลั๊กอินได้ กรุณาลองใหม่อีกครั้งในภายหลัง",
  "The preferred link to this server. This is typically used when BTCPay Server is generating an email containing a link which should point to this server.": "ลิงก์ที่ต้องการไปยังเซิร์ฟเวอร์นี้ โดยทั่วไปจะใช้เมื่อ BTCPay Server กำลังสร้างอีเมลที่มีลิงก์ซึ่งควรชี้ไปที่เซิร์ฟเวอร์นี้",
  "The previous scan completed and found <b>{0}</b> UTXOs in <b>{1}</b> (The total UTXO set size is {2})": "การสแกนก่อนหน้านี้เสร็จสมบูรณ์และพบ <b>{0}</b> UTXOs ใน <b>{1}</b> (ขนาดชุด UTXO ทั้งหมดคือ {2})",
  "The previous scan stopped with an error:": "การสแกนก่อนหน้าหยุดทำงานเนื่องจากเกิดข้อผิดพลาด:",
  "The provided BIP21 payment URI was malformed": "URI การชำระเงิน BIP21 ที่ให้มาไม่ถูกต้องตามรูปแบบ",
  "The rates of those currencies, in addition to the default currency, will be recorded when a new invoice is created. The rates will then be accessible through reports.": "อัตราแลกเปลี่ยนของสกุลเงินเหล่านั้น รวมถึงสกุลเงินเริ่มต้น จะถูกบันทึกเมื่อมีการสร้างใบแจ้งหนี้ใหม่ จากนั้นจะสามารถเข้าถึงอัตราแลกเปลี่ยนได้ผ่านรายงาน",
  "The recommended price source gets chosen based on the default currency.": "แหล่งที่มาของราคาที่แนะนำจะถูกเลือกตามสกุลเงินเริ่มต้น",
  "The recovery phrase is a backup that allows you to restore your wallet in case of a server crash.": "วลีกู้คืน (Recovery Phrase) เป็นการสำรองข้อมูลที่ช่วยให้คุณสามารถกู้คืนวอลเล็ตของคุณได้ในกรณีที่เซิร์ฟเวอร์ล่ม",
  "The recovery phrase will also be stored on the server as a hot wallet.": "วลีกู้คืนจะถูกเก็บไว้บนเซิร์ฟเวอร์ในรูปแบบฮอตวอลเล็ต",
  "The recovery phrase will be permanently erased from the server.": "วลีกู้คืนจะถูกลบออกจากเซิร์ฟเวอร์อย่างถาวร",
  "The role of {0} has been changed to {1}.": "บทบาทของ {0} ได้ถูกเปลี่ยนเป็น {1}",
  "The script language is composed of several rules composed of a currency pair and a mathematical expression. The\n                            example below will use <code>kraken</code> for both <code>LTC_USD</code> and <code>BTC_USD</code> pairs.": "ภาษาสคริปต์ประกอบด้วยกฎหลายข้อที่ประกอบด้วยคู่สกุลเงินและนิพจน์ทางคณิตศาสตร์ ตัวอย่างด้านล่างจะใช้ <code>kraken</code> สำหรับทั้งคู่ <code>LTC_USD</code> และ <code>BTC_USD</code>",
  "The security device could not be registered.": "ไม่สามารถลงทะเบียนอุปกรณ์ความปลอดภัยได้",
  "The security device was registered successfully.": "อุปกรณ์รักษาความปลอดภัยได้รับการลงทะเบียนเรียบร้อยแล้ว",
  "The security device was removed successfully.": "อุปกรณ์รักษาความปลอดภัยถูกลบออกเรียบร้อยแล้ว",
  "The seed was not found": "ไม่พบ seed",
  "The selected fee rate is too small. The minimum is {0} sat/byte": "อัตราค่าธรรมเนียมที่เลือกต่ำเกินไป ขั้นต่ำคือ {0} แซท/ไบต์",
  "The server might restart soon if an update is available... (this page won't reload automatically)": "เซิร์ฟเวอร์อาจจะรีสตาร์ทเร็วๆ นี้หากมีการอัปเดตใหม่... (หน้านี้จะไม่รีโหลดอัตโนมัติ)",
  "The specified amount with the specified currency, at the rate when the refund will be sent.": "จำนวนเงินที่ระบุพร้อมสกุลเงินที่กำหนด ตามอัตราแลกเปลี่ยน ณ เวลาที่จะทำการคืนเงิน",
  "The store <strong>{0}</strong> will be permanently deleted. This action will also delete all invoices, apps and data associated with the store.": "ร้านค้า <strong>{0}</strong> จะถูกลบอย่างถาวร การดำเนินการนี้จะลบใบแจ้งหนี้ แอปพลิเคชัน และข้อมูลทั้งหมดที่เกี่ยวข้องกับร้านค้านี้",
  "The store template sets defaults for all new stores. It includes rates settings, default invoice settings, checkout display settings but excludes sensitive data like access tokens, payment method settings, webhooks.": "เทมเพลตร้านค้าจะกำหนดค่าเริ่มต้นสำหรับร้านค้าใหม่ทั้งหมด ซึ่งรวมถึงการตั้งค่าอัตราแลกเปลี่ยน การตั้งค่าใบแจ้งหนี้เริ่มต้น การตั้งค่าการแสดงผลการชำระเงิน แต่ไม่รวมข",
  "The store will be permanently deleted. This action will also delete all invoices, apps and data associated with the store.": "ร้านค้าจะถูกลบอย่างถาวร การดำเนินการนี้จะลบใบแจ้งหนี้ แอปพลิเคชัน และข้อมูลทั้งหมดที่เกี่ยวข้องกับร้านค้า",
  "The store will be permanently deleted. This action will also delete all invoices, apps and data associated with the store. Are you sure?": "ร้านค้าจะถูกลบอย่างถาวร การดำเนินการนี้จะลบใบแจ้งหนี้ แอปพลิเคชัน และข้อมูลทั้งหมดที่เกี่ยวข้องกับร้านค้า คุณแน่ใจหรือไม่?",
  "The trial has started.": "การทดลองได้เริ่มต้นแล้ว",
  "The uploaded file needs to be a CSS file": "ไฟล์ที่อัปโหลดต้องเป็นไฟล์ CSS",
  "The uploaded file needs to be an image": "ไฟล์ที่อัปโหลดต้องเป็นรูปภาพ",
  "The uploaded file should be less than {0}": "ไฟล์ที่อัปโหลดควรมีขนาดน้อยกว่า {0}",
  "The uploaded sound file needs to be an audio file": "ไฟล์เสียงที่อัปโหลดต้องเป็นไฟล์เสียงเท่านั้น",
  "The uploaded sound file should be less than {0}": "ไฟล์เสียงที่อัปโหลดควรมีขนาดน้อยกว่า {0}",
  "The URL to post purchase data.": "URL สำหรับส่งข้อมูลการซื้อ",
  "The user could not be added: {0}": "ไม่สามารถเพิ่มผู้ใช้ได้: {0}",
  "The user could not be invited: {0}": "ไม่สามารถเชิญผู้ใช้ได้: {0}",
  "The user could not be updated: {0}": "ไม่สามารถอัปเดตผู้ใช้ได้: {0}",
  "The user declined access to the vault.": "ผู้ใช้ปฏิเสธการเข้าถึงตู้นิรภัย",
  "The user has been added successfully.": "เพิ่มผู้ใช้งานเรียบร้อยแล้ว",
  "The user has been updated successfully.": "อัปเดตผู้ใช้เรียบร้อยแล้ว",
  "The user will be permanently deleted. This action will also delete all stores, invoices, apps and data associated with your user.": "ผู้ใช้จะถูกลบอย่างถาวร การดำเนินการนี้จะลบร้านค้า ใบแจ้งหนี้ แอปพลิเคชัน และข้อมูลทั้งหมดที่เกี่ยวข้องกับผู้ใช้ของคุณ",
  "The user will not be able to change the field's value": "ผู้ใช้จะไม่สามารถเปลี่ยนค่าของฟิลด์นี้ได้",
  "The values being mirrored from another field will be mapped to another value if configured.": "ค่าที่ถูกสะท้อนมาจากฟิลด์อื่นจะถูกแมปไปยังค่าอื่นหากมีการกำหนดค่าไว้",
  "The wallet has been successfully pruned ({0} transactions have been removed from the history)": "กระเป๋าเงินถูกตัดทอนเรียบร้อยแล้ว (ธุรกรรมจำนวน {0} รายการถูกลบออกจากประวัติ)",
  "The wallet is already pruned": "วอลเล็ตถูกตัดแต่งแล้ว",
  "The webhook has been created": "สร้างเว็บฮุคเรียบร้อยแล้ว",
  "The webhook has been updated": "อัปเดตเว็บฮุคแล้ว",
  "Theme": "ธีม",
  "There are many subscribers, use search to look for them.": "มีผู้สมัครสมาชิกจำนวนมาก โปรดใช้การค้นหาเพื่อดูรายชื่อ",
  "There are no {0} pull payments yet.": "ยังไม่มีการดึงการชำระเงิน {0}",
  "There are no apps yet.": "ยังไม่มีแอปพลิเคชัน",
  "There are no associated permissions to the API key being requested by the application. The application cannot do anything with your BTCPay Server account other than validating your account exists.": "แอปพลิเคชันไม่มีสิทธิ์ที่เกี่ยวข้องกับ API key ที่ร้องขอ แอปพลิเคชันไม่สามารถดำเนินการใดๆ กับบัญชี BTCPay Server ของคุณได้ นอกจากการตรวจสอบว่าบัญชีของคุณมีอยู่จริง",
  "There are no custom labels yet. You can create custom labels by assigning them to your {0}.": "ยังไม่มีป้ายกำกับที่กำหนดเอง คุณสามารถสร้างป้ายกำกับที่กำหนดเองได้โดยกำหนดให้กับ {0} ของคุณ",
  "There are no dynamic DNS services yet.": "ยังไม่มีบริการ DNS แบบไดนามิก",
  "There are no email rules for this offering.": "ไม่มีกฎการใช้อีเมลสำหรับข้อเสนอนี้",
  "There are no files yet.": "ยังไม่มีไฟล์",
  "There are no forms yet.": "ยังไม่มีแบบฟอร์ม",
  "There are no invoices matching your criteria.": "ไม่พบใบแจ้งหนี้ที่ตรงตามเงื่อนไขของคุณ",
  "There are no items in your cart yet.": "ยังไม่มีสินค้าในตะกร้าของคุณ",
  "There are no Lightning Addresses yet.": "ยังไม่มี Lightning Address",
  "There are no notifications.": "ไม่มีการแจ้งเตือน",
  "There are no payment methods available to provide refunds with for this invoice.": "ไม่มีวิธีการชำระเงินที่สามารถใช้คืนเงินสำหรับใบแจ้งหนี้นี้",
  "There are no payment requests matching your criteria.": "ไม่พบคำขอการชำระเงินที่ตรงตามเกณฑ์ของคุณ",
  "There are no payouts matching these criteria.": "ไม่พบรายการจ่ายเงินที่ตรงตามเกณฑ์เหล่านี้",
  "There are no processors available.": "ไม่มีตัวประมวลผลที่พร้อมใช้งาน",
  "There are no recent invoices.": "ไม่มีใบแจ้งหนี้ล่าสุด",
  "There are no recent transactions.": "ไม่มีธุรกรรมล่าสุด",
  "There are no rules yet.": "ยังไม่มีกฎที่กำหนดไว้",
  "There are no stores yet.": "ยังไม่มีร้านค้า",
  "There are no subscribers.": "ไม่มีผู้สมัครสมาชิก",
  "There are no subscription plans.": "ไม่มีแผนการสมัครสมาชิก",
  "There are no wallets yet. You can add wallets in the store setup.": "ยังไม่มีวอลเล็ตอยู่ในระบบ คุณสามารถเพิ่มวอลเล็ตได้ในการตั้งค่าร้านค้า",
  "There are no webhooks yet.": "ยังไม่มีเว็บฮุค",
  "There isn't any UTXO available to bump fee with CPFP": "ไม่มี UTXO ที่พร้อมใช้สำหรับการเพิ่มค่าธรรมเนียมด้วย CPFP",
  "There was an error generating your wallet: {0}": "เกิดข้อผิดพลาดในการสร้างวอลเล็ตของคุณ: {0}",
  "These translations are maintained by the community at": "การแปลเหล่านี้ได้รับการดูแลโดยชุมชนที่",
  "This account has been locked out because of multiple invalid login attempts. Please try again later.": "บัญชีนี้ถูกล็อคเนื่องจากมีการพยายามเข้าสู่ระบบที่ไม่ถูกต้องหลายครั้ง กรุณาลองใหม่อีกครั้งในภายหลัง",
  "This account has been locked out. Please try again": "บัญชีนี้ถูกล็อค กรุณาลองใหม่อีกครั้ง",
  "This action is permanent and will remove the ability to change the SSH settings via the BTCPay Server user interface.": "การดำเนินการนี้เป็นการถาวรและจะลบความสามารถในการเปลี่ยนการตั้งค่า SSH ผ่านส่วนติดต่อผู้ใช้ของ BTCPay Server",
  "This action will also delete all stores, invoices, apps and data associated with the user.": "การดำเนินการนี้จะลบร้านค้า ใบแจ้งหนี้ แอปพลิเคชัน และข้อมูลทั้งหมดที่เกี่ยวข้องกับผู้ใช้",
  "This action will delete your rate script. Are you sure to turn off rate rules scripting?": "การดำเนินการนี้จะลบสคริปต์อัตราแลกเปลี่ยนของคุณ คุณแน่ใจหรือไม่ที่จะปิดการใช้งานสคริปต์กฎอัตราแลกเปลี่ยน?",
  "This action will modify your current rate sources. Are you sure to turn on rate rules scripting? (Advanced users)": "การดำเนินการนี้จะเปลี่ยนแปลงแหล่งที่มาของอัตราแลกเปลี่ยนปัจจุบันของคุณ คุณแน่ใจหรือไม่ที่จะเปิดใช้งานการเขียนสคริปต์กฎอัตราแลกเปลี่ยน? (สำหรับผู้ใช้ขั้นสูง)",
  "This action will permanently delete your LND seed and password. You will not be able to recover them if you don't have a backup.": "การดำเนินการนี้จะลบซีดและรหัสผ่าน LND ของคุณอย่างถาวร คุณจะไม่สามารถกู้คืนได้หากคุณไม่มีการสำรองข้อมูล",
  "This action will permanently delete your LND seed and password. You will not be able to recover them if you don't have a backup. Are you sure?": "การดำเนินการนี้จะลบ seed และรหัสผ่าน LND ของคุณอย่างถาวร คุณจะไม่สามารถกู้คืนได้หากคุณไม่มีการสำรองข้อมูล คุณแน่ใจหรือไม่?",
  "This action will prevent {0} from accessing this store and its settings.": "การดำเนินการนี้จะป้องกันไม่ให้ {0} เข้าถึงร้านค้านี้และการตั้งค่าต่างๆ",
  "This action will prevent the user from accessing this store and its settings. Are you sure?": "การดำเนินการนี้จะป้องกันไม่ให้ผู้ใช้เข้าถึงร้านค้านี้และการตั้งค้าต่างๆ คุณแน่ใจหรือไม่?",
  "This action will remove the plan <b>{0}</b>.": "การดำเนินการนี้จะลบแผน <b>{0}</b>",
  "This action will remove the rule with the trigger <b>{0}</b>.": "การดำเนินการนี้จะลบกฎที่มีตัวกระตุ้น <b>{0}</b>",
  "This action will remove this plan. Are you sure?": "การดำเนินการนี้จะลบแผนนี้ออก คุณแน่ใจหรือไม่?",
  "This action will remove this rule. Are you sure?": "การดำเนินการนี้จะลบกฎนี้ คุณแน่ใจหรือไม่?",
  "This app will be removed from this store.": "แอปนี้จะถูกลบออกจากร้านค้า",
  "This can be overridden at the Store level.": "สามารถแทนที่ได้ในระดับร้านค้า",
  "This card is already configured for another issuer": "บัตรนี้ถูกกำหนดค่าสำหรับผู้ออกรายอื่นแล้ว",
  "This card is already in a factory state": "บัตรนี้อยู่ในสถานะโรงงานอยู่แล้ว",
  "This card is already properly configured": "บัตรนี้ได้รับการตั้งค่าอย่างถูกต้องแล้ว",
  "This crowdfund page is not publicly viewable!": "หน้าระดมทุนนี้ไม่สามารถดูได้อย่างเปิดเผย!",
  "This device already signed PSBT.": "อุปกรณ์นี้ได้ลงนาม PSBT แล้ว",
  "This device can't sign the transaction. (The wallet keypath in your wallet settings seems incorrect)": "อุปกรณ์นี้ไม่สามารถลงนามธุรกรรมได้ (ดูเหมือนว่า keypath ในการตั้งค่าวอลเล็ทของคุณไม่ถูกต้อง)",
  "This dictionary will be removed from this server.": "พจนานุกรมนี้จะถูกลบออกจากเซิร์ฟเวอร์นี้",
  "This feature is disabled": "คุณสมบัตินี้ถูกปิดใช้งาน",
  "This feature is only available to BTC wallets": "คุณสมบัตินี้มีให้ใช้งานสำหรับวอลเล็ต BTC เท่านั้น",
  "This full node does not support rescan of the UTXO set": "โหนดเต็มนี้ไม่รองรับการสแกน UTXO เซ็ตใหม่",
  "This full node support rescan of the UTXO set": "โหนดแบบเต็มนี้รองรับการสแกนชุด UTXO ใหม่",
  "this guide": "คู่มือนี้",
  "This invoice got overpaid.": "ใบแจ้งหนี้นี้ได้รับการชำระเงินเกินจำนวน",
  "This invoice has been paid": "ใบแจ้งหนี้นี้ได้ชำระเงินแล้ว",
  "This invoice has expired": "ใบแจ้งหนี้นี้หมดอายุแล้ว",
  "This is an extremely dangerous operation!": "นี่เป็นการดำเนินการที่อันตรายอย่างยิ่ง!",
  "This is an overpayment of the initial amount.": "นี่คือการชำระเงินเกินจากจำนวนเงินเริ่มต้น",
  "This is the only admin, so their role can't be removed until another admin is added.": "นี่คือผู้ดูแลระบบคนเดียว ดังนั้นจึงไม่สามารถลบบทบาทออกได้จนกว่าจะเพิ่มผู้ดูแลระบบคนอื่น",
  "This key, also called \"xpub\", is used to generate individual destination addresses for your invoices.": "คีย์นี้ หรือที่เรียกว่า \"xpub\" ใช้สำหรับสร้างที่อยู่ปลายทางแต่ละรายการสำหรับใบแจ้งหนี้ของคุณ",
  "This label cannot be deleted.": "ไม่สามารถลบป้ายกำกับนี้ได้",
  "This label cannot be renamed.": "ไม่สามารถเปลี่ยนชื่อป้ายกำกับนี้ได้",
  "This label will be deleted from all payment requests.": "ป้ายกำกับนี้จะถูกลบออกจากคำขอชำระเงินทั้งหมด",
  "This label will be deleted from this wallet and its associated transactions.": "ป้ายชื่อนี้จะถูกลบออกจากกระเงินเงินนี้และธุรกรรมที่เกี่ยวข้อง",
  "This Lightning Address will be removed.": "ที่อยู่ Lightning นี้จะถูกลบ",
  "this link": "ลิงก์นี้",
  "This offering will be removed from this store.": "ข้อเสนอนี้จะถูกลบออกจากร้านค้า",
  "This page exposes information to connect remotely to your full node via the P2P protocol.": "หน้านี้แสดงข้อมูลสำหรับการเชื่อมต่อระยะไกลไปยัง full node ของคุณผ่านโปรโตคอล P2P",
  "This page exposes information to connect remotely to your full node via the RPC protocol.": "หน้านี้แสดงข้อมูลสำหรับการเชื่อมต่อระยะไกลไปยัง full node ของคุณผ่านโปรโตคอล RPC",
  "This page exposes information to use the configured BTCPay Server Configurator to modify this setup.": "หน้านี้แสดงข้อมูลสำหรับใช้ BTCPay Server Configurator ที่ตั้งค่าไว้เพื่อแก้ไขการตั้งค่านี้",
  "This page is served in non-secure context (HTTPS, localhost or file://)": "หน้านี้ถูกเรียกใช้ในบริบทที่ไม่ปลอดภัย (HTTPS, localhost หรือ file://)",
  "This payment method requires javascript.": "วิธีการชำระเงินนี้ต้องใช้ javascript",
  "This permission is not available for your account.": "สิทธิ์นี้ไม่สามารถใช้ได้สำหรับบัญชีของคุณ",
  "This process disables 2FA until you verify your authenticator app and will also reset your 2FA recovery codes. If you do not complete your authenticator app configuration you may lose access to your account.": "กระบวนการนี้จะปิดการใช้งาน 2FA จนกว่าคุณจะยืนยันแอปพลิเคชันยืนยันตัวตนของคุณ และจะรีเซ็ตรหัสกู้คืน 2FA ของคุณด้วย หากคุณไม่ได้ตั้งค่าแอปพลิเคชันยืนยันตัวตนให้เสร็จสมบูรณ",
  "This processor cannot handle {0}.": "โปรเซสเซอร์นี้ไม่สามารถจัดการ {0} ได้",
  "This pull payment does not exists": "การเบิกจ่ายนี้ไม่มีอยู่",
  "This QR Code is only valid for 10 minutes": "QR Code นี้ใช้ได้เพียง 10 นาที",
  "This rate can also be overridden per item.": "อัตรานี้สามารถแทนที่ได้สำหรับแต่ละรายการ",
  "This store is ready to accept transactions, good job!": "ร้านค้านี้พร้อมรับการทำธุรกรรมแล้ว ทำได้ดีมาก!",
  "This store will still be accessible to users sharing it": "ร้านค้านี้จะยังคงสามารถเข้าถึงได้สำหรับผู้ใช้ที่แชร์ร้านค้านี้",
  "This transaction can't be RBF'd": "ธุรกรรมนี้ไม่สามารถใช้ RBF ได้",
  "This transaction will change your balance:": "ธุรกรรมนี้จะเปลี่ยนแปลงยอดคงเหลือของคุณ:",
  "This version of NBXplorer is not compatible. Please update to 2.5.22 or above": "เวอร์ชัน NBXplorer นี้ไม่สามารถใช้งานร่วมกันได้ กรุณาอัปเดตเป็นเวอร์ชัน 2.5.22 หรือสูงกว่า",
  "This webhook will be removed from this store.": "เว็บฮุคนี้จะถูกลบออกจากร้านค้านี้",
  "This will approve the user <strong>{0}</strong>.": "การดำเนินการนี้จะอนุมัติผู้ใช้ <strong>{0}</strong>",
  "This will send a verification email to <strong>{0}</strong>.": "การดำเนินการนี้จะส่งอีเมลยืนยันไปที่ <strong>{0}</strong>",
  "This will send a verification email to the user.": "ระบบจะส่งอีเมลยืนยันไปยังผู้ใช้",
  "This will send notification mails to the recipient, as configured by the <a href=\"{0}\">email rules</a>.": "การดำเนินการนี้จะส่งอีเมลแจ้งเตือนไปยังผู้รับ ตามที่กำหนดไว้ใน<a href=\"{0}\">กฎการส่งอีเมล</a>",
  "Those initial settings can be modified later.": "การตั้งค่าเริ่มต้นเหล่านี้สามารถแก้ไขได้ในภายหลัง",
  "Threshold": "เกณฑ์",
  "Time must be at least 1": "เวลาต้องมากกว่าหรือเท่ากับ 1",
  "Timestamp": "เวลาประทับ",
  "Tip": "ทิป",
  "Tip percentage amounts (comma separated)": "เปอร์เซ็นต์ทิป (คั่นด้วยเครื่องหมายจุลภาค)",
  "Tips": "ทิป",
  "Title": "ชื่อเรื่อง",
  "TLS certificate security\n                                    checks": "การตรวจสอบความปลอดภัย\nใบรับรอง TLS",
  "To": "ถึง",
  "To disable notification for a feature, kindly toggle off the specified feature.": "หากต้องการปิดการแจ้งเตือนสำหรับฟีเจอร์ กรุณาปิดสวิตช์ของฟีเจอร์ที่ระบุ",
  "To generate Greenfield API keys, please": "หากต้องการสร้างคีย์ API Greenfield กรุณา",
  "To start accepting payments, set up a store.": "เพื่อเริ่มรับการชำระเงิน กรุณาตั้งค่าร้านค้า",
  "To start accepting payments, set up a wallet or a Lightning node.": "เพื่อเริ่มรับการชำระเงิน โปรดตั้งค่ากระเป๋าเงินหรือโหนด Lightning",
  "To start using Pay Button, you need to enable this feature explicitly. Once you do so, anyone could create an invoice on your store (via API, for example).": "ในการเริ่มใช้งานปุ่มชำระเงิน คุณจำเป็นต้องเปิดใช้งานฟีเจอร์นี้อย่างชัดเจน เมื่อคุณเปิดใช้งานแล้ว ทุกคนจะสามารถสร้างใบแจ้งหนี้ในร้านค้าของคุณได้ (ผ่าน API เป็นต้น)",
  "To test your settings, enter an email address": "เพื่อทดสอบการตั้งค่าของคุณ กรุณากรอกที่อยู่อีเมล",
  "To use an authenticator app go through the following steps:": "วิธีใช้แอปพลิเคชันยืนยันตัวตน ให้ทำตามขั้นตอนต่อไปนี้:",
  "To use the translation from this dictionary's fallback, you can:": "หากต้องการใช้การแปลจากการสำรองของพจนานุกรมนี้ คุณสามารถ:",
  "Toggle passphrase visibility": "สลับการแสดงรหัสผ่าน",
  "Toggle password visibility": "สลับการแสดงรหัสผ่าน",
  "Toggle seed visibility": "สลับการแสดงคีย์สำรอง",
  "Token": "โทเคน",
  "Token Information": "ข้อมูลโทเคน",
  "Top Items": "รายการยอดนิยม",
  "Top Perks": "สิทธิประโยชน์ชั้นนำ",
  "Total": "ยอดรวม",
  "Total Balance": "ยอดรวมทั้งหมด",
  "Total Contributions": "ยอดเงินบริจาคทั้งหมด",
  "Total due": "ยอดรวมที่ต้องชำระ",
  "Total Sales": "ยอดขายทั้งหมด",
  "Transaction": "ธุรกรรม",
  "Transaction broadcasted successfully ({0})": "ทำรายการสำเร็จแล้ว ({0})",
  "Transaction fee": "ค่าธรรมเนียมการทำธุรกรรม",
  "Transaction fee rate:": "อัตราค่าธรรมเนียมการทำธุรกรรม:",
  "Transaction Id": "รหัสธุรกรรม",
  "Transaction signed successfully, proceeding to review...": "ลงนามธุรกรรมสำเร็จแล้ว กำลังดำเนินการตรวจสอบ...",
  "Transaction successfully signed": "ลงนามธุรกรรมสำเร็จแล้ว",
  "transactions": "ธุรกรรม",
  "Transactions": "ธุรกรรม",
  "Translations": "Please provide the English text you would like me to translate to Thai.",
  "Translations are formatted as JSON; for example, <b>{0}</b> translates <b>{1}</b> to <b>{2}</b>.": "การแปลถูกจัดรูปแบบเป็น JSON; ตัวอย่างเช่น <b>{0}</b> แปลเป็น <b>{1}</b> เป็น <b>{2}</b>",
  "Trial": "ทดลอง",
  "Trial Period": "ระยะเวลาทดลองใช้",
  "Trial Period (days)": "ระยะเวลาทดลองใช้ (วัน)",
  "Trigger": "ทริกเกอร์",
  "Turning on monetization creates a paid plan for your server.\n                        All newly registered users will be added to this plan.\n                        You may also migrate your existing users.\n                        Only users with an active subscription with access feature can log in and use your server.": "การเปิดใช้งานการเรียกเก็บเงินจะสร้างแผนการชำระเงินสำหรับเซิร์ฟเวอร์ของคุณ\nผู้ใช้ใหม่ที่ลงทะเบียนทั้งหมดจะถูกเพิ่มเข้าในแผนนี้\nคุณสามารถโอนย้ายผู้ใช้ที่มีอยู่ของ",
  "Two Factor Authentication": "การยืนยันตัวตนแบบสองขั้นตอน",
  "Two-Factor Authentication": "การยืนยันตัวตนแบบสองขั้นตอน",
  "Two-Factor Authentication (2FA) is an additional measure to protect your account. In addition to your password you will be asked for a second proof on login. This can be provided by an app (such as Google or Microsoft Authenticator) or a security device (like a Yubikey or your hardware wallet supporting FIDO2).": "การยืนยันตัวตนแบบสองขั้นตอน (2FA) เป็นมาตรการเสริมเพื่อปกป้องบัญชีของคุณ นอกเหนือจากรหัสผ่านแล้ว คุณจะถูกขอให้แสดงหลักฐานยืนยันตัวตนที่สองเมื่อเข้าสู่ระบบ ซึ่งสามารถทำได้",
  "txid, amount, comment, label": "txid, จำนวนเงิน, ความคิดเห็น, ป้ายกำกับ",
  "Type": "ประเภท",
  "Unable to create the replacement transaction ({0})": "ไม่สามารถสร้างธุรกรรมทดแทนได้ ({0})",
  "Unapprove": "ไม่อนุมัติ",
  "Unarchive": "ยกเลิกการเก็บถาวร",
  "Unarchive this app": "ยกเลิกการเก็บถาวรแอปนี้",
  "Unarchive this invoice": "ยกเลิกการเก็บถาวรใบแจ้งหนี้นี้",
  "Unarchive this payment request": "ยกเลิกการเก็บถาวรคำขอชำระเงินนี้",
  "Unarchive this store": "ยกเลิกการเก็บถาวรร้านค้านี้",
  "Unavailable": "ไม่พร้อมใช้งาน",
  "Unexpected address returned by the device...": "อุปกรณ์ส่งคืนที่อยู่ที่ไม่คาดคิด...",
  "Unexpected payjoin error: {0}": "ข้อผิดพลาดของ payjoin ที่ไม่คาดคิด: {0}",
  "Unify on-chain and lightning payment URL/QR code": "รวมการชำระเงินแบบออนเชนและไลท์นิงเข้าด้วยกันสำหรับ URL/คิวอาร์โค้ด",
  "Uninstall": "ถอนการติดตั้ง",
  "Uninstall all disabled plugins": "ถอนการติดตั้งปลั๊กอินที่ปิดใช้งานทั้งหมด",
  "Unknown": "ไม่ทราบ",
  "Unknown command": "คำสั่งไม่รู้จัก",
  "Unknown username": "ไม่รู้จักชื่อผู้ใช้",
  "Unmark test account": "ยกเลิกการทำเครื่องหมายบัญชีทดสอบ",
  "Unnamed Store": "ร้านค้าไม่มีชื่อ",
  "Unread": "ยังไม่ได้อ่าน",
  "Unsupported exchange": "ไม่รองรับการแลกเปลี่ยน",
  "Unsupported hardware wallet, try to update BTCPay Server Vault": "ฮาร์ดแวร์วอลเล็ตไม่รองรับ โปรดลองอัปเดต BTCPay Server Vault",
  "Unsuspend Access": "ยกเลิกการระงับการเข้าถึง",
  "Unusual": "ผิดปกติ",
  "Update": "อัพเดท",
  "Update Crowdfund": "อัปเดตการระดมทุน",
  "Update Password": "อัปเดตรหัสผ่าน",
  "Update Point of Sale": "อัปเดตจุดขาย",
  "Update Role": "พร้อมแปลเป็นภาษาไทย กรุณาส่งข้อความที่ต้องการแปล",
  "Update to the latest version of BTCPay Server.": "อัปเดตเป็นเวอร์ชันล่าสุดของ BTCPay Server",
  "Update Webhook": "อัปเดตเว็บฮุค",
  "Update your account": "อัปเดตบัญชีของคุณ",
  "Updated successfully.": "อัปเดตสำเร็จแล้ว",
  "Upgrade": "อัพเกรด",
  "Upload": "อัปโหลด",
  "Upload a file exported from your wallet": "อัปโหลดไฟล์ที่ส่งออกจากวอลเล็ตของคุณ",
  "Upload Plugin": "อัปโหลดปลั๊กอิน",
  "Upload PSBT from file…": "อัปโหลด PSBT จากไฟล์...",
  "Upload the file exported from your wallet.": "อัปโหลดไฟล์ที่ส่งออกจากวอลเล็ตของคุณ",
  "Uploaded By": "อัปโหลดโดย",
  "Url": "ยูอาร์แอล",
  "URL": "URL",
  "Url of the Dynamic DNS service you are using": "URL ของบริการ Dynamic DNS ที่คุณใช้งาน",
  "Use a simple input style": "ใช้รูปแบบอินพุตแบบง่าย",
  "Use App As Endpoint": "ใช้แอปเป็นจุดสิ้นสุด",
  "use case examples": "กรณีตัวอย่างการใช้งาน",
  "Use current URL": "ใช้ URL ปัจจุบัน",
  "Use custom node": "ใช้โหนดที่กำหนดเอง",
  "Use custom SMTP settings for this store": "ใช้การตั้งค่า SMTP แบบกำหนดเองสำหรับร้านค้านี้",
  "Use custom theme": "ใช้ธีมที่กำหนดเอง",
  "Use default pay button endpoint": "ใช้จุดสิ้นสุดของปุ่มชำระเงินเริ่มต้น",
  "Use Incognito mode or the Tor Browser to ensure no malicious browser plugins are running that could steal your key.": "ใช้โหมดไม่ระบุตัวตน (Incognito) หรือเบราว์เซอร์ทอร์ (Tor Browser) เพื่อให้แน่ใจว่าไม่มีปลั๊กอินเบราว์เซอร์ที่เป็นอันตรายทำงานอยู่ซึ่งอาจขโมยคีย์ของคุณได้",
  "Use internal node": "ใช้โหนดภายใน",
  "Use Modal": "ใช้ Modal",
  "Use PSBT": "ใช้ PSBT",
  "Use SSL": "ใช้ SSL",
  "Use the default Light or Dark Themes, or provide a custom CSS theme file below.": "ใช้ธีมสว่างหรือธีมมืดที่เป็นค่าเริ่มต้น หรือระบุไฟล์ธีม CSS แบบกำหนดเองด้านล่าง",
  "Use the store’s default": "ใช้ค่าเริ่มต้นของร้านค้า",
  "User": "ผู้ใช้",
  "User approved": "ผู้ใช้อนุมัติแล้ว",
  "User can input custom amount": "ผู้ใช้สามารถใส่จำนวนเงินเองได้",
  "User can input discount in %": "ผู้ใช้สามารถใส่ส่วนลดเป็น %",
  "User deleted": "ผู้ใช้ถูกลบแล้ว",
  "User disabled": "ผู้ใช้ถูกปิดการใช้งาน",
  "User enabled": "ผู้ใช้เปิดใช้งานแล้ว",
  "User is admin": "ผู้ใช้เป็นผู้ดูแลระบบ",
  "User is approved": "ผู้ใช้ได้รับการอนุมัติ",
  "User not found": "ไม่พบผู้ใช้",
  "User not found or invalid password": "ไม่พบผู้ใช้หรือรหัสผ่านไม่ถูกต้อง",
  "User removed successfully.": "ลบผู้ใช้สำเร็จแล้ว",
  "User successfully updated": "อัปเดตผู้ใช้สำเร็จแล้ว",
  "User unapproved": "ผู้ใช้ไม่ได้รับการอนุมัติ",
  "User Updates": "การอัปเดตผู้ใช้",
  "User was the last enabled admin and could not be disabled.": "ผู้ใช้เป็นแอดมินที่เปิดใช้งานคนสุดท้ายและไม่สามารถปิดการใช้งานได้",
  "user@example.com": "user@example.com",
  "Username could not be removed": "ไม่สามารถลบชื่อผู้ใช้ได้",
  "Username is already taken": "ชื่อผู้ใช้นี้ถูกใช้งานแล้ว",
  "Users": "ผู้ใช้งาน",
  "Uses the store's default currency ({0}) if empty.": "ใช้สกุลเงินเริ่มต้นของร้านค้า ({0}) หากไม่ได้ระบุ",
  "Using an HD private key or mnemonic seed": "การใช้คีย์ส่วนตัว HD หรือ มนีโมนิค ซีด",
  "Using apps such as Google or Microsoft Authenticator.": "การใช้แอปพลิเคชันเช่น Google หรือ Microsoft Authenticator",
  "Using BTCPay Server Vault": "การใช้งาน BTCPay Server Vault",
  "Using BTCPay Server Vault (NFC)": "การใช้ BTCPay Server Vault (NFC)",
  "Using the BTCPay Server internal node for this store requires no further configuration. Click the save\n                    button below to start accepting Bitcoin through the Lightning Network.": "การใช้โหนดภายในของ BTCPay Server สำหรับร้านค้านี้ไม่จำเป็นต้องตั้งค่าเพิ่มเติม คลิกปุ่มบันทึกด้านล่างเพื่อเริ่มรับชำระเงินด้วย Bitcoin ผ่านเครือข่าย Lightning",
  "Using the payment button for e-commerce integrations is not recommended since order relevant information can be modified by the user. For e-commerce, you should use our {0}. If this store process commercial transactions, we advise you to {1} before using the payment button.": "การใช้ปุ่มชำระเงินสำหรับการผสานระบบอีคอมเมิร์ซไม่แนะนำ เนื่องจากข้อมูลที่เกี่ยวข้องกับคำสั่งซื้อสามารถถูกแก้ไขโดยผู้ใช้ได้ สำหรับอีคอมเมิร์ซ คุณควรใช้ {0} หากร้านค้",
  "UTXOs to spend from": "UTXO ที่จะใช้จ่าย",
  "Valid for {0} seconds": "ใช้ได้อีก {0} วินาที",
  "Validated blocks: {0}": "บล็อกที่ตรวจสอบแล้ว: {0}",
  "Value": "มูลค่า",
  "Value Mapper": "ตัวแมปค่า",
  "Value to match": "มูลค่าที่ต้องจ่าย",
  "Value to set": "ค่าที่จะตั้ง",
  "Verification Code": "รหัสยืนยัน",
  "Verification email sent": "ส่งอีเมลยืนยันแล้ว",
  "Verification email sent. Please check your email.": "อีเมลยืนยันถูกส่งแล้ว กรุณาตรวจสอบอีเมลของคุณ",
  "Verify": "ตรวจสอบ",
  "Verify that the <code>orderId</code> is from your backend, that the <code>price</code> is correct and that <code>status</code> is <code>settled</code>": "ตรวจสอบว่า <code>orderId</code> มาจากระบบหลังบ้านของคุณ <code>price</code> ถูกต้อง และ <code>status</code> เป็น <code>settled</code>",
  "Verifying pin...": "กำลังตรวจสอบรหัส PIN...",
  "via HTTP": "ผ่าน HTTP",
  "via HTTPS": "ผ่าน HTTPS",
  "via TCP or unix domain socket connection": "ผ่านการเชื่อมต่อ TCP หรือ unix domain socket",
  "via the REST API": "ผ่าน REST API",
  "View": "ดู",
  "View All": "ดูทั้งหมด",
  "View all supporters": "ดูผู้สนับสนุนทั้งหมด",
  "View Invite": "ดูคำเชิญ",
  "View Reserved Addresses with this label": "ดูที่อยู่ที่สงวนไว้ด้วยป้ายกำกับนี้",
  "View seed": "ดูซีด",
  "Waiting for NFC to be presented...": "กำลังรอให้นำ NFC มาแตะ...",
  "Wallet": "กระเป๋าเงิน",
  "Wallet Balance": "ยอดคงเหลือในกระเป๋าเงิน",
  "Wallet file": "ไฟล์วอลเล็ต",
  "Wallet file content": "เนื้อหาไฟล์วอลเล็ต",
  "Wallet Labels (BIP-329)": "ป้ายกำกับวอลเล็ต (BIP-329)",
  "Wallet Recovery Seed": "รหัสกู้คืนวอลเล็ต",
  "Wallet settings for {0} have been updated.": "การตั้งค่ากระเป๋าเงินสำหรับ {0} ได้รับการอัปเดตแล้ว",
  "Wallet's fingerprint fetched.": "ดึงลายนิ้วมือของวอลเล็ตแล้ว",
  "Wallet's private key is erased from the server. Higher security. To spend, you have to manually input the private key or import it into an external wallet.": "กุญแจส่วนตัวของวอลเล็ตถูกลบออกจากเซิร์ฟเวอร์แล้ว ความปลอดภัยสูงขึ้น หากต้องการใช้จ่าย คุณต้องป้อนกุญแจส่วนตัวด้วยตนเองหรือนำเข้าไปยังวอลเล็ตภายนอก",
  "Wallet's private key is stored on the server. Spending the funds you received is convenient. To minimize the risk of theft, regularly withdraw funds to a different wallet.": "กุญแจส่วนตัวของวอลเล็ตถูกเก็บไว้บนเซิร์ฟเวอร์ การใช้จ่ายเงินที่คุณได้รับนั้นสะดวก เพื่อลดความเสี่ยงจากการถูกขโมย ควรถอนเงินไปยังวอลเล็ตอื่นเป็นประจำ",
  "Wallets": "กระเป๋าเงิน",
  "Warning: No wallet has been linked to your BTCPay Server Store.": "คำเตือน: ไม่มีวอลเล็ตที่เชื่อมต่อกับร้านค้า BTCPay Server ของคุณ",
  "Warning: Payment button should only be used for tips and donations": "คำเตือน: ปุ่มชำระเงินควรใช้สำหรับทิปและการบริจาคเท่านั้น",
  "was paid after expiration": "ชำระเงินหลังจากหมดอายุ",
  "Watch-only wallet": "วอลเล็ตแบบดูอย่างเดียว",
  "We all forget passwords sometimes. Just provide email address tied to your account, and we'll start the process of helping you recover your account.": "บางครั้งเราก็ลืมรหัสผ่านกันได้ โปรดระบุที่อยู่อีเมลที่ผูกกับบัญชีของคุณ แล้วเราจะเริ่มกระบวนการช่วยกู้คืนบัญชีของคุณ",
  "We rejected the receiver's payjoin proposal: {0}": "เราปฏิเสธข้อเสนอ payjoin ของผู้รับ: {0}",
  "We will try to redeliver any failed delivery after 10 seconds, 1 minute and up to 6 times after 10 minutes": "เราจะพยายามส่งใหม่หากการส่งล้มเหลวหลังจาก 10 วินาที, 1 นาที และสูงสุด 6 ครั้งหลังจาก 10 นาที",
  "Webhook successfully deleted": "ลบ Webhook สำเร็จแล้ว",
  "Webhooks": "เว็บฮุค",
  "Webhooks allow BTCPay Server to send HTTP events related to your store to another server.": "เว็บฮุค (Webhooks) ช่วยให้ BTCPay Server สามารถส่งเหตุการณ์ HTTP ที่เกี่ยวข้องกับร้านค้าของคุณไปยังเซิร์ฟเวอร์อื่นได้",
  "Welcome to {0}": "ยินดีต้อนรับสู่ {0}",
  "Well-known Dynamic DNS providers are:": "ผู้ให้บริการ Dynamic DNS ที่เป็นที่รู้จัก ได้แก่:",
  "When this is enabled for a hot wallet, you are also able to use the node wallet to spend.": "เมื่อเปิดใช้งานสำหรับฮอตวอลเล็ต คุณจะสามารถใช้วอลเล็ตโหนดเพื่อใช้จ่ายได้",
  "Where to redirect the customer after payment is complete": "จะให้เปลี่ยนเส้นทางลูกค้าไปที่ไหนหลังจากการชำระเงินเสร็จสมบูรณ์",
  "Which events would you like to trigger this webhook?": "คุณต้องการให้เว็บฮุคนี้ทำงานเมื่อเกิดเหตุการณ์ใด",
  "Who to send the email to. For multiple emails, separate with a comma.": "ส่งอีเมลถึงใคร สำหรับหลายอีเมล ให้คั่นด้วยเครื่องหมายจุลภาค",
  "With <code>DOGE_USD</code> will be expanded to <code>bitpay(DOGE_BTC) * kraken(BTC_USD)</code>. And\n                            <code>DOGE_CAD</code> will be expanded to <code>bitpay(DOGE_BTC) * ndax(BTC_CAD)</code>.<br />However, we advise you to write it\n                            that\n                            way to increase coverage so that <code>DOGE_BTC</code> is also supported:": "ด้วย <code>DOGE_USD</code> จะถูกขยายเป็น <code>bitpay(DOGE_BTC) * kraken(BTC_USD)</code> และ <code>DOGE_CAD</code> จะถูกขยายเป็น <code>bitpay(DOGE_BTC) * ndax(BTC_CAD)</code><br />อย่างไรก็ตาม เราแนะนำให้คุณเขียนในรูปแบบนี้เพื่อ",
  "Would you like to charge <span class=\"subscriber-name fw-semibold\"></span>?": "คุณต้องการเรียกเก็บเงินจาก <span class=\"subscriber-name fw-semibold\"></span> หรือไม่?",
  "Would you like to credit <span class=\"subscriber-name fw-semibold\"></span>?": "คุณต้องการเครดิตให้ <span class=\"subscriber-name fw-semibold\"></span> หรือไม่?",
  "Would you like to downgrade <span class=\"subscriber-name fw-semibold\"></span> to <b class=\"changePlanName\"></b> ?": "คุณต้องการลดระดับ <span class=\"subscriber-name fw-semibold\"></span> เป็น <b class=\"changePlanName\"></b> หรือไม่?",
  "Would you like to invite a new subscriber?": "คุณต้องการเชิญสมาชิกใหม่หรือไม่?",
  "Would you like to proceed with suspending the following user?": "คุณต้องการดำเนินการระงับผู้ใช้ต่อไปนี้หรือไม่?",
  "Would you like to upgrade <span class=\"subscriber-name fw-semibold\"></span> to <b class=\"changePlanName\"></b>?": "คุณต้องการอัพเกรด <span class=\"subscriber-name fw-semibold\"></span> เป็น <b class=\"changePlanName\"></b> หรือไม่?",
  "Yes": "Please provide the English text you would like me to translate to Thai.",
  "You are not server administrator": "คุณไม่ใช่ผู้ดูแลระบบเซิร์ฟเวอร์",
  "You are server administrator": "คุณเป็นผู้ดูแลระบบเซิร์ฟเวอร์",
  "You can also apply filters to your search by searching for <code>filtername:value</code>. Be sure to split your search parameters with comma. Supported filters are:": "คุณสามารถใช้ตัวกรองกับการค้นหาของคุณได้โดยค้นหาด้วย <code>filtername:value</code> โปรดแน่ใจว่าได้แยกพารามิเตอร์การค้นหาด้วยเครื่องหมายจุลภาค ตัวกรองที่รองรับมีดังนี้:",
  "You can also share the link/LNURL or encode it in a QR code.": "คุณสามารถแชร์ลิงก์/LNURL หรือเข้ารหัสในรูปแบบ QR code ได้",
  "You can also use this LNDhub-URL as the connection string and BTCPay Server converts it into the expected\n                                <code>type=lndhub</code> connection string format:": "คุณสามารถใช้ LNDhub-URL นี้เป็นสตริงการเชื่อมต่อและ BTCPay Server จะแปลงมันเป็นรูปแบบสตริงการเชื่อมต่อ <code>type=lndhub</code> ที่ต้องการ",
  "You can change the domain name of your server by following {0}.": "คุณสามารถเปลี่ยนชื่อโดเมนของเซิร์ฟเวอร์ของคุณได้โดยทำตาม {0}",
  "You can decode a PSBT by either pasting its content, uploading the file or scanning the wallet QR code.": "คุณสามารถถอดรหัส PSBT ได้โดยการวางเนื้อหา อัปโหลดไฟล์ หรือสแกนรหัส QR ของวอลเล็ต",
  "You can embed this POS via an iframe.": "คุณสามารถฝัง POS นี้ผ่าน iframe ได้",
  "You can enter here SSH public keys authorized to connect to your server.": "คุณสามารถป้อนคีย์สาธารณะ SSH ที่ได้รับอนุญาตให้เชื่อมต่อกับเซิร์ฟเวอร์ของคุณได้ที่นี่",
  "You can give this server a custom name, which will appear on public facing pages.": "คุณสามารถตั้งชื่อเซิร์ฟเวอร์ได้ตามต้องการ ซึ่งจะปรากฏบนหน้าเว็บที่แสดงต่อสาธารณะ",
  "You can host point of sale buttons in an external website with the following code.": "คุณสามารถโฮสต์ปุ่มจุดขายในเว็บไซต์ภายนอกได้ด้วยโค้ดต่อไปนี้",
  "You can omit <code>certthumbprint</code> if the certificate is trusted by your machine. The <code>certthumbprint</code> can be\n                                obtained using this command:": "คุณสามารถละเว้น <code>certthumbprint</code> ได้หากเครื่องของคุณเชื่อถือใบรับรอง สามารถรับ <code>certthumbprint</code> ได้โดยใช้คำสั่งนี้:",
  "You can only refund an invoice that has been settled. Please wait for the transaction to confirm on the blockchain before attempting to refund it.": "คุณสามารถคืนเงินได้เฉพาะใบแจ้งหนี้ที่ชำระเงินแล้วเท่านั้น กรุณารอให้ธุรกรรมได้รับการยืนยันบนบล็อกเชนก่อนที่จะพยายามคืนเงิน",
  "You can sign the transaction using one of the following methods.": "คุณสามารถลงนามธุรกรรมได้โดยใช้วิธีใดวิธีหนึ่งต่อไปนี้",
  "You can then ship your order": "คุณสามารถจัดส่งคำสั่งซื้อของคุณได้",
  "You can use QR Code to connect to {0} with compatible wallets.": "คุณสามารถใช้ QR Code เพื่อเชื่อมต่อกับ {0} ด้วยวอลเล็ตที่รองรับ",
  "You can use QR Code to connect to your {0} from your mobile.": "คุณสามารถใช้คิวอาร์โค้ดเพื่อเชื่อมต่อกับ {0} จากมือถือของคุณ",
  "You can use this QR Code to connect external software to your C-Lightning instance.<br />": "คุณสามารถใช้ QR Code นี้เพื่อเชื่อมต่อซอฟต์แวร์ภายนอกกับ C-Lightning ของคุณ<br />",
  "You can use this QR Code to connect external software to your LND instance. This QR Code is only valid for 10 minutes.": "คุณสามารถใช้คิวอาร์โค้ดนี้เพื่อเชื่อมต่อซอฟต์แวร์ภายนอกกับ LND ของคุณ คิวอาร์โค้ดนี้ใช้ได้เพียง 10 นาทีเท่านั้น",
  "You cannot edit an archived payment request.": "คุณไม่สามารถแก้ไขคำขอชำระเงินที่ถูกเก็บถาวรได้",
  "You cannot login over an insecure connection. Please use HTTPS or Tor.": "คุณไม่สามารถเข้าสู่ระบบผ่านการเชื่อมต่อที่ไม่ปลอดภัย กรุณาใช้ HTTPS หรือ Tor",
  "You currently have no stores configured.": "คุณยังไม่ได้กำหนดค่าร้านค้าใดๆ",
  "You do not have a local username/password for this site. Add a local account so you can log in without an external login.": "คุณไม่มีชื่อผู้ใช้/รหัสผ่านในระบบนี้ กรุณาเพิ่มบัญชีผู้ใช้ในระบบเพื่อให้สามารถเข้าสู่ระบบได้โดยไม่ต้องใช้การเข้าสู่ระบบจากภายนอก",
  "You do not have the permissions to change this settings": "คุณไม่มีสิทธิ์เปลี่ยนแปลงการตั้งค่านี้",
  "You have no recovery codes left.": "คุณไม่มีรหัสกู้คืนเหลืออยู่",
  "You have requested to log in with a recovery code. This login will not be remembered until you provide an authenticator app code at login or disable 2FA and log in again.": "คุณได้ร้องขอเข้าสู่ระบบด้วยรหัสกู้คืน การเข้าสู่ระบบนี้จะไม่ถูกจดจำจนกว่าคุณจะใส่รหัสจากแอปพลิเคชันยืนยันตัวตนในการเข้าสู่ระบบ หรือปิดการใช้งาน 2FA และเข้าสู่ระบบอีกคร",
  "You have successfully signed out.": "คุณออกจากระบบเรียบร้อยแล้ว",
  "You must enable at least one payment method before creating a payout.": "คุณต้องเปิดใช้งานวิธีการชำระเงินอย่างน้อยหนึ่งวิธีก่อนที่จะสร้างการจ่ายเงิน",
  "You must enable at least one payment method before creating a pull payment.": "คุณต้องเปิดใช้งานวิธีการชำระเงินอย่างน้อยหนึ่งวิธีก่อนที่จะสร้างการชำระเงินแบบพูล",
  "You must have a confirmed email to log in.": "คุณต้องมีอีเมลที่ยืนยันแล้วเพื่อเข้าสู่ระบบ",
  "You need at least one payout method": "คุณต้องมีวิธีการจ่ายเงินอย่างน้อยหนึ่งวิธี",
  "You need to configure email settings before this feature works. <a class='alert-link configure-email' href='{0}'>Configure email settings</a>.": "คุณต้องกำหนดค่าอีเมลก่อนที่ฟีเจอร์นี้จะทำงาน <a class='alert-link configure-email' href='{0}'>กำหนดค่าอีเมล</a>",
  "You need to connect to a Lightning node before adjusting its settings.": "คุณต้องเชื่อมต่อกับโหนด Lightning ก่อนที่จะปรับการตั้งค่า",
  "You need to restart BTCPay Server in order to update your active plugins.": "คุณจำเป็นต้องรีสตาร์ท BTCPay Server เพื่ออัปเดตปลั๊กอินที่ใช้งานอยู่",
  "You need to select a store before creating an invoice.": "คุณต้องเลือกร้านค้าก่อนสร้างใบแจ้งหนี้",
  "You need to select a store first": "คุณต้องเลือกร้านค้าก่อน",
  "You need to update your version of NBXplorer": "คุณจำเป็นต้องอัปเดตเวอร์ชัน NBXplorer ของคุณ",
  "You only have 1 recovery code left.": "คุณเหลือรหัสกู้คืนเพียง 1 รหัสเท่านั้น",
  "You really should not type your seed into a device that is connected to the internet.": "คุณไม่ควรพิมพ์ซีดเฟรสของคุณลงในอุปกรณ์ที่เชื่อมต่อกับอินเทอร์เน็ต",
  "Your access to BTCPay Server is over an unsecured network. If you are using the docker deployment method with NGINX and HTTPS is not available, you probably did not configure your DNS settings correctly. We disabled the register and login link so you don't leak your credentials.": "การเข้าถึง BTCPay Server ของคุณอยู่บนเครือข่ายที่ไม่ปลอดภัย หากคุณใช้วิธีการติดตั้งแบบ docker กับ NGINX และไม่สามารถใช้ HTTPS ได้ คุณอาจตั้งค่า DNS ไม่ถูกต้อง เราได้ปิดการใช้งานลิงก์ลงทะเบียนและเข้",
  "Your account has been disabled. Please contact server administrator.": "บัญชีของคุณถูกปิดการใช้งาน กรุณาติดต่อผู้ดูแลระบบ",
  "Your account will no longer be linked to the lightning node <strong>{0}</strong> as an option for two-factor authentication.": "บัญชีของคุณจะไม่เชื่อมต่อกับโหนด Lightning <strong>{0}</strong> ในฐานะตัวเลือกสำหรับการยืนยันตัวตนแบบสองขั้นตอนอีกต่อไป",
  "Your account will no longer have the security device <strong>{0}</strong> as an option for two-factor authentication.": "บัญชีของคุณจะไม่มีอุปกรณ์ความปลอดภัย <strong>{0}</strong> เป็นตัวเลือกสำหรับการยืนยันตัวตนแบบสองขั้นตอนอีกต่อไป",
  "Your account will no longer have this Lightning wallet as an option for two-factor authentication.": "บัญชีของคุณจะไม่มีวอลเล็ต Lightning นี้เป็นตัวเลือกสำหรับการยืนยันตัวตนแบบสองขั้นตอนอีกต่อไป",
  "Your account will no longer have this security device as an option for two-factor authentication.": "บัญชีของคุณจะไม่มีอุปกรณ์ความปลอดภัยนี้เป็นตัวเลือกสำหรับการยืนยันตัวตนแบบสองขั้นตอนอีกต่อไป",
  "Your available balance is": "ยอดเงินคงเหลือของคุณคือ",
  "Your dynamic DNS hostname": "โฮสต์เนม DNS แบบไดนามิกของคุณ",
  "Your email has been confirmed.": "อีเมลของคุณได้รับการยืนยันแล้ว",
  "Your email has been confirmed. Please set your password.": "อีเมลของคุณได้รับการยืนยันแล้ว กรุณาตั้งรหัสผ่านของคุณ",
  "Your email server has not been configured.": "เซิร์ฟเวอร์อีเมลของคุณยังไม่ได้ตั้งค่า",
  "Your existing recovery codes will no longer be valid!": "รหัสกู้คืนที่มีอยู่ของคุณจะไม่สามารถใช้งานได้อีกต่อไป!",
  "Your instance administrator has disabled the use of the Internal node for non-admin users.": "ผู้ดูแลระบบของคุณได้ปิดการใช้งานโหนดภายในสำหรับผู้ใช้ที่ไม่ใช่ผู้ดูแลระบบ",
  "Your node address: {0}": "ที่อยู่โหนดของคุณ: {0}",
  "Your password has been changed.": "รหัสผ่านของคุณได้รับการเปลี่ยนแปลงแล้ว",
  "Your password has been set by the user who invited you.": "รหัสผ่านของคุณถูกตั้งค่าโดยผู้ใช้ที่เชิญคุณ",
  "Your password has been set.": "รหัสผ่านของคุณได้ถูกตั้งค่าแล้ว",
  "Your plan does not allow you to log in.": "แผนของคุณไม่อนุญาตให้เข้าสู่ระบบ",
  "Your profile has been updated": "อัปเดตโปรไฟล์ของคุณแล้ว",
  "Your subscription is not active.": "การสมัครสมาชิกของคุณไม่ได้ใช้งาน",
  "Your subscription is suspended. {0}": "การสมัครสมาชิกของคุณถูกระงับ {0}",
  "Your two-factor authenticator app will provide you with a unique code.": "แอปพลิเคชันยืนยันตัวตนแบบสองขั้นตอนของคุณจะให้รหัสเฉพาะกับคุณ",
  "Your user account has no password set.": "บัญชีผู้ใช้ของคุณยังไม่ได้ตั้งรหัสผ่าน",
  "Your user account is currently disabled.": "บัญชีผู้ใช้ของคุณถูกปิดการใช้งานในขณะนี้",
  "Your user account requires approval by an admin before you can log in.": "บัญชีผู้ใช้ของคุณต้องได้รับการอนุมัติจากผู้ดูแลระบบก่อนที่คุณจะสามารถเข้าสู่ระบบได้",
  "Your wallet has been generated.": "กระเป๋าเงินของคุณถูกสร้างขึ้นแล้ว",
  "Zero amount invoices are disabled": "ใบแจ้งหนี้ที่มีจำนวนเงินเป็นศูนย์ถูกปิดการใช้งาน"
}